industries_tree = [
    {"name": "Электроэнергетика", "children": []},
    {"name": "Топливная промышленность", "children": []},
    {"name": "Чёрная металлургия", "children": []},
    {"name": "Цветная металлургия", "children": []},
    {"name": "Химическая промышленность", "children": []},
    {"name": "Нефтехимическая промышленность", "children": []},
    {"name": "Машиностроение и металлообработка", "children": []},
    {
        "name": "Лесная, деревообрабатывающая и целлюлозно-бумажная промышленность",
        "children": []
    },
    {"name": "Промышленность строительных материалов", "children": []},
    {"name": "Стекольная и фарфоро-фаянсовая промышленность", "children": []},
    {"name": "Лёгкая промышленность", "children": []},
    {"name": "Пищевая промышленность", "children": []},
    {"name": "Микробиологическая промышленность", "children": []},
    {"name": "Мукомольно-крупяная и комбикормовая промышленность", "children": []},
    {"name": "Медицинская промышленность", "children": []},
    {"name": "Полиграфическая промышленность", "children": []},
]