krp_dict = [
    {
        "code": "100",
        "name": "Малые предприятия",
        "path": "100/",
        "children": [
            {"code": "105", "name": "Малые предприятия (<= 5)", "path": "100/105/", "children": []},
            {"code": "110", "name": "Малые предприятия (6-10)", "path": "100/110/", "children": []},
            {"code": "115", "name": "Малые предприятия (11-15)", "path": "100/115/", "children": []},
            {"code": "120", "name": "Малые предприятия (16-20)", "path": "100/120/", "children": []},
            {"code": "130", "name": "Малые предприятия (21-30)", "path": "100/130/", "children": []},
            {"code": "140", "name": "Малые предприятия (31-40)", "path": "100/140/", "children": []},
            {"code": "150", "name": "Малые предприятия (41-50)", "path": "100/150/", "children": []},
            {"code": "160", "name": "Малые предприятия (51-100)", "path": "100/160/", "children": []},
        ],
    },
    {
        "code": "200",
        "name": "Средние предприятия",
        "path": "200/",
        "children": [
            {"code": "215", "name": "Средние предприятия (101-150)", "path": "200/215/", "children": []},
            {"code": "220", "name": "Средние предприятия (151-200)", "path": "200/220/", "children": []},
            {"code": "225", "name": "Средние предприятия (201-250)", "path": "200/225/", "children": []},
        ],
    },
    {
        "code": "300",
        "name": "Крупные предприятия",
        "path": "300/",
        "children": [
            {"code": "305", "name": "Крупные предприятия (251-500)", "path": "300/305/", "children": []},
            {"code": "310", "name": "Крупные предприятия (501-1000)", "path": "300/310/", "children": []},
            {"code": "311", "name": "Крупные предприятия (> 1000)", "path": "300/311/", "children": []},
        ],
    },
]
