kse_dict = [
  {
    "code": "1",
    "name": "Экономика в целом",
    "children": [
      {
        "code": "11",
        "name": "Нефинансовые корпорации",
        "children": [
          {
            "code": "111",
            "name": "Государственные нефинансовые корпорации",
            "children": [
              {
                "code": "1111",
                "name": "Государственные нефинансовые корпорации – НКО",
                "children": []
              },
              {
                "code": "1112",
                "name": "Государственные нефинансовые корпорации – ОПП",
                "children": []
              }
            ]
          },
          {
            "code": "112",
            "name": "Национальные частные нефинансовые корпорации",
            "children": [
              {
                "code": "1121",
                "name": "Национальные частные нефинансовые корпорации – НКО",
                "children": []
              },
              {
                "code": "1122",
                "name": "Национальные частные нефинансовые корпорации – ОПП",
                "children": []
              }
            ]
          },
          {
            "code": "113",
            "name": "Нефинансовые корпорации под иностранным контролем",
            "children": [
              {
                "code": "1131",
                "name": "Нефинансовые корпорации под иностранным контролем – НКО",
                "children": []
              },
              {
                "code": "1132",
                "name": "Нефинансовые корпорации под иностранным контролем – ОПП",
                "children": []
              }
            ]
          }
        ]
      },
      {
        "code": "12",
        "name": "Финансовые корпорации",
        "children": [
          {
            "code": "121",
            "name": "Центральный банк",
            "children": []
          },
          {
            "code": "122",
            "name": "Корпорации, принимающие депозиты, кроме центрального банка",
            "children": [
              {
                "code": "1221",
                "name": "Государственные корпорации, принимающие депозиты",
                "children": [
                  {
                    "code": "12211",
                    "name": "Государственные корпорации, принимающие депозиты – НКО",
                    "children": []
                  },
                  {
                    "code": "12212",
                    "name": "Государственные корпорации, принимающие депозиты – ОПП",
                    "children": []
                  }
                ]
              },
              {
                "code": "1222",
                "name": "Национальные частные корпорации, принимающие депозиты",
                "children": [
                  {
                    "code": "12221",
                    "name": "Национальные частные корпорации, принимающие депозиты – НКО",
                    "children": []
                  },
                  {
                    "code": "12222",
                    "name": "Национальные частные корпорации, принимающие депозиты – ОПП",
                    "children": []
                  }
                ]
              },
              {
                "code": "1223",
                "name": "Корпорации, принимающие депозиты, под иностранным контролем",
                "children": [
                  {
                    "code": "12231",
                    "name": "Корпорации, принимающие депозиты, под иностранным контролем – НКО",
                    "children": []
                  },
                  {
                    "code": "12232",
                    "name": "Корпорации, принимающие депозиты, под иностранным контролем – ОПП",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "code": "123",
            "name": "Фонды денежного рынка",
            "children": [
              {
                "code": "1231",
                "name": "Государственные фонды денежного рынка",
                "children": [
                  {
                    "code": "12311",
                    "name": "Государственные фонды денежного рынка – НКО",
                    "children": []
                  },
                  {
                    "code": "12312",
                    "name": "Государственные фонды денежного рынка – ОПП",
                    "children": []
                  }
                ]
              },
              {
                "code": "1232",
                "name": "Национальные частные фонды денежного рынка",
                "children": [
                  {
                    "code": "12321",
                    "name": "Национальные частные фонды денежного рынка – НКО",
                    "children": []
                  },
                  {
                    "code": "12322",
                    "name": "Национальные частные фонды денежного рынка – ОПП",
                    "children": []
                  }
                ]
              },
              {
                "code": "1233",
                "name": "Фонды денежного рынка под иностранным контролем",
                "children": [
                  {
                    "code": "12331",
                    "name": "Фонды денежного рынка под иностранным контролем – НКО",
                    "children": []
                  },
                  {
                    "code": "12332",
                    "name": "Фонды денежного рынка под иностранным контролем – ОПП",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "code": "124",
            "name": "Инвестиционные фонды неденежного рынка",
            "children": [
              {
                "code": "1241",
                "name": "Государственные инвестиционные фонды неденежного рынка",
                "children": [
                  {
                    "code": "12411",
                    "name": "Государственные инвестиционные фонды неденежного рынка – НКО",
                    "children": []
                  },
                  {
                    "code": "12412",
                    "name": "Государственные инвестиционные фонды неденежного рынка – ОПП",
                    "children": []
                  }
                ]
              },
              {
                "code": "1242",
                "name": "Национальные частные инвестиционные фонды неденежного рынка",
                "children": [
                  {
                    "code": "12421",
                    "name": "Национальные частные инвестиционные фонды неденежного рынка – НКО",
                    "children": []
                  },
                  {
                    "code": "12422",
                    "name": "Национальные частные инвестиционные фонды неденежного рынка – ОПП",
                    "children": []
                  }
                ]
              },
              {
                "code": "1243",
                "name": "Инвестиционные фонды неденежного рынка под иностранным контролем",
                "children": [
                  {
                    "code": "12431",
                    "name": "Инвестиционные фонды неденежного рынка под иностранным контролем – НКО",
                    "children": []
                  },
                  {
                    "code": "12432",
                    "name": "Инвестиционные фонды неденежного рынка под иностранным контролем – ОПП",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "code": "125",
            "name": "Другие финансовые посредники, кроме страховых корпораций и пенсионных фондов",
            "children": [
              {
                "code": "1251",
                "name": "Другие государственные финансовые посредники",
                "children": [
                  {
                    "code": "12511",
                    "name": "Другие государственные финансовые посредники – НКО",
                    "children": []
                  },
                  {
                    "code": "12512",
                    "name": "Другие государственные финансовые посредники – ОПП",
                    "children": []
                  }
                ]
              },
              {
                "code": "1252",
                "name": "Другие национальные частные финансовые посредники",
                "children": [
                  {
                    "code": "12521",
                    "name": "Другие национальные частные финансовые посредники – НКО",
                    "children": []
                  },
                  {
                    "code": "12522",
                    "name": "Другие национальные частные финансовые посредники – ОПП",
                    "children": []
                  }
                ]
              },
              {
                "code": "1253",
                "name": "Другие финансовые посредники под иностранным контролем",
                "children": [
                  {
                    "code": "12531",
                    "name": "Другие финансовые посредники под иностранным контролем – НКО",
                    "children": []
                  },
                  {
                    "code": "12532",
                    "name": "Другие финансовые посредники под иностранным контролем – ОПП",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "code": "126",
            "name": "Вспомогательные финансовые корпорации",
            "children": [
              {
                "code": "1261",
                "name": "Государственные вспомогательные финансовые корпорации",
                "children": [
                  {
                    "code": "12611",
                    "name": "Государственные вспомогательные финансовые корпорации – НКО",
                    "children": []
                  },
                  {
                    "code": "12612",
                    "name": "Государственные вспомогательные финансовые корпорации – ОПП",
                    "children": []
                  }
                ]
              },
              {
                "code": "1262",
                "name": "Национальные частные вспомогательные финансовые корпорации",
                "children": [
                  {
                    "code": "12621",
                    "name": "Национальные частные вспомогательные финансовые корпорации – НКО",
                    "children": []
                  },
                  {
                    "code": "12622",
                    "name": "Национальные частные вспомогательные финансовые корпорации – ОПП",
                    "children": []
                  }
                ]
              },
              {
                "code": "1263",
                "name": "Вспомогательные финансовые корпорации под иностранным контролем",
                "children": [
                  {
                    "code": "12631",
                    "name": "Вспомогательные финансовые корпорации под иностранным контролем – НКО",
                    "children": []
                  },
                  {
                    "code": "12632",
                    "name": "Вспомогательные финансовые корпорации под иностранным контролем – ОПП",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "code": "127",
            "name": "Кэптивные финансовые учреждения и кредиторы",
            "children": [
              {
                "code": "1271",
                "name": "Государственные кэптивные финансовые учреждения",
                "children": [
                  {
                    "code": "12711",
                    "name": "Государственные кэптивные финансовые учреждения – НКО",
                    "children": []
                  },
                  {
                    "code": "12712",
                    "name": "Государственные кэптивные финансовые учреждения – ОПП",
                    "children": []
                  }
                ]
              },
              {
                "code": "1272",
                "name": "Национальные частные кэптивные финансовые учреждения",
                "children": [
                  {
                    "code": "12721",
                    "name": "Национальные частные кэптивные финансовые учреждения – НКО",
                    "children": []
                  },
                  {
                    "code": "12722",
                    "name": "Национальные частные кэптивные финансовые учреждения – ОПП",
                    "children": []
                  }
                ]
              },
              {
                "code": "1273",
                "name": "Кэптивные финансовые учреждения под иностранным контролем",
                "children": [
                  {
                    "code": "12731",
                    "name": "Кэптивные финансовые учреждения под иностранным контролем – НКО",
                    "children": []
                  },
                  {
                    "code": "12732",
                    "name": "Кэптивные финансовые учреждения под иностранным контролем – ОПП",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "code": "128",
            "name": "Страховые корпорации",
            "children": [
              {
                "code": "1281",
                "name": "Государственные страховые корпорации",
                "children": [
                  {
                    "code": "12811",
                    "name": "Государственные страховые корпорации – НКО",
                    "children": []
                  },
                  {
                    "code": "12812",
                    "name": "Государственные страховые корпорации – ОПП",
                    "children": []
                  }
                ]
              },
              {
                "code": "1282",
                "name": "Национальные частные страховые корпорации",
                "children": [
                  {
                    "code": "12821",
                    "name": "Национальные частные страховые корпорации – НКО",
                    "children": []
                  },
                  {
                    "code": "12822",
                    "name": "Национальные частные страховые корпорации – ОПП",
                    "children": []
                  }
                ]
              },
              {
                "code": "1283",
                "name": "Страховые корпорации под иностранным контролем",
                "children": [
                  {
                    "code": "12831",
                    "name": "Страховые корпорации под иностранным контролем – НКО",
                    "children": []
                  },
                  {
                    "code": "12832",
                    "name": "Страховые корпорации под иностранным контролем – ОПП",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "code": "129",
            "name": "Пенсионные фонды",
            "children": [
              {
                "code": "1291",
                "name": "Государственные пенсионные фонды",
                "children": [
                  {
                    "code": "12911",
                    "name": "Государственные пенсионные фонды – НКО",
                    "children": []
                  },
                  {
                    "code": "12912",
                    "name": "Государственные пенсионные фонды – ОПП",
                    "children": []
                  }
                ]
              },
              {
                "code": "1292",
                "name": "Национальные частные пенсионные фонды",
                "children": [
                  {
                    "code": "12921",
                    "name": "Национальные частные пенсионные фонды – НКО",
                    "children": []
                  },
                  {
                    "code": "12922",
                    "name": "Национальные частные пенсионные фонды – ОПП",
                    "children": []
                  }
                ]
              },
              {
                "code": "1293",
                "name": "Пенсионные фонды под иностранным контролем",
                "children": [
                  {
                    "code": "12931",
                    "name": "Пенсионные фонды под иностранным контролем – НКО",
                    "children": []
                  },
                  {
                    "code": "12932",
                    "name": "Пенсионные фонды под иностранным контролем – ОПП",
                    "children": []
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "code": "13",
        "name": "Государственное управление",
        "children": [
          {
            "code": "131",
            "name": "Центральные органы управления",
            "children": [
              {
                "code": "1311",
                "name": "Центральные органы управления, кроме фондов социального обеспечения",
                "children": []
              },
              {
                "code": "1312",
                "name": "Некоммерческие организации центральных органов управления",
                "children": []
              }
            ]
          },
          {
            "code": "132",
            "name": "Органы местного государственного управления",
            "children": [
              {
                "code": "1321",
                "name": "Органы местного государственного управления, кроме фондов социального обеспечения",
                "children": []
              },
              {
                "code": "1322",
                "name": "Некоммерческие организации органов местного государственного управления",
                "children": []
              }
            ]
          },
          {
            "code": "133",
            "name": "Фонды социального обеспечения",
            "children": [
              {
                "code": "1331",
                "name": "Фонды социального обеспечения центральных органов управления",
                "children": []
              },
              {
                "code": "1332",
                "name": "Фонды социального обеспечения органов местного государственного управления",
                "children": []
              }
            ]
          }
        ]
      },
      {
        "code": "14",
        "name": "Домашние хозяйства",
        "children": [
          {
            "code": "141",
            "name": "Работодатели",
            "children": []
          },
          {
            "code": "142",
            "name": "Самостоятельно занятые лица",
            "children": []
          },
          {
            "code": "143",
            "name": "Наемные работники",
            "children": []
          },
          {
            "code": "144",
            "name": "Получатели доходов от собственности и трансфертов",
            "children": [
              {
                "code": "1441",
                "name": "Получатели доходов от собственности",
                "children": []
              },
              {
                "code": "1442",
                "name": "Получатели пенсий",
                "children": []
              },
              {
                "code": "1449",
                "name": "Получатели других трансфертных доходов",
                "children": []
              }
            ]
          }
        ]
      },
      {
        "code": "15",
        "name": "Некоммерческие организации, обслуживающие домашние хозяйства",
        "children": [
          {
            "code": "151",
            "name": "Национальные частные",
            "children": []
          },
          {
            "code": "152",
            "name": "Под иностранным контролем",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "code": "2",
    "name": "Остальной мир",
    "children": []
  }
]
