oked_dict = [
  {
    "code": "A",
    "name": "Сельское, лесное и рыбное хозяйство",
    "children": [
      {
        "code": "01",
        "name": "Растениеводство и животноводство, охота и предоставление услуг в этих областях",
        "children": [
          {
            "code": "011",
            "name": "Выращивание одно- или двухлетних культур",
            "children": [
              {
                "code": "0111",
                "name": "Выращивание зерновых (кроме риса), бобовых и масличных культур",
                "children": [
                  {
                    "code": "01111",
                    "name": "Выращивание зерновых и зернобобовых культур, включая семеноводство",
                    "children": []
                  },
                  {
                    "code": "01112",
                    "name": "Выращивание масличных культур и их семян",
                    "children": []
                  }
                ]
              },
              {
                "code": "0112",
                "name": "Выращивание риса",
                "children": []
              },
              {
                "code": "01120",
                "name": "Выращивание риса",
                "children": []
              },
              {
                "code": "0113",
                "name": "Выращивание овощей, бахчевых, корнеплодов и клубнеплодов",
                "children": [
                  {
                    "code": "01131",
                    "name": "Выращивание картофеля и посадочного материала",
                    "children": []
                  },
                  {
                    "code": "01132",
                    "name": "Выращивание овощей, их семян и рассады",
                    "children": []
                  },
                  {
                    "code": "01133",
                    "name": "Выращивание сахарной свеклы и ее семян",
                    "children": []
                  }
                ]
              },
              {
                "code": "0114",
                "name": "Выращивание сахарного тростника",
                "children": []
              },
              {
                "code": "01140",
                "name": "Выращивание сахарного тростника",
                "children": []
              },
              {
                "code": "0115",
                "name": "Выращивание табака",
                "children": []
              },
              {
                "code": "01150",
                "name": "Выращивание табака",
                "children": []
              },
              {
                "code": "0116",
                "name": "Выращивание прядильных культур",
                "children": [
                  {
                    "code": "01161",
                    "name": "Выращивание хлопка-сырца",
                    "children": []
                  },
                  {
                    "code": "01162",
                    "name": "Выращивание прядильных культур и их семян",
                    "children": []
                  }
                ]
              },
              {
                "code": "0119",
                "name": "Выращивание прочих одно- или двухлетних культур",
                "children": [
                  {
                    "code": "01191",
                    "name": "Выращивание кормовых культур и их семян",
                    "children": []
                  },
                  {
                    "code": "01192",
                    "name": "Выращивание цветов, семеноводство цветочных культур",
                    "children": []
                  },
                  {
                    "code": "01199",
                    "name": "Выращивание прочих одно- или двухлетних культур, не включенных в другие группировки",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "code": "012",
            "name": "Выращивание многолетних культур",
            "children": [
              {
                "code": "0121",
                "name": "Выращивание винограда",
                "children": []
              },
              {
                "code": "01210",
                "name": "Выращивание винограда",
                "children": []
              },
              {
                "code": "0122",
                "name": "Выращивание тропических и субтропических плодов",
                "children": []
              },
              {
                "code": "01220",
                "name": "Выращивание тропических и субтропических плодов",
                "children": []
              },
              {
                "code": "0123",
                "name": "Выращивание цитрусовых плодов",
                "children": []
              },
              {
                "code": "01230",
                "name": "Выращивание цитрусовых плодов",
                "children": []
              },
              {
                "code": "0124",
                "name": "Выращивание семечковых и косточковых плодов",
                "children": []
              },
              {
                "code": "01240",
                "name": "Выращивание семечковых и косточковых плодов",
                "children": []
              },
              {
                "code": "0125",
                "name": "Выращивание прочих плодов, ягод и орехов",
                "children": []
              },
              {
                "code": "01250",
                "name": "Выращивание прочих плодов, ягод и орехов",
                "children": []
              },
              {
                "code": "0126",
                "name": "Выращивание маслосодержащих плодов",
                "children": []
              },
              {
                "code": "01260",
                "name": "Выращивание маслосодержащих плодов",
                "children": []
              },
              {
                "code": "0127",
                "name": "Выращивание культур для производства напитков",
                "children": []
              },
              {
                "code": "01270",
                "name": "Выращивание культур для производства напитков",
                "children": []
              },
              {
                "code": "0128",
                "name": "Выращивание специй, пряностей, лекарственных и используемых в парфюмерии растений",
                "children": []
              },
              {
                "code": "01280",
                "name": "Выращивание специй, пряностей, лекарственных и используемых в парфюмерии растений",
                "children": []
              },
              {
                "code": "0129",
                "name": "Выращивание прочих многолетних культур",
                "children": []
              },
              {
                "code": "01290",
                "name": "Выращивание прочих многолетних культур",
                "children": []
              }
            ]
          },
          {
            "code": "013",
            "name": "Воспроизводство растений",
            "children": []
          },
          {
            "code": "0130",
            "name": "Воспроизводство растений",
            "children": []
          },
          {
            "code": "01300",
            "name": "Воспроизводство растений",
            "children": []
          },
          {
            "code": "014",
            "name": "Животноводство",
            "children": [
              {
                "code": "0141",
                "name": "Разведение крупного рогатого скота молочного направления",
                "children": []
              },
              {
                "code": "01410",
                "name": "Разведение крупного рогатого скота молочного направления",
                "children": []
              },
              {
                "code": "0142",
                "name": "Разведение прочего крупного рогатого скота и буйволов",
                "children": []
              },
              {
                "code": "01420",
                "name": "Разведение прочего крупного рогатого скота и буйволов",
                "children": []
              },
              {
                "code": "0143",
                "name": "Разведение лошадей и прочих животных семейства лошадиных",
                "children": [
                  {
                    "code": "01431",
                    "name": "Разведение лошадей",
                    "children": []
                  },
                  {
                    "code": "01432",
                    "name": "Разведение и выращивание ослов, мулов или лошаков",
                    "children": []
                  }
                ]
              },
              {
                "code": "0144",
                "name": "Разведение верблюдов и прочих животных семейства верблюжьих",
                "children": []
              },
              {
                "code": "01440",
                "name": "Разведение верблюдов и прочих животных семейства верблюжьих",
                "children": []
              },
              {
                "code": "0145",
                "name": "Разведение овец и коз",
                "children": []
              },
              {
                "code": "01450",
                "name": "Разведение овец и коз",
                "children": []
              },
              {
                "code": "0146",
                "name": "Разведение свиней",
                "children": []
              },
              {
                "code": "01460",
                "name": "Разведение свиней",
                "children": []
              },
              {
                "code": "0147",
                "name": "Разведение сельскохозяйственной птицы",
                "children": [
                  {
                    "code": "01471",
                    "name": "Разведение птицы на мясо, племенной птицы и молодняка",
                    "children": []
                  },
                  {
                    "code": "01472",
                    "name": "Производство яиц",
                    "children": []
                  },
                  {
                    "code": "01473",
                    "name": "Производство смешанное, мясояичное",
                    "children": []
                  },
                  {
                    "code": "01474",
                    "name": "Деятельность инкубаторно-птицеводческих станций",
                    "children": []
                  }
                ]
              },
              {
                "code": "0149",
                "name": "Разведение прочих видов животных",
                "children": []
              },
              {
                "code": "01490",
                "name": "Разведение прочих видов животных",
                "children": []
              }
            ]
          },
          {
            "code": "015",
            "name": "Смешанное сельское хозяйство",
            "children": []
          },
          {
            "code": "0150",
            "name": "Смешанное сельское хозяйство",
            "children": []
          },
          {
            "code": "01500",
            "name": "Смешанное сельское хозяйство",
            "children": []
          },
          {
            "code": "016",
            "name": "Деятельность, способствующая выращиванию сельскохозяйственных культур и разведению животных и деятельность по обработке урожая",
            "children": [
              {
                "code": "0161",
                "name": "Деятельность, способствующая растениеводству",
                "children": [
                  {
                    "code": "01611",
                    "name": "Деятельность, способствующая растениеводству, кроме эксплуатации оросительных систем",
                    "children": []
                  },
                  {
                    "code": "01612",
                    "name": "Эксплуатация оросительных систем",
                    "children": []
                  }
                ]
              },
              {
                "code": "0162",
                "name": "Деятельность, способствующая животноводству",
                "children": []
              },
              {
                "code": "01620",
                "name": "Деятельность, способствующая животноводству",
                "children": []
              },
              {
                "code": "0163",
                "name": "Деятельность по обработке урожая",
                "children": []
              },
              {
                "code": "01630",
                "name": "Деятельность по обработке урожая",
                "children": []
              },
              {
                "code": "0164",
                "name": "Деятельность по обработке семян для посадки",
                "children": []
              },
              {
                "code": "01640",
                "name": "Деятельность по обработке семян для посадки",
                "children": []
              }
            ]
          },
          {
            "code": "017",
            "name": "Охота и отлов, включая предоставление услуг в этих областях",
            "children": []
          },
          {
            "code": "0170",
            "name": "Охота и отлов, включая предоставление услуг в этих областях",
            "children": []
          },
          {
            "code": "01700",
            "name": "Охота и отлов, включая предоставление услуг в этих областях",
            "children": []
          }
        ]
      },
      {
        "code": "02",
        "name": "Лесоводство и лесозаготовки",
        "children": [
          {
            "code": "021",
            "name": "Лесоводство и прочая лесохозяйственная деятельность",
            "children": []
          },
          {
            "code": "0210",
            "name": "Лесоводство и прочая лесохозяйственная деятельность",
            "children": []
          },
          {
            "code": "02100",
            "name": "Лесоводство и прочая лесохозяйственная деятельность",
            "children": []
          },
          {
            "code": "022",
            "name": "Лесозаготовки",
            "children": []
          },
          {
            "code": "0220",
            "name": "Лесозаготовки",
            "children": []
          },
          {
            "code": "02200",
            "name": "Лесозаготовки",
            "children": []
          },
          {
            "code": "023",
            "name": "Сбор дикорастущей недревесной продукции",
            "children": []
          },
          {
            "code": "0230",
            "name": "Сбор дикорастущей недревесной продукции",
            "children": []
          },
          {
            "code": "02300",
            "name": "Сбор дикорастущей недревесной продукции",
            "children": []
          },
          {
            "code": "024",
            "name": "Услуги, связанные с лесоводство и лесозаготовками",
            "children": []
          },
          {
            "code": "0240",
            "name": "Услуги, связанные с лесоводство и лесозаготовками",
            "children": []
          },
          {
            "code": "02400",
            "name": "Услуги, связанные с лесоводство и лесозаготовками",
            "children": []
          }
        ]
      },
      {
        "code": "03",
        "name": "Рыболовство и рыбоводство",
        "children": [
          {
            "code": "031",
            "name": "Рыболовство",
            "children": [
              {
                "code": "0311",
                "name": "Морское рыболовство",
                "children": []
              },
              {
                "code": "03110",
                "name": "Морское рыболовство",
                "children": []
              },
              {
                "code": "0312",
                "name": "Пресноводное рыболовство",
                "children": []
              },
              {
                "code": "03120",
                "name": "Пресноводное рыболовство",
                "children": []
              }
            ]
          },
          {
            "code": "032",
            "name": "Рыбоводство",
            "children": [
              {
                "code": "0321",
                "name": "Морское рыбоводство",
                "children": []
              },
              {
                "code": "03210",
                "name": "Морское рыбоводство",
                "children": []
              },
              {
                "code": "0322",
                "name": "Пресноводное рыбоводство",
                "children": []
              },
              {
                "code": "03220",
                "name": "Пресноводное рыбоводство",
                "children": []
              }
            ]
          }
        ]
      }
    ]
  },
  {
    "code": "B",
    "name": "Горнодобывающая промышленность и разработка карьеров",
    "children": [
      {
        "code": "05",
        "name": "Добыча угля",
        "children": [
          {
            "code": "051",
            "name": "Добыча каменного угля",
            "children": []
          },
          {
            "code": "0510",
            "name": "Добыча каменного угля",
            "children": [
              {
                "code": "05101",
                "name": "Добыча каменного угля открытым способом",
                "children": []
              },
              {
                "code": "05102",
                "name": "Добыча каменного угля подземным способом",
                "children": []
              },
              {
                "code": "05103",
                "name": "Обогащение каменного угля",
                "children": []
              }
            ]
          },
          {
            "code": "052",
            "name": "Добыча лигнита (бурого угля)",
            "children": []
          },
          {
            "code": "0520",
            "name": "Добыча лигнита (бурого угля)",
            "children": [
              {
                "code": "05201",
                "name": "Добыча лигнита (бурого угля) открытым способом",
                "children": []
              },
              {
                "code": "05202",
                "name": "Добыча лигнита (бурого угля) подземным способом",
                "children": []
              },
              {
                "code": "05203",
                "name": "Обогащение лигнита (бурого угля)",
                "children": []
              }
            ]
          }
        ]
      },
      {
        "code": "06",
        "name": "Добыча сырой нефти и природного газа",
        "children": [
          {
            "code": "061",
            "name": "Добыча сырой нефти",
            "children": []
          },
          {
            "code": "0610",
            "name": "Добыча сырой нефти",
            "children": []
          },
          {
            "code": "06100",
            "name": "Добыча сырой нефти и попутного газа",
            "children": []
          },
          {
            "code": "062",
            "name": "Добыча природного газа",
            "children": []
          },
          {
            "code": "0620",
            "name": "Добыча природного газа",
            "children": [
              {
                "code": "06201",
                "name": "Добыча природного газа, кроме метана",
                "children": []
              },
              {
                "code": "06202",
                "name": "Добыча метана из угольных месторождений",
                "children": []
              }
            ]
          }
        ]
      },
      {
        "code": "07",
        "name": "Добыча металлических руд",
        "children": [
          {
            "code": "071",
            "name": "Добыча железных руд",
            "children": []
          },
          {
            "code": "0710",
            "name": "Добыча железных руд",
            "children": [
              {
                "code": "07101",
                "name": "Добыча железных руд подземным способом",
                "children": []
              },
              {
                "code": "07102",
                "name": "Добыча железных руд открытым способом",
                "children": []
              },
              {
                "code": "07103",
                "name": "Обогащение и агломерация железных руд",
                "children": []
              }
            ]
          },
          {
            "code": "072",
            "name": "Добыча руд, кроме железных",
            "children": [
              {
                "code": "0721",
                "name": "Добыча урановой и ториевой руд",
                "children": []
              },
              {
                "code": "07210",
                "name": "Добыча урановой и ториевой руд",
                "children": []
              },
              {
                "code": "0729",
                "name": "Добыча прочих металлических руд",
                "children": [
                  {
                    "code": "07291",
                    "name": "Добыча и обогащение алюминийсодержащего сырья",
                    "children": []
                  },
                  {
                    "code": "07292",
                    "name": "Добыча и обогащение медной руды",
                    "children": []
                  },
                  {
                    "code": "07293",
                    "name": "Добыча и обогащение свинцово-цинковой руды",
                    "children": []
                  },
                  {
                    "code": "07294",
                    "name": "Добыча и обогащение никель-кобальтовых руд",
                    "children": []
                  },
                  {
                    "code": "07295",
                    "name": "Добыча и обогащение титаномагниевого сырья (руды)",
                    "children": []
                  },
                  {
                    "code": "07296",
                    "name": "Добыча и обогащение оловянной руды",
                    "children": []
                  },
                  {
                    "code": "07297",
                    "name": "Добыча и обогащение сурьмяно-ртутных руд",
                    "children": []
                  },
                  {
                    "code": "07298",
                    "name": "Добыча драгоценных металлов и руд редких металлов",
                    "children": []
                  },
                  {
                    "code": "07299",
                    "name": "Добыча и обогащение прочих металлических руд, не включенных в другие группировки",
                    "children": []
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "code": "08",
        "name": "Добыча прочих полезных ископаемых",
        "children": [
          {
            "code": "081",
            "name": "Добыча камня, песка и глины",
            "children": [
              {
                "code": "0811",
                "name": "Добыча отделочного и строительного камня, известняка, гипса, мела и сланцев",
                "children": [
                  {
                    "code": "08111",
                    "name": "Добыча отделочного и строительного камня",
                    "children": []
                  },
                  {
                    "code": "08112",
                    "name": "Добыча известняка, гипса и мела",
                    "children": []
                  },
                  {
                    "code": "08113",
                    "name": "Добыча сланцев",
                    "children": []
                  }
                ]
              },
              {
                "code": "0812",
                "name": "Разработка гравийных и песчаных карьеров, добыча глины и каолина",
                "children": [
                  {
                    "code": "08121",
                    "name": "Разработка гравийных и песчаных карьеров",
                    "children": []
                  },
                  {
                    "code": "08122",
                    "name": "Добыча глины и каолина",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "code": "089",
            "name": "Добыча полезных ископаемых, не включенных в другие группировки",
            "children": [
              {
                "code": "0891",
                "name": "Добыча минерального сырья для химической промышленности и производства удобрений",
                "children": []
              },
              {
                "code": "08910",
                "name": "Добыча минерального сырья для химической промышленности и производства удобрений",
                "children": []
              },
              {
                "code": "0892",
                "name": "Добыча торфа",
                "children": []
              },
              {
                "code": "08920",
                "name": "Добыча торфа",
                "children": []
              },
              {
                "code": "0893",
                "name": "Добыча соли",
                "children": []
              },
              {
                "code": "08930",
                "name": "Добыча соли",
                "children": []
              },
              {
                "code": "0899",
                "name": "Добыча прочих полезных ископаемых, не включенных в другие группировки",
                "children": [
                  {
                    "code": "08991",
                    "name": "Добыча асбестовой руды",
                    "children": []
                  },
                  {
                    "code": "08992",
                    "name": "Добыча и обогащение неметаллических руд",
                    "children": []
                  },
                  {
                    "code": "08993",
                    "name": "Добыча сырья для естественных и искусственных пористых заполнителей",
                    "children": []
                  },
                  {
                    "code": "08994",
                    "name": "Добыча исходного сырья для стекольной промышленности",
                    "children": []
                  },
                  {
                    "code": "08995",
                    "name": "Добыча драгоценных камней (кроме алмазов) и полудрагоценных камней, самоцветов и янтаря",
                    "children": []
                  },
                  {
                    "code": "08996",
                    "name": "Добыча алмазов",
                    "children": []
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "code": "09",
        "name": "Предоставление услуг в горнодобывающей промышленности",
        "children": [
          {
            "code": "091",
            "name": "Предоставление услуг, способствующих добыче нефти и природного газа",
            "children": []
          },
          {
            "code": "0910",
            "name": "Предоставление услуг, способствующих добыче нефти и природного газа",
            "children": []
          },
          {
            "code": "09100",
            "name": "Предоставление услуг, способствующих добыче нефти и природного газа",
            "children": []
          },
          {
            "code": "099",
            "name": "Предоставление услуг, способствующих добыче других полезных ископаемых",
            "children": []
          },
          {
            "code": "0990",
            "name": "Предоставление услуг, способствующих добыче других полезных ископаемых",
            "children": []
          },
          {
            "code": "09900",
            "name": "Предоставление услуг, способствующих добыче других полезных ископаемых",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "code": "C",
    "name": "Обрабатывающая промышленность",
    "children": [
      {
        "code": "10",
        "name": "Производство продуктов питания",
        "children": [
          {
            "code": "101",
            "name": "Переработка и консервирование мяса и производство мясной продукции",
            "children": [
              {
                "code": "1011",
                "name": "Переработка и консервирование мяса",
                "children": []
              },
              {
                "code": "10110",
                "name": "Переработка и консервирование мяса",
                "children": []
              },
              {
                "code": "1012",
                "name": "Переработка и консервирование мяса сельскохозяйственной птицы",
                "children": []
              },
              {
                "code": "10120",
                "name": "Переработка и консервирование мяса сельскохозяйственной птицы",
                "children": []
              },
              {
                "code": "1013",
                "name": "Производство продуктов из мяса и мяса сельскохозяйственной птицы",
                "children": []
              },
              {
                "code": "10130",
                "name": "Производство продуктов из мяса и мяса сельскохозяйственной птицы",
                "children": []
              }
            ]
          },
          {
            "code": "102",
            "name": "Переработка и консервирование рыбы, ракообразных и моллюсков",
            "children": []
          },
          {
            "code": "1020",
            "name": "Переработка и консервирование рыбы, ракообразных и моллюсков",
            "children": []
          },
          {
            "code": "10200",
            "name": "Переработка и консервирование рыбы, ракообразных и моллюсков",
            "children": []
          },
          {
            "code": "103",
            "name": "Переработка и консервирование фруктов и овощей",
            "children": [
              {
                "code": "1031",
                "name": "Переработка и консервирование картофеля",
                "children": []
              },
              {
                "code": "10310",
                "name": "Переработка и консервирование картофеля",
                "children": []
              },
              {
                "code": "1032",
                "name": "Производство фруктовых и овощных соков",
                "children": []
              },
              {
                "code": "10320",
                "name": "Производство фруктовых и овощных соков",
                "children": []
              },
              {
                "code": "1039",
                "name": "Прочие виды переработки и консервирования фруктов и овощей",
                "children": []
              },
              {
                "code": "10390",
                "name": "Прочие виды переработки и консервирования фруктов и овощей",
                "children": []
              }
            ]
          },
          {
            "code": "104",
            "name": "Производство растительных и животных масел и жиров",
            "children": [
              {
                "code": "1041",
                "name": "Производство масел и жиров",
                "children": [
                  {
                    "code": "10411",
                    "name": "Производство неочищенных масел и жиров",
                    "children": []
                  },
                  {
                    "code": "10412",
                    "name": "Производство рафинированных масел и жиров",
                    "children": []
                  }
                ]
              },
              {
                "code": "1042",
                "name": "Производство маргарина и аналогичных пищевых жиров",
                "children": []
              },
              {
                "code": "10420",
                "name": "Производство маргарина и аналогичных пищевых жиров",
                "children": []
              }
            ]
          },
          {
            "code": "105",
            "name": "Производство молочных продуктов",
            "children": [
              {
                "code": "1051",
                "name": "Переработка молока и производство сыров",
                "children": [
                  {
                    "code": "10511",
                    "name": "Переработка молока, кроме консервирования, и производство сыров",
                    "children": []
                  },
                  {
                    "code": "10512",
                    "name": "Производство молочных консервов",
                    "children": []
                  }
                ]
              },
              {
                "code": "1052",
                "name": "Производство мороженого",
                "children": []
              },
              {
                "code": "10520",
                "name": "Производство мороженого",
                "children": []
              }
            ]
          },
          {
            "code": "106",
            "name": "Производство мукомольно-крупяных продуктов, крахмалов и крахмальных продуктов",
            "children": [
              {
                "code": "1061",
                "name": "Производство мукомольно-крупяных продуктов",
                "children": [
                  {
                    "code": "10611",
                    "name": "Производство муки",
                    "children": []
                  },
                  {
                    "code": "10612",
                    "name": "Производство круп",
                    "children": []
                  },
                  {
                    "code": "10613",
                    "name": "Производство пищевых концентратов",
                    "children": []
                  }
                ]
              },
              {
                "code": "1062",
                "name": "Производство крахмала и продукции из крахмала",
                "children": []
              },
              {
                "code": "10620",
                "name": "Производство крахмала и продукции из крахмала",
                "children": []
              }
            ]
          },
          {
            "code": "107",
            "name": "Производство хлебобулочных, макаронных и мучных кондитерских изделий",
            "children": [
              {
                "code": "1071",
                "name": "Производство хлебобулочных и мучных кондитерских изделий недлительного хранения",
                "children": []
              },
              {
                "code": "10710",
                "name": "Производство хлебобулочных и мучных кондитерских изделий недлительного хранения",
                "children": []
              },
              {
                "code": "1072",
                "name": "Производство сухарей и печенья, мучных кондитерских изделий длительного хранения",
                "children": []
              },
              {
                "code": "10720",
                "name": "Производство сухарей и печенья, мучных кондитерских изделий длительного хранения",
                "children": []
              },
              {
                "code": "1073",
                "name": "Производство макаронных изделий",
                "children": []
              },
              {
                "code": "10730",
                "name": "Производство макаронных изделий",
                "children": []
              }
            ]
          },
          {
            "code": "108",
            "name": "Производство прочих продуктов питания",
            "children": [
              {
                "code": "1081",
                "name": "Производство сахара",
                "children": []
              },
              {
                "code": "10810",
                "name": "Производство сахара",
                "children": []
              },
              {
                "code": "1082",
                "name": "Производство какао, шоколада и сахаристых кондитерских изделий",
                "children": []
              },
              {
                "code": "10820",
                "name": "Производство какао, шоколада и сахаристых кондитерских изделий",
                "children": []
              },
              {
                "code": "1083",
                "name": "Производство чая и кофе",
                "children": []
              },
              {
                "code": "10830",
                "name": "Производство чая и кофе",
                "children": []
              },
              {
                "code": "1084",
                "name": "Производство пряностей и приправ",
                "children": []
              },
              {
                "code": "10840",
                "name": "Производство пряностей и приправ",
                "children": []
              },
              {
                "code": "1085",
                "name": "Производство готовых пищевых продуктов",
                "children": []
              },
              {
                "code": "10850",
                "name": "Производство готовых пищевых продуктов",
                "children": []
              },
              {
                "code": "1086",
                "name": "Производство детского питания и диетических пищевых продуктов",
                "children": []
              },
              {
                "code": "10860",
                "name": "Производство детского питания и диетических пищевых продуктов",
                "children": []
              },
              {
                "code": "1089",
                "name": "Производство прочих продуктов питания, не включенных в другие группировки",
                "children": [
                  {
                    "code": "10891",
                    "name": "Производство супов, бульонов и яйцепродуктов",
                    "children": []
                  },
                  {
                    "code": "10892",
                    "name": "Производство дрожжей",
                    "children": []
                  },
                  {
                    "code": "10899",
                    "name": "Производство прочих пищевых продуктов, не включенных в другие группировки",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "code": "109",
            "name": "Производство готовых кормов для животных",
            "children": [
              {
                "code": "1091",
                "name": "Производство готовых кормов для сельскохозяйственных животных",
                "children": []
              },
              {
                "code": "10910",
                "name": "Производство готовых кормов для сельскохозяйственных животных",
                "children": []
              },
              {
                "code": "1092",
                "name": "Производство готовых кормов для домашних животных",
                "children": []
              },
              {
                "code": "10920",
                "name": "Производство готовых кормов для домашних животных",
                "children": []
              }
            ]
          },
          {
            "code": "11",
            "name": "Производство напитков",
            "children": []
          },
          {
            "code": "12",
            "name": "Производство табачных изделий",
            "children": []
          },
          {
            "code": "13",
            "name": "Производство текстильных изделий",
            "children": [
              {
                "code": "131",
                "name": "Подготовка и прядение текстильных волокон",
                "children": []
              },
              {
                "code": "1310",
                "name": "Подготовка и прядение текстильных волокон",
                "children": [
                  {
                    "code": "13101",
                    "name": "Подготовка хлопчатобумажного волокна, хлопка-волокна",
                    "children": []
                  },
                  {
                    "code": "13102",
                    "name": "Прядение хлопчатобумажного волокна, хлопка-волокна",
                    "children": []
                  },
                  {
                    "code": "13103",
                    "name": "Подготовка шерстяного волокна",
                    "children": []
                  },
                  {
                    "code": "13104",
                    "name": "Прядение шерстяного волокна",
                    "children": []
                  },
                  {
                    "code": "13105",
                    "name": "Подготовка льняного и прочих растительных волокон",
                    "children": []
                  },
                  {
                    "code": "13106",
                    "name": "Прядение льняного и прочих растительных волокон",
                    "children": []
                  },
                  {
                    "code": "13107",
                    "name": "Подготовка шелкового волокна",
                    "children": []
                  },
                  {
                    "code": "13108",
                    "name": "Производство шелковой пряжи",
                    "children": []
                  },
                  {
                    "code": "13109",
                    "name": "Производство швейных ниток",
                    "children": []
                  }
                ]
              },
              {
                "code": "132",
                "name": "Ткацкое производство",
                "children": []
              },
              {
                "code": "1320",
                "name": "Ткацкое производство",
                "children": [
                  {
                    "code": "13201",
                    "name": "Производство хлопчатобумажных тканей",
                    "children": []
                  },
                  {
                    "code": "13202",
                    "name": "Производство шерстяных тканей",
                    "children": []
                  },
                  {
                    "code": "13203",
                    "name": "Производство шелковых тканей",
                    "children": []
                  },
                  {
                    "code": "13204",
                    "name": "Производство льняных тканей",
                    "children": []
                  },
                  {
                    "code": "13209",
                    "name": "Производство прочих тканей",
                    "children": []
                  }
                ]
              },
              {
                "code": "133",
                "name": "Отделка тканей и текстильных изделий",
                "children": []
              },
              {
                "code": "1330",
                "name": "Отделка тканей и текстильных изделий",
                "children": []
              },
              {
                "code": "13300",
                "name": "Отделка тканей и текстильных изделий",
                "children": []
              },
              {
                "code": "139",
                "name": "Производство прочих текстильных изделий",
                "children": [
                  {
                    "code": "1391",
                    "name": "Производство вязаного и трикотажного полотна",
                    "children": [
                      {
                        "code": "13911",
                        "name": "Производство и обработка вязаного и трикотажного полотна",
                        "children": []
                      },
                      {
                        "code": "13912",
                        "name": "Производство искусственного меха",
                        "children": []
                      }
                    ]
                  },
                  {
                    "code": "1392",
                    "name": "Производство готовых текстильных изделий, кроме одежды",
                    "children": []
                  },
                  {
                    "code": "13920",
                    "name": "Производство готовых текстильных изделий, кроме одежды",
                    "children": []
                  },
                  {
                    "code": "1393",
                    "name": "Производство ковров и ковровых изделий",
                    "children": []
                  },
                  {
                    "code": "13930",
                    "name": "Производство ковров и ковровых изделий",
                    "children": []
                  },
                  {
                    "code": "1394",
                    "name": "Производство веревок, канатов, бечевок, шпагата и сетей",
                    "children": [
                      {
                        "code": "13941",
                        "name": "Производство веревок, канатов, бечевок, шпагата",
                        "children": []
                      },
                      {
                        "code": "13942",
                        "name": "Производство сетей и изделий из веревок",
                        "children": []
                      }
                    ]
                  },
                  {
                    "code": "1395",
                    "name": "Производство нетканых текстильных изделий, кроме одежды",
                    "children": []
                  },
                  {
                    "code": "13950",
                    "name": "Производство нетканых текстильных изделий, кроме одежды",
                    "children": []
                  },
                  {
                    "code": "1396",
                    "name": "Производство прочих текстильных изделий технического и производственного назначения",
                    "children": []
                  },
                  {
                    "code": "13960",
                    "name": "Производство прочих текстильных изделий технического и производственного назначения",
                    "children": []
                  },
                  {
                    "code": "1399",
                    "name": "Производство прочих текстильных изделий, не включенных в другие группировки",
                    "children": [
                      {
                        "code": "13991",
                        "name": "Производство текстильной галантереи",
                        "children": []
                      },
                      {
                        "code": "13992",
                        "name": "Производство валяльно-войлочных изделий",
                        "children": []
                      },
                      {
                        "code": "13999",
                        "name": "Производство других текстильных изделий, не включенных в другие группировки",
                        "children": []
                      }
                    ]
                  }
                ]
              }
            ]
          },
          {
            "code": "14",
            "name": "Производство одежды",
            "children": [
              {
                "code": "141",
                "name": "Производство одежды, кроме одежды из меха",
                "children": [
                  {
                    "code": "1411",
                    "name": "Производство одежды из кожи",
                    "children": []
                  },
                  {
                    "code": "14110",
                    "name": "Производство одежды из кожи",
                    "children": []
                  },
                  {
                    "code": "1412",
                    "name": "Производство спецодежды",
                    "children": []
                  },
                  {
                    "code": "14120",
                    "name": "Производство спецодежды",
                    "children": []
                  },
                  {
                    "code": "1413",
                    "name": "Производство прочей верхней одежды",
                    "children": []
                  },
                  {
                    "code": "14130",
                    "name": "Производство прочей верхней одежды",
                    "children": []
                  },
                  {
                    "code": "1414",
                    "name": "Производство нижнего белья",
                    "children": []
                  },
                  {
                    "code": "14140",
                    "name": "Производство нижнего белья",
                    "children": []
                  },
                  {
                    "code": "1419",
                    "name": "Производство прочих видов одежды и аксессуаров",
                    "children": [
                      {
                        "code": "14191",
                        "name": "Производство головных уборов",
                        "children": []
                      },
                      {
                        "code": "14199",
                        "name": "Производство прочих видов одежды и аксессуаров, не включенных в другие группировки",
                        "children": []
                      }
                    ]
                  }
                ]
              },
              {
                "code": "142",
                "name": "Производство меховых изделий",
                "children": []
              },
              {
                "code": "1420",
                "name": "Производство меховых изделий",
                "children": []
              },
              {
                "code": "14200",
                "name": "Производство меховых изделий",
                "children": []
              },
              {
                "code": "143",
                "name": "Производство вязаной и трикотажной одежды",
                "children": [
                  {
                    "code": "1431",
                    "name": "Производство вязаных и трикотажных чулочно-носочных изделий",
                    "children": []
                  },
                  {
                    "code": "14310",
                    "name": "Производство вязаных и трикотажных чулочно-носочных изделий",
                    "children": []
                  },
                  {
                    "code": "1439",
                    "name": "Производство прочей вязаной и трикотажной одежды",
                    "children": []
                  },
                  {
                    "code": "14390",
                    "name": "Производство прочей вязаной и трикотажной одежды",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "code": "15",
            "name": "Производство кожаной и относящейся к ней продукции",
            "children": [
              {
                "code": "151",
                "name": "Дубление и выделка кожи; производство дорожных принадлежностей, шорно-седельных изделий; выделка и крашение меха",
                "children": [
                  {
                    "code": "1511",
                    "name": "Дубление и выделка кожи; выделка и крашение меха",
                    "children": [
                      {
                        "code": "15111",
                        "name": "Дубление и выделка кожи",
                        "children": []
                      },
                      {
                        "code": "15112",
                        "name": "Производство искусственных кож и пленочных материалов",
                        "children": []
                      },
                      {
                        "code": "15113",
                        "name": "Выделка и крашение меха",
                        "children": []
                      }
                    ]
                  },
                  {
                    "code": "1512",
                    "name": "Производство дорожных принадлежностей, шорно-седельных изделий",
                    "children": [
                      {
                        "code": "15121",
                        "name": "Производство дорожных принадлежностей и аналогичных изделий",
                        "children": []
                      },
                      {
                        "code": "15122",
                        "name": "Производство шорно-седельных изделий",
                        "children": []
                      }
                    ]
                  }
                ]
              },
              {
                "code": "152",
                "name": "Производство обуви",
                "children": []
              },
              {
                "code": "1520",
                "name": "Производство обуви",
                "children": []
              },
              {
                "code": "15200",
                "name": "Производство обуви",
                "children": []
              }
            ]
          },
          {
            "code": "16",
            "name": "Производство деревянных и пробковых изделий, кроме мебели; производство изделий из соломки и материалов для плетения",
            "children": [
              {
                "code": "161",
                "name": "Лесопильное и строгальное производство",
                "children": []
              },
              {
                "code": "1610",
                "name": "Лесопильное и строгальное производство",
                "children": [
                  {
                    "code": "16101",
                    "name": "Распиловка и строгание древесины",
                    "children": []
                  },
                  {
                    "code": "16102",
                    "name": "Антисептирование древесины",
                    "children": []
                  },
                  {
                    "code": "16103",
                    "name": "Производство сборных деревянных покрытий",
                    "children": []
                  }
                ]
              },
              {
                "code": "162",
                "name": "Производство изделий из древесины, пробки, соломки и материалов для плетения",
                "children": [
                  {
                    "code": "1621",
                    "name": "Производство шпона, фанеры, плит и панелей из древесины",
                    "children": []
                  },
                  {
                    "code": "16210",
                    "name": "Производство шпона, фанеры, плит и панелей из древесины",
                    "children": []
                  },
                  {
                    "code": "1622",
                    "name": "Производство сборных паркетных покрытий",
                    "children": []
                  },
                  {
                    "code": "16220",
                    "name": "Производство сборных паркетных покрытий",
                    "children": []
                  },
                  {
                    "code": "1623",
                    "name": "Производство прочих деревянных строительных конструкций и столярных изделий",
                    "children": [
                      {
                        "code": "16231",
                        "name": "Производство деревянных изделий для строительства",
                        "children": []
                      },
                      {
                        "code": "16232",
                        "name": "Производство сборных домов, преимущественно из дерева",
                        "children": []
                      },
                      {
                        "code": "16233",
                        "name": "Производство деревянных контейнерных, цельноперевозных и сборно-разборных зданий и помещений",
                        "children": []
                      }
                    ]
                  },
                  {
                    "code": "1624",
                    "name": "Производство деревянной тары",
                    "children": []
                  },
                  {
                    "code": "16240",
                    "name": "Производство деревянной тары",
                    "children": []
                  },
                  {
                    "code": "1629",
                    "name": "Производство прочих деревянных изделий; производство изделий из пробки, соломки и материалов для плетения",
                    "children": [
                      {
                        "code": "16291",
                        "name": "Производство разных деревянных изделий",
                        "children": []
                      },
                      {
                        "code": "16292",
                        "name": "Производство декоративных изделий из дерева",
                        "children": []
                      },
                      {
                        "code": "16293",
                        "name": "Производство изделий из пробки, соломки и материалов для плетения",
                        "children": []
                      }
                    ]
                  }
                ]
              }
            ]
          },
          {
            "code": "17",
            "name": "Производство бумаги и бумажной продукции",
            "children": [
              {
                "code": "171",
                "name": "Производство древесной массы и целлюлозы, бумаги и картона",
                "children": [
                  {
                    "code": "1711",
                    "name": "Производство древесной массы и целлюлозы",
                    "children": []
                  },
                  {
                    "code": "17110",
                    "name": "Производство древесной массы и целлюлозы",
                    "children": []
                  },
                  {
                    "code": "1712",
                    "name": "Производство бумаги и картона",
                    "children": []
                  },
                  {
                    "code": "17120",
                    "name": "Производство бумаги и картона",
                    "children": []
                  }
                ]
              },
              {
                "code": "172",
                "name": "Производство изделий из бумаги и картона",
                "children": [
                  {
                    "code": "1721",
                    "name": "Производство гофрированной бумаги и картона, бумажной и картонной тары",
                    "children": [
                      {
                        "code": "17211",
                        "name": "Производство гофрированной бумаги и картона",
                        "children": []
                      },
                      {
                        "code": "17212",
                        "name": "Производство бумажной и картонной тары",
                        "children": []
                      }
                    ]
                  },
                  {
                    "code": "1722",
                    "name": "Производство бумажных изделий хозяйственно-бытового и санитарно-гигиенического назначения",
                    "children": []
                  },
                  {
                    "code": "17220",
                    "name": "Производство бумажных изделий хозяйственно-бытового и санитарно-гигиенического назначения",
                    "children": []
                  },
                  {
                    "code": "1723",
                    "name": "Производство писчебумажных изделий",
                    "children": []
                  },
                  {
                    "code": "17230",
                    "name": "Производство писчебумажных изделий",
                    "children": []
                  },
                  {
                    "code": "1724",
                    "name": "Производство обоев",
                    "children": []
                  },
                  {
                    "code": "17240",
                    "name": "Производство обоев",
                    "children": []
                  },
                  {
                    "code": "1729",
                    "name": "Производство прочих изделий из бумаги и картона",
                    "children": []
                  },
                  {
                    "code": "17290",
                    "name": "Производство прочих изделий из бумаги и картона",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "code": "18",
            "name": "Полиграфическая деятельность и воспроизведение записанных носителей информации",
            "children": [
              {
                "code": "181",
                "name": "Полиграфическая деятельность и предоставление услуг в этой области",
                "children": [
                  {
                    "code": "1811",
                    "name": "Печатание газет",
                    "children": []
                  },
                  {
                    "code": "18110",
                    "name": "Печатание газет",
                    "children": []
                  },
                  {
                    "code": "1812",
                    "name": "Прочие виды печатного производства",
                    "children": []
                  },
                  {
                    "code": "18120",
                    "name": "Прочие виды печатного производства",
                    "children": []
                  },
                  {
                    "code": "1813",
                    "name": "Деятельность по подготовке материалов к печати и рапространению",
                    "children": []
                  },
                  {
                    "code": "18130",
                    "name": "Деятельность по подготовке материалов к печати и рапространению",
                    "children": []
                  },
                  {
                    "code": "1814",
                    "name": "Брошюровочно-переплетная, отделочная деятельность и сопутствующие услуги",
                    "children": []
                  },
                  {
                    "code": "18140",
                    "name": "Брошюровочно-переплетная, отделочная деятельность и сопутствующие услуги",
                    "children": []
                  }
                ]
              },
              {
                "code": "182",
                "name": "Воспроизведение записанных носителей информации",
                "children": []
              },
              {
                "code": "1820",
                "name": "Воспроизведение записанных носителей информации",
                "children": [
                  {
                    "code": "18201",
                    "name": "Воспроизведение звукозаписей",
                    "children": []
                  },
                  {
                    "code": "18202",
                    "name": "Воспроизведение видеозаписей",
                    "children": []
                  },
                  {
                    "code": "18203",
                    "name": "Воспроизведение программного обеспечения и баз данных",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "code": "19",
            "name": "Производство кокса и продуктов нефтепереработки",
            "children": [
              {
                "code": "191",
                "name": "Производство продукции коксовых печей",
                "children": []
              },
              {
                "code": "1910",
                "name": "Производство продукции коксовых печей",
                "children": []
              },
              {
                "code": "19100",
                "name": "Производство продукции коксовых печей",
                "children": []
              },
              {
                "code": "192",
                "name": "Производство продуктов нефтепереработки,брикетов из торфа и угля",
                "children": []
              },
              {
                "code": "1920",
                "name": "Производство продуктов нефтепереработки,брикетов из торфа и угля",
                "children": [
                  {
                    "code": "19201",
                    "name": "Производство продуктов нефтепереработки",
                    "children": []
                  },
                  {
                    "code": "19202",
                    "name": "Агломерация торфа и производство торфяных брикетов",
                    "children": []
                  },
                  {
                    "code": "19203",
                    "name": "Агломерация и производство брикетов из каменного угля",
                    "children": []
                  },
                  {
                    "code": "19204",
                    "name": "Агломерация и производство брикетов из лигнита",
                    "children": []
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "code": "110",
        "name": "Производство напитков",
        "children": [
          {
            "code": "1101",
            "name": "Дистилляция, ректификация и смешивание спиртных напитков",
            "children": []
          },
          {
            "code": "11010",
            "name": "Дистилляция, ректификация и смешивание спиртных напитков",
            "children": []
          },
          {
            "code": "1102",
            "name": "Производство вина из винограда",
            "children": [
              {
                "code": "11021",
                "name": "Производство вина из винограда собственного производства",
                "children": []
              },
              {
                "code": "11022",
                "name": "Производство вина из винограда несобственного производства",
                "children": []
              }
            ]
          },
          {
            "code": "1103",
            "name": "Производство сидра и прочих плодовых вин",
            "children": []
          },
          {
            "code": "11030",
            "name": "Производство сидра и прочих плодовых вин",
            "children": []
          },
          {
            "code": "1104",
            "name": "Производство прочих недистиллированных напитков из сброженного материала",
            "children": []
          },
          {
            "code": "11040",
            "name": "Производство прочих недистиллированных напитков из сброженного материала",
            "children": []
          },
          {
            "code": "1105",
            "name": "Производство пива",
            "children": []
          },
          {
            "code": "11050",
            "name": "Производство пива",
            "children": []
          },
          {
            "code": "1106",
            "name": "Производство солода",
            "children": []
          },
          {
            "code": "11060",
            "name": "Производство солода",
            "children": []
          },
          {
            "code": "1107",
            "name": "Производство безалкогольных напитков, минеральных вод и других вод в бутылках",
            "children": []
          },
          {
            "code": "11070",
            "name": "Производство безалкогольных напитков, минеральных вод и других вод в бутылках",
            "children": []
          }
        ]
      },
      {
        "code": "120",
        "name": "Производство табачных изделий",
        "children": []
      },
      {
        "code": "1200",
        "name": "Производство табачных изделий",
        "children": [
          {
            "code": "12001",
            "name": "Ферментация табака",
            "children": []
          },
          {
            "code": "12002",
            "name": "Производство изделий из табака",
            "children": []
          }
        ]
      },
      {
        "code": "20",
        "name": "Производство продуктов химической промышленности",
        "children": [
          {
            "code": "201",
            "name": "Производство основных химических веществ, удобрений и азотных соединений, пластмасс и синтетического каучука в первичных формах",
            "children": [
              {
                "code": "2011",
                "name": "Производство промышленных газов",
                "children": []
              },
              {
                "code": "20110",
                "name": "Производство промышленных газов",
                "children": []
              },
              {
                "code": "2012",
                "name": "Производство красителей и пигментов",
                "children": []
              },
              {
                "code": "20120",
                "name": "Производство красителей и пигментов",
                "children": []
              },
              {
                "code": "2013",
                "name": "Производство прочих основных неорганических химических веществ",
                "children": []
              },
              {
                "code": "20130",
                "name": "Производство прочих основных неорганических химических веществ",
                "children": []
              },
              {
                "code": "2014",
                "name": "Производство прочих основных органических химических веществ",
                "children": [
                  {
                    "code": "20141",
                    "name": "Производство дубильных веществ",
                    "children": []
                  },
                  {
                    "code": "20142",
                    "name": "Производство биоэтанола",
                    "children": []
                  },
                  {
                    "code": "20143",
                    "name": "Производство ациклических и циклических углеводородов из углеводородного сырья",
                    "children": []
                  },
                  {
                    "code": "20144",
                    "name": "Производство простых эфиров из углеводородного сырья",
                    "children": []
                  },
                  {
                    "code": "20149",
                    "name": "Производство прочих основных органических химических веществ, не включенных в другие группировки",
                    "children": []
                  }
                ]
              },
              {
                "code": "2015",
                "name": "Производство удобрений и азотосодержащих соединений",
                "children": [
                  {
                    "code": "20151",
                    "name": "Производство удобрений",
                    "children": []
                  },
                  {
                    "code": "20152",
                    "name": "Производство азотосодержащих соединений",
                    "children": []
                  }
                ]
              },
              {
                "code": "2016",
                "name": "Производство пластмасс в первичных формах",
                "children": [
                  {
                    "code": "20161",
                    "name": "Производство пластмасс в первичных формах, кроме полимеров из углеводородного сырья",
                    "children": []
                  },
                  {
                    "code": "20162",
                    "name": "Производство полимеров в первичных формах из углеводородного сырья",
                    "children": []
                  }
                ]
              },
              {
                "code": "2017",
                "name": "Производство синтетического каучука в первичных формах",
                "children": []
              },
              {
                "code": "20170",
                "name": "Производство синтетического каучука в первичных формах",
                "children": []
              }
            ]
          },
          {
            "code": "202",
            "name": "Производство пестицидов и прочей агрохимической продукции",
            "children": []
          },
          {
            "code": "2020",
            "name": "Производство пестицидов и прочей агрохимической продукции",
            "children": []
          },
          {
            "code": "20200",
            "name": "Производство пестицидов и прочей агрохимической продукции",
            "children": []
          },
          {
            "code": "203",
            "name": "Производство красок, лаков и аналогичных покрытий, типографской краски и мастик",
            "children": []
          },
          {
            "code": "2030",
            "name": "Производство красок, лаков и аналогичных покрытий, типографской краски и мастик",
            "children": [
              {
                "code": "20301",
                "name": "Производство красок, лаков, эмалей и минеральных пигментов для них",
                "children": []
              },
              {
                "code": "20302",
                "name": "Производство готовых растворителей и разбавителей красок и лаков",
                "children": []
              }
            ]
          },
          {
            "code": "204",
            "name": "Производство мыла, моющих, чистящих, полирующих, парфюмерных и косметических средств",
            "children": [
              {
                "code": "2041",
                "name": "Производство мыла и моющих, чистящих и полирующих средств",
                "children": []
              },
              {
                "code": "20410",
                "name": "Производство мыла и моющих, чистящих и полирующих средств",
                "children": []
              },
              {
                "code": "2042",
                "name": "Производство парфюмерных и косметических средств",
                "children": []
              },
              {
                "code": "20420",
                "name": "Производство парфюмерных и косметических средств",
                "children": []
              }
            ]
          },
          {
            "code": "205",
            "name": "Производство прочих химических продуктов",
            "children": [
              {
                "code": "2051",
                "name": "Производство взрывчатых веществ",
                "children": [
                  {
                    "code": "20511",
                    "name": "Производство взрывчатых веществ и прочих пиротехнических изделий",
                    "children": []
                  },
                  {
                    "code": "20512",
                    "name": "Производство спичек",
                    "children": []
                  }
                ]
              },
              {
                "code": "2052",
                "name": "Производство клея",
                "children": []
              },
              {
                "code": "20520",
                "name": "Производство клея",
                "children": []
              },
              {
                "code": "2053",
                "name": "Производство эфирных масел",
                "children": []
              },
              {
                "code": "20530",
                "name": "Производство эфирных масел",
                "children": []
              },
              {
                "code": "2059",
                "name": "Производство прочих химических продуктов, не включенных в другие группировки",
                "children": [
                  {
                    "code": "20591",
                    "name": "Производство фотоматериалов",
                    "children": []
                  },
                  {
                    "code": "20592",
                    "name": "Производство желатина",
                    "children": []
                  },
                  {
                    "code": "20593",
                    "name": "Производство материалов, используемых в отделке текстильных изделий",
                    "children": []
                  },
                  {
                    "code": "20594",
                    "name": "Производство технического углерода (сажи), углеродных нанотрубок, нановолокон и других углеродных наноматериалов",
                    "children": []
                  },
                  {
                    "code": "20599",
                    "name": "Производство других химических продуктов",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "code": "206",
            "name": "Производство искусственных и синтетических волокон",
            "children": []
          },
          {
            "code": "2060",
            "name": "Производство искусственных и синтетических волокон",
            "children": []
          },
          {
            "code": "20600",
            "name": "Производство искусственных и синтетических волокон",
            "children": []
          },
          {
            "code": "21",
            "name": "Производство основных фармацевтических продуктов и фармацевтических препаратов",
            "children": [
              {
                "code": "211",
                "name": "Производство основных фармацевтических продуктов",
                "children": []
              },
              {
                "code": "2110",
                "name": "Производство основных фармацевтических продуктов",
                "children": []
              },
              {
                "code": "21100",
                "name": "Производство основных фармацевтических продуктов",
                "children": []
              },
              {
                "code": "212",
                "name": "Производство фармацевтических препаратов и медицинских материалов",
                "children": []
              },
              {
                "code": "2120",
                "name": "Производство фармацевтических препаратов и медицинских материалов",
                "children": [
                  {
                    "code": "21201",
                    "name": "Производство фармацевтических препаратов",
                    "children": []
                  },
                  {
                    "code": "21202",
                    "name": "Производство лекарственных препаратов для ветеринарии",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "code": "22",
            "name": "Производство резиновых и пластмассовых изделий",
            "children": [
              {
                "code": "221",
                "name": "Производство резиновых изделий",
                "children": [
                  {
                    "code": "2211",
                    "name": "Производство резиновых шин, покрышек и камер; восстановление резиновых шин и покрышек",
                    "children": [
                      {
                        "code": "22111",
                        "name": "Производство резиновых шин, покрышек и камер",
                        "children": []
                      },
                      {
                        "code": "22112",
                        "name": "Восстановление резиновых шин и покрышек",
                        "children": []
                      }
                    ]
                  },
                  {
                    "code": "2219",
                    "name": "Производство прочих резиновых изделий",
                    "children": [
                      {
                        "code": "22191",
                        "name": "Производство резинотехнических изделий",
                        "children": []
                      },
                      {
                        "code": "22192",
                        "name": "Производство резиновых санитарно-гигиенических и медицинских изделий",
                        "children": []
                      }
                    ]
                  }
                ]
              },
              {
                "code": "222",
                "name": "Производство пластмассовых изделий",
                "children": [
                  {
                    "code": "2221",
                    "name": "Производство пластмассовых плит, листов, труб и профилей",
                    "children": []
                  },
                  {
                    "code": "22210",
                    "name": "Производство пластмассовых плит, листов, труб и профилей",
                    "children": []
                  },
                  {
                    "code": "2222",
                    "name": "Производство пластмассовых упаковок для товаров",
                    "children": []
                  },
                  {
                    "code": "22220",
                    "name": "Производство пластмассовых упаковок для товаров",
                    "children": []
                  },
                  {
                    "code": "2223",
                    "name": "Производство строительных пластмассовых изделий",
                    "children": [
                      {
                        "code": "22231",
                        "name": "Производство пластмассовых изделий, используемых в строительстве",
                        "children": []
                      },
                      {
                        "code": "22232",
                        "name": "Производство линолеума и прочих эластичных покрытий для пола",
                        "children": []
                      }
                    ]
                  },
                  {
                    "code": "2229",
                    "name": "Производство прочих пластмассовых изделий",
                    "children": []
                  },
                  {
                    "code": "22290",
                    "name": "Производство прочих пластмассовых изделий",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "code": "23",
            "name": "Производство прочей не металлической минеральной продукции",
            "children": [
              {
                "code": "231",
                "name": "Производство стекла и изделий из стекла",
                "children": [
                  {
                    "code": "2311",
                    "name": "Производство листового стекла",
                    "children": []
                  },
                  {
                    "code": "23110",
                    "name": "Производство листового стекла",
                    "children": []
                  },
                  {
                    "code": "2312",
                    "name": "Формирование и обработка листового стекла",
                    "children": []
                  },
                  {
                    "code": "23120",
                    "name": "Формирование и обработка листового стекла",
                    "children": []
                  },
                  {
                    "code": "2313",
                    "name": "Производство полых стеклянных изделий",
                    "children": [
                      {
                        "code": "23131",
                        "name": "Производство стеклянной тары",
                        "children": []
                      },
                      {
                        "code": "23132",
                        "name": "Производство хозяйственно-бытовых изделий из стекла и стеклянной посуды",
                        "children": []
                      }
                    ]
                  },
                  {
                    "code": "2314",
                    "name": "Производство стекловолокна",
                    "children": []
                  },
                  {
                    "code": "23140",
                    "name": "Производство стекловолокна",
                    "children": []
                  },
                  {
                    "code": "2319",
                    "name": "Производство и обработка прочих стеклянных изделий",
                    "children": [
                      {
                        "code": "23191",
                        "name": "Производство электротехнического и электровакуумного стекла",
                        "children": []
                      },
                      {
                        "code": "23192",
                        "name": "Производство химико-лабораторной посуды из стекла",
                        "children": []
                      },
                      {
                        "code": "23199",
                        "name": "Производство стеклянных изделий, не включенных в другие группировки",
                        "children": []
                      }
                    ]
                  }
                ]
              },
              {
                "code": "232",
                "name": "Производство огнеупорных изделий",
                "children": []
              },
              {
                "code": "2320",
                "name": "Производство огнеупорных изделий",
                "children": []
              },
              {
                "code": "23200",
                "name": "Производство огнеупорных изделий",
                "children": []
              },
              {
                "code": "233",
                "name": "Производство строительных материалов из глины",
                "children": [
                  {
                    "code": "2331",
                    "name": "Производство керамических покрытий и плит",
                    "children": []
                  },
                  {
                    "code": "23310",
                    "name": "Производство керамических покрытий и плит",
                    "children": []
                  },
                  {
                    "code": "2332",
                    "name": "Производство кирпича, черепицы и прочих строительных изделий из обожженной глины",
                    "children": []
                  },
                  {
                    "code": "23320",
                    "name": "Производство кирпича, черепицы и прочих строительных изделий из обожженной глины",
                    "children": []
                  }
                ]
              },
              {
                "code": "234",
                "name": "Производство прочих фарфоровых и керамических изделий",
                "children": [
                  {
                    "code": "2341",
                    "name": "Производство керамических хозяйственных и декоративных изделий",
                    "children": [
                      {
                        "code": "23411",
                        "name": "Производство хозяйственно-бытовых изделий из фарфора и фаянса",
                        "children": []
                      },
                      {
                        "code": "23412",
                        "name": "Производство хозяйственно-бытовых гончарных изделий",
                        "children": []
                      }
                    ]
                  },
                  {
                    "code": "2342",
                    "name": "Производство керамических санитарно-технических изделий",
                    "children": []
                  },
                  {
                    "code": "23420",
                    "name": "Производство керамических санитарно-технических изделий",
                    "children": []
                  },
                  {
                    "code": "2343",
                    "name": "Производство керамических электрических изоляторов и изолирующей арматуры",
                    "children": []
                  },
                  {
                    "code": "23430",
                    "name": "Производство керамических электрических изоляторов и изолирующей арматуры",
                    "children": []
                  },
                  {
                    "code": "2344",
                    "name": "Производство прочих технических керамических изделий",
                    "children": []
                  },
                  {
                    "code": "23440",
                    "name": "Производство прочих технических керамических изделий",
                    "children": []
                  },
                  {
                    "code": "2349",
                    "name": "Производство прочих керамических изделий",
                    "children": []
                  },
                  {
                    "code": "23490",
                    "name": "Производство прочих керамических изделий",
                    "children": []
                  }
                ]
              },
              {
                "code": "235",
                "name": "Производство цемента, извести и строительного гипса",
                "children": [
                  {
                    "code": "2351",
                    "name": "Производство цемента",
                    "children": []
                  },
                  {
                    "code": "23510",
                    "name": "Производство цемента",
                    "children": []
                  },
                  {
                    "code": "2352",
                    "name": "Производство извести и строительного гипса",
                    "children": [
                      {
                        "code": "23521",
                        "name": "Производство извести",
                        "children": []
                      },
                      {
                        "code": "23522",
                        "name": "Производство известняковой и доломитовой муки",
                        "children": []
                      },
                      {
                        "code": "23523",
                        "name": "Производство строительного гипса",
                        "children": []
                      }
                    ]
                  }
                ]
              },
              {
                "code": "236",
                "name": "Производство изделий из бетона, цемента и строительного гипса",
                "children": [
                  {
                    "code": "2361",
                    "name": "Производство строительных изделий из бетона",
                    "children": [
                      {
                        "code": "23611",
                        "name": "Производство сборных железобетонных и бетонных конструкций и изделий",
                        "children": []
                      },
                      {
                        "code": "23612",
                        "name": "Производство стеновых блоков",
                        "children": []
                      },
                      {
                        "code": "23613",
                        "name": "Производство силикатного кирпича",
                        "children": []
                      }
                    ]
                  },
                  {
                    "code": "2362",
                    "name": "Производство изделий из гипса для строительных целей",
                    "children": []
                  },
                  {
                    "code": "23620",
                    "name": "Производство изделий из гипса для строительных целей",
                    "children": []
                  },
                  {
                    "code": "2363",
                    "name": "Производство товарного бетона",
                    "children": []
                  },
                  {
                    "code": "23630",
                    "name": "Производство товарного бетона",
                    "children": []
                  },
                  {
                    "code": "2364",
                    "name": "Производство строительных растворов",
                    "children": []
                  },
                  {
                    "code": "23640",
                    "name": "Производство строительных растворов",
                    "children": []
                  },
                  {
                    "code": "2365",
                    "name": "Производство изделий из асбестоцемента и волокнистого цемента",
                    "children": []
                  },
                  {
                    "code": "23650",
                    "name": "Производство изделий из асбестоцемента и волокнистого цемента",
                    "children": []
                  },
                  {
                    "code": "2369",
                    "name": "Производство прочих изделий из бетона, строительного гипса и цемента",
                    "children": []
                  },
                  {
                    "code": "23690",
                    "name": "Производство прочих изделий из бетона, строительного гипса и цемента",
                    "children": []
                  }
                ]
              },
              {
                "code": "237",
                "name": "Резка, обработка и отделка камня",
                "children": []
              },
              {
                "code": "2370",
                "name": "Резка, обработка и отделка камня",
                "children": []
              },
              {
                "code": "23700",
                "name": "Резка, обработка и отделка камня",
                "children": []
              },
              {
                "code": "239",
                "name": "Производство абразивных изделий и прочей неметаллической минеральной продукции",
                "children": [
                  {
                    "code": "2391",
                    "name": "Производство абразивных изделий",
                    "children": []
                  },
                  {
                    "code": "23910",
                    "name": "Производство абразивных изделий",
                    "children": []
                  },
                  {
                    "code": "2399",
                    "name": "Производство прочей неметаллической минеральной продукции, не включенной в другие группировки",
                    "children": [
                      {
                        "code": "23991",
                        "name": "Производство асбестотехнических изделий",
                        "children": []
                      },
                      {
                        "code": "23992",
                        "name": "Производство минеральных изоляционных материалов",
                        "children": []
                      },
                      {
                        "code": "23993",
                        "name": "Производство мягких кровельных и гидроизоляционных материалов",
                        "children": []
                      },
                      {
                        "code": "23994",
                        "name": "Производство искусственных и переработка естественных пористых заполнителей",
                        "children": []
                      },
                      {
                        "code": "23995",
                        "name": "Производство изделий из битума и аналогичных материалов",
                        "children": []
                      },
                      {
                        "code": "23996",
                        "name": "Производство изделий из неметаллических руд",
                        "children": []
                      }
                    ]
                  }
                ]
              }
            ]
          },
          {
            "code": "24",
            "name": "Металлургическое производство",
            "children": [
              {
                "code": "241",
                "name": "Производство чугуна, стали и ферросплавов",
                "children": []
              },
              {
                "code": "2410",
                "name": "Производство чугуна, стали и ферросплавов",
                "children": []
              },
              {
                "code": "24100",
                "name": "Производство чугуна, стали и ферросплавов",
                "children": []
              },
              {
                "code": "242",
                "name": "Производство труб, трубок, полых профилей, фитингов из стали",
                "children": []
              },
              {
                "code": "2420",
                "name": "Производство труб, трубок, полых профилей, фитингов из стали",
                "children": []
              },
              {
                "code": "24200",
                "name": "Производство труб, трубок, полых профилей, фитингов из стали",
                "children": []
              },
              {
                "code": "243",
                "name": "Производство прочих стальных изделий путем первичной обработки",
                "children": [
                  {
                    "code": "2431",
                    "name": "Холодное волочение",
                    "children": []
                  },
                  {
                    "code": "24310",
                    "name": "Холодное волочение",
                    "children": []
                  },
                  {
                    "code": "2432",
                    "name": "Холодная прокатка лент и узких полос",
                    "children": []
                  },
                  {
                    "code": "24320",
                    "name": "Холодная прокатка лент и узких полос",
                    "children": []
                  },
                  {
                    "code": "2433",
                    "name": "Холодная штамповка или гибка",
                    "children": []
                  },
                  {
                    "code": "24330",
                    "name": "Холодная штамповка или гибка",
                    "children": []
                  },
                  {
                    "code": "2434",
                    "name": "Производство проволоки путем холодного волочения",
                    "children": []
                  },
                  {
                    "code": "24340",
                    "name": "Производство проволоки путем холодного волочения",
                    "children": []
                  }
                ]
              },
              {
                "code": "244",
                "name": "Производство основных благородных и цветных металлов",
                "children": [
                  {
                    "code": "2441",
                    "name": "Производство благородных (драгоценных) металлов",
                    "children": []
                  },
                  {
                    "code": "24410",
                    "name": "Производство благородных (драгоценных) металлов",
                    "children": []
                  },
                  {
                    "code": "2442",
                    "name": "Производство алюминия",
                    "children": []
                  },
                  {
                    "code": "24420",
                    "name": "Производство алюминия",
                    "children": []
                  },
                  {
                    "code": "2443",
                    "name": "Производство свинца, цинка и олова",
                    "children": []
                  },
                  {
                    "code": "24430",
                    "name": "Производство свинца, цинка и олова",
                    "children": []
                  },
                  {
                    "code": "2444",
                    "name": "Производство меди",
                    "children": []
                  },
                  {
                    "code": "24440",
                    "name": "Производство меди",
                    "children": []
                  },
                  {
                    "code": "2445",
                    "name": "Производство прочих цветных металлов",
                    "children": [
                      {
                        "code": "24451",
                        "name": "Производство никеля и кобальта",
                        "children": []
                      },
                      {
                        "code": "24452",
                        "name": "Производство титана, порошка из титана, магния, вольфрама и молибдена",
                        "children": []
                      },
                      {
                        "code": "24453",
                        "name": "Производство сурьмы и ртути",
                        "children": []
                      },
                      {
                        "code": "24454",
                        "name": "Обработка цветных металлов и сплавов",
                        "children": []
                      },
                      {
                        "code": "24455",
                        "name": "Производство редких, редкоземельных металлов и полупроводниковых материалов",
                        "children": []
                      }
                    ]
                  },
                  {
                    "code": "2446",
                    "name": "Переработка ядерного топлива",
                    "children": []
                  },
                  {
                    "code": "24460",
                    "name": "Переработка ядерного топлива",
                    "children": []
                  }
                ]
              },
              {
                "code": "245",
                "name": "Литье металлов",
                "children": [
                  {
                    "code": "2451",
                    "name": "Литье чугуна",
                    "children": [
                      {
                        "code": "24511",
                        "name": "Литье чугуна, кроме производства труб",
                        "children": []
                      },
                      {
                        "code": "24512",
                        "name": "Производство труб из чугуна",
                        "children": []
                      }
                    ]
                  },
                  {
                    "code": "2452",
                    "name": "Литье стали",
                    "children": []
                  },
                  {
                    "code": "24520",
                    "name": "Литье стали",
                    "children": []
                  },
                  {
                    "code": "2453",
                    "name": "Литье легких металлов",
                    "children": []
                  },
                  {
                    "code": "24530",
                    "name": "Литье легких металлов",
                    "children": []
                  },
                  {
                    "code": "2454",
                    "name": "Литье прочих цветных металлов",
                    "children": []
                  },
                  {
                    "code": "24540",
                    "name": "Литье прочих цветных металлов",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "code": "25",
            "name": "Производство готовых металлических изделий, кроме машин и оборудования",
            "children": [
              {
                "code": "251",
                "name": "Производство строительных металлических конструкций и изделий",
                "children": [
                  {
                    "code": "2511",
                    "name": "Производство строительных металлических конструкций и их частей",
                    "children": [
                      {
                        "code": "25111",
                        "name": "Производство строительных стальных конструкций",
                        "children": []
                      },
                      {
                        "code": "25112",
                        "name": "Производство легких металлических конструкций",
                        "children": []
                      },
                      {
                        "code": "25113",
                        "name": "Производство строительных конструкций и изделий из алюминия и алюминиевых сплавов",
                        "children": []
                      },
                      {
                        "code": "25114",
                        "name": "Производство контейнерных и сборно-разборных зданий и помещений",
                        "children": []
                      }
                    ]
                  },
                  {
                    "code": "2512",
                    "name": "Производство металлических дверей и окон",
                    "children": []
                  },
                  {
                    "code": "25120",
                    "name": "Производство металлических дверей и окон",
                    "children": []
                  }
                ]
              },
              {
                "code": "252",
                "name": "Производство металлических цистерн, резервуаров и контейнеров",
                "children": [
                  {
                    "code": "2521",
                    "name": "Производство радиаторов и котлов центрального отопления",
                    "children": []
                  },
                  {
                    "code": "25210",
                    "name": "Производство радиаторов и котлов центрального отопления",
                    "children": []
                  },
                  {
                    "code": "2529",
                    "name": "Производство прочих металлических цистерн, резервуаров и контейнеров",
                    "children": []
                  },
                  {
                    "code": "25290",
                    "name": "Производство прочих металлических цистерн, резервуаров и контейнеров",
                    "children": []
                  }
                ]
              },
              {
                "code": "253",
                "name": "Производство паровых котлов, кроме котлов центрального отопления",
                "children": []
              },
              {
                "code": "2530",
                "name": "Производство паровых котлов, кроме котлов центрального отопления",
                "children": []
              },
              {
                "code": "25300",
                "name": "Производство паровых котлов, кроме котлов центрального отопления",
                "children": []
              },
              {
                "code": "254",
                "name": "Производство оружия и боеприпасов",
                "children": []
              },
              {
                "code": "2540",
                "name": "Производство оружия и боеприпасов",
                "children": []
              },
              {
                "code": "25400",
                "name": "Производство оружия и боеприпасов",
                "children": []
              },
              {
                "code": "255",
                "name": "Ковка, прессование, штамповка, профилирование металла; порошковая металлургия",
                "children": []
              },
              {
                "code": "2550",
                "name": "Ковка, прессование, штамповка, профилирование металла; порошковая металлургия",
                "children": [
                  {
                    "code": "25501",
                    "name": "Производство готовых металлических изделий или полуфабрикатов путем ковки, прессования, штамповки и профилирования",
                    "children": []
                  },
                  {
                    "code": "25502",
                    "name": "Производство металлических изделий методом порошковой металлургии",
                    "children": []
                  }
                ]
              },
              {
                "code": "256",
                "name": "Обработка металлов и нанесение покрытий на металлы; основные технологические процессы машиностроения",
                "children": [
                  {
                    "code": "2561",
                    "name": "Обработка металлов и нанесение покрытий на металлы",
                    "children": []
                  },
                  {
                    "code": "25610",
                    "name": "Обработка металлов и нанесение покрытий на металлы",
                    "children": []
                  },
                  {
                    "code": "2562",
                    "name": "Основные технологические процессы машиностроения",
                    "children": []
                  },
                  {
                    "code": "25620",
                    "name": "Основные технологические процессы машиностроения",
                    "children": []
                  }
                ]
              },
              {
                "code": "257",
                "name": "Производство ножевых изделий, инструментов и скобяных изделий",
                "children": [
                  {
                    "code": "2571",
                    "name": "Производство ножевых изделий",
                    "children": []
                  },
                  {
                    "code": "25710",
                    "name": "Производство ножевых изделий",
                    "children": []
                  },
                  {
                    "code": "2572",
                    "name": "Производство замков, петель и шарниров",
                    "children": []
                  },
                  {
                    "code": "25720",
                    "name": "Производство замков, петель и шарниров",
                    "children": []
                  },
                  {
                    "code": "2573",
                    "name": "Производство инструментов",
                    "children": [
                      {
                        "code": "25731",
                        "name": "Производство металло- и деревообрабатывающего инструмента",
                        "children": []
                      },
                      {
                        "code": "25732",
                        "name": "Производство сельскохозяйственного и садово-огородного инвентаря",
                        "children": []
                      },
                      {
                        "code": "25739",
                        "name": "Производство инструментов, не включенных в другие группировки",
                        "children": []
                      }
                    ]
                  }
                ]
              },
              {
                "code": "259",
                "name": "Производство прочих готовых металлических изделий",
                "children": [
                  {
                    "code": "2591",
                    "name": "Производство металлических бочек и аналогичных емкостей",
                    "children": []
                  },
                  {
                    "code": "25910",
                    "name": "Производство металлических бочек и аналогичных емкостей",
                    "children": []
                  },
                  {
                    "code": "2592",
                    "name": "Производство упаковки из легких металлов",
                    "children": []
                  },
                  {
                    "code": "25920",
                    "name": "Производство упаковки из легких металлов",
                    "children": []
                  },
                  {
                    "code": "2593",
                    "name": "Производство изделий из проволоки, цепей и пружин",
                    "children": [
                      {
                        "code": "25931",
                        "name": "Производство изделий из проволоки",
                        "children": []
                      },
                      {
                        "code": "25932",
                        "name": "Производство цепей и пружин",
                        "children": []
                      }
                    ]
                  },
                  {
                    "code": "2594",
                    "name": "Производство крепежных и резьбовых изделий",
                    "children": []
                  },
                  {
                    "code": "25940",
                    "name": "Производство крепежных и резьбовых изделий",
                    "children": []
                  },
                  {
                    "code": "2599",
                    "name": "Производство прочих готовых металлических изделий, не включенных в другие группировки",
                    "children": [
                      {
                        "code": "25991",
                        "name": "Производство металлического санитарно-технического оборудования",
                        "children": []
                      },
                      {
                        "code": "25992",
                        "name": "Производство хозяйственной посуды и кухонного инвентаря из металла",
                        "children": []
                      },
                      {
                        "code": "25999",
                        "name": "Производство прочих готовых металлических изделий",
                        "children": []
                      }
                    ]
                  }
                ]
              }
            ]
          },
          {
            "code": "26",
            "name": "Производство компьютеров, электронного и оптического оборудования",
            "children": [
              {
                "code": "261",
                "name": "Производство электронных элементов и плат",
                "children": [
                  {
                    "code": "2611",
                    "name": "Производство электронных элементов",
                    "children": []
                  },
                  {
                    "code": "26110",
                    "name": "Производство электронных элементов",
                    "children": []
                  },
                  {
                    "code": "2612",
                    "name": "Производство электронных плат",
                    "children": []
                  },
                  {
                    "code": "26120",
                    "name": "Производство электронных плат",
                    "children": []
                  }
                ]
              },
              {
                "code": "262",
                "name": "Производство компьютеров и периферийного оборудования",
                "children": []
              },
              {
                "code": "2620",
                "name": "Производство компьютеров и периферийного оборудования",
                "children": []
              },
              {
                "code": "26200",
                "name": "Производство компьютеров и периферийного оборудования",
                "children": []
              },
              {
                "code": "263",
                "name": "Производство коммуникационного оборудования",
                "children": []
              },
              {
                "code": "2630",
                "name": "Производство коммуникационного оборудования",
                "children": [
                  {
                    "code": "26301",
                    "name": "Производство теле- и радиоаппаратуры производственного назначения",
                    "children": []
                  },
                  {
                    "code": "26302",
                    "name": "Производство аппаратуры для кабельной телефонной и телеграфной связи",
                    "children": []
                  }
                ]
              },
              {
                "code": "264",
                "name": "Производство электронной бытовой техники",
                "children": []
              },
              {
                "code": "2640",
                "name": "Производство электронной бытовой техники",
                "children": []
              },
              {
                "code": "26400",
                "name": "Производство электронной бытовой техники",
                "children": []
              },
              {
                "code": "265",
                "name": "Производство инструментов и приборов для измерения, тестирования и навигации; производство часов",
                "children": [
                  {
                    "code": "2651",
                    "name": "Производство инструментов и приборов для измерения, тестирования и навигации",
                    "children": [
                      {
                        "code": "26511",
                        "name": "Производство приборов для измерения механических величин",
                        "children": []
                      },
                      {
                        "code": "26512",
                        "name": "Производство электроизмерительных приборов",
                        "children": []
                      },
                      {
                        "code": "26513",
                        "name": "Производство радиоизмерительных приборов",
                        "children": []
                      },
                      {
                        "code": "26514",
                        "name": "Производство оптических и оптико-механических приборов и оборудования",
                        "children": []
                      },
                      {
                        "code": "26515",
                        "name": "Производство приборов для физических исследований",
                        "children": []
                      },
                      {
                        "code": "26516",
                        "name": "Производство медико-хирургических инструментов",
                        "children": []
                      },
                      {
                        "code": "26517",
                        "name": "Производство оборудования для систем позиционирования и мониторинга ответственных сооружений",
                        "children": []
                      }
                    ]
                  },
                  {
                    "code": "2652",
                    "name": "Производство часов",
                    "children": [
                      {
                        "code": "26521",
                        "name": "Производство часов всех видов",
                        "children": []
                      },
                      {
                        "code": "26522",
                        "name": "Производство приборов для регистрации времени",
                        "children": []
                      },
                      {
                        "code": "26523",
                        "name": "Производство деталей и принадлежностей для часов",
                        "children": []
                      }
                    ]
                  }
                ]
              },
              {
                "code": "266",
                "name": "Производство облучающего, электромедицинского и электротерапевтического оборудования",
                "children": []
              },
              {
                "code": "2660",
                "name": "Производство облучающего, электромедицинского и электротерапевтического оборудования",
                "children": []
              },
              {
                "code": "26600",
                "name": "Производство облучающего, электромедицинского и электротерапевтического оборудования",
                "children": []
              },
              {
                "code": "267",
                "name": "Производство оптических приборов, фото- и кинооборудования",
                "children": []
              },
              {
                "code": "2670",
                "name": "Производство оптических приборов, фото- и кинооборудования",
                "children": [
                  {
                    "code": "26701",
                    "name": "Производство оптических приборов",
                    "children": []
                  },
                  {
                    "code": "26702",
                    "name": "Производство фото- и кинооборудования",
                    "children": []
                  }
                ]
              },
              {
                "code": "268",
                "name": "Производство магнитных и оптических носителей информации",
                "children": []
              },
              {
                "code": "2680",
                "name": "Производство магнитных и оптических носителей информации",
                "children": []
              },
              {
                "code": "26800",
                "name": "Производство магнитных и оптических носителей информации",
                "children": []
              }
            ]
          },
          {
            "code": "27",
            "name": "Производство электрического оборудования",
            "children": [
              {
                "code": "271",
                "name": "Производство электродвигателей, генераторов, трансформаторов и электрораспределительной и регулирующей аппаратуры",
                "children": [
                  {
                    "code": "2711",
                    "name": "Производство электродвигателей, генераторов и трансформаторов",
                    "children": []
                  },
                  {
                    "code": "27110",
                    "name": "Производство электродвигателей, генераторов и трансформаторов",
                    "children": []
                  },
                  {
                    "code": "2712",
                    "name": "Производство электрораспределительной и регулирующей аппаратуры",
                    "children": []
                  },
                  {
                    "code": "27120",
                    "name": "Производство электрораспределительной и регулирующей аппаратуры",
                    "children": []
                  }
                ]
              },
              {
                "code": "272",
                "name": "Производство батарей и аккумуляторов",
                "children": []
              },
              {
                "code": "2720",
                "name": "Производство батарей и аккумуляторов",
                "children": []
              },
              {
                "code": "27200",
                "name": "Производство батарей и аккумуляторов",
                "children": []
              },
              {
                "code": "273",
                "name": "Производство электропроводки и электромонтажных устройств",
                "children": [
                  {
                    "code": "2731",
                    "name": "Производство волоконно-оптических кабелей",
                    "children": []
                  },
                  {
                    "code": "27310",
                    "name": "Производство волоконно-оптических кабелей",
                    "children": []
                  },
                  {
                    "code": "2732",
                    "name": "Производство прочих электрических проводов и кабелей",
                    "children": []
                  },
                  {
                    "code": "27320",
                    "name": "Производство прочих электрических проводов и кабелей",
                    "children": []
                  },
                  {
                    "code": "2733",
                    "name": "Производство электромонтажных устройств",
                    "children": []
                  },
                  {
                    "code": "27330",
                    "name": "Производство электромонтажных устройств",
                    "children": []
                  }
                ]
              },
              {
                "code": "274",
                "name": "Производство электроосветительного оборудования",
                "children": []
              },
              {
                "code": "2740",
                "name": "Производство электроосветительного оборудования",
                "children": [
                  {
                    "code": "27401",
                    "name": "Производство электроламп",
                    "children": []
                  },
                  {
                    "code": "27402",
                    "name": "Производство осветительных приборов",
                    "children": []
                  }
                ]
              },
              {
                "code": "275",
                "name": "Производство бытовых приборов",
                "children": [
                  {
                    "code": "2751",
                    "name": "Производство электрических бытовых приборов",
                    "children": [
                      {
                        "code": "27511",
                        "name": "Производство электрических бытовых приборов, кроме холодильников и морозильников",
                        "children": []
                      },
                      {
                        "code": "27512",
                        "name": "Производство бытовых холодильников и морозильников",
                        "children": []
                      }
                    ]
                  },
                  {
                    "code": "2752",
                    "name": "Производство неэлектрических бытовых приборов",
                    "children": []
                  },
                  {
                    "code": "27520",
                    "name": "Производство неэлектрических бытовых приборов",
                    "children": []
                  }
                ]
              },
              {
                "code": "279",
                "name": "Производство прочего электрического оборудования",
                "children": []
              },
              {
                "code": "2790",
                "name": "Производство прочего электрического оборудования",
                "children": [
                  {
                    "code": "27901",
                    "name": "Производство электродной продукции",
                    "children": []
                  },
                  {
                    "code": "27902",
                    "name": "Производство электроизоляционных изделий",
                    "children": []
                  },
                  {
                    "code": "27903",
                    "name": "Производство электрического сигнального оборудования",
                    "children": []
                  },
                  {
                    "code": "27909",
                    "name": "Производство прочего электрического оборудования, не включенного в другие группировки",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "code": "28",
            "name": "Производство машин и оборудования, не включенных в другие группировки",
            "children": [
              {
                "code": "281",
                "name": "Производство оборудования общего назначения",
                "children": [
                  {
                    "code": "2811",
                    "name": "Производство двигателей и турбин, кроме авиационных, автомобильных и мотоциклетных двигателей",
                    "children": [
                      {
                        "code": "28111",
                        "name": "Производство двигателей",
                        "children": []
                      },
                      {
                        "code": "28112",
                        "name": "Производство турбин",
                        "children": []
                      }
                    ]
                  },
                  {
                    "code": "2812",
                    "name": "Производство гидравлического и пневматического оборудования",
                    "children": []
                  },
                  {
                    "code": "28120",
                    "name": "Производство гидравлического и пневматического оборудования",
                    "children": []
                  },
                  {
                    "code": "2813",
                    "name": "Производство прочих насосов и компрессоров",
                    "children": [
                      {
                        "code": "28131",
                        "name": "Производство вакуумных и воздушных насосов",
                        "children": []
                      },
                      {
                        "code": "28132",
                        "name": "Производство компрессоров",
                        "children": []
                      },
                      {
                        "code": "28139",
                        "name": "Производство прочих насосов, не включенных в другие группировки",
                        "children": []
                      }
                    ]
                  },
                  {
                    "code": "2814",
                    "name": "Производство прочих кранов, клапанов и вентилей",
                    "children": []
                  },
                  {
                    "code": "28140",
                    "name": "Производство прочих кранов, клапанов и вентилей",
                    "children": []
                  },
                  {
                    "code": "2815",
                    "name": "Производство подшипников, зубчатых передач, элементов зубчатых передач и приводов",
                    "children": [
                      {
                        "code": "28151",
                        "name": "Производство подшипников",
                        "children": []
                      },
                      {
                        "code": "28152",
                        "name": "Производство зубчатых передач, элементов зубчатых передач и приводов",
                        "children": []
                      }
                    ]
                  }
                ]
              },
              {
                "code": "282",
                "name": "Производство прочих машин и оборудования общего назначения",
                "children": [
                  {
                    "code": "2821",
                    "name": "Производство плит, печей и печных горелок",
                    "children": [
                      {
                        "code": "28211",
                        "name": "Производство неэлектрических печей, горелок и устройств для печей",
                        "children": []
                      },
                      {
                        "code": "28212",
                        "name": "Производство электрических печей",
                        "children": []
                      }
                    ]
                  },
                  {
                    "code": "2822",
                    "name": "Производство подъемно-транспортного оборудования",
                    "children": [
                      {
                        "code": "28221",
                        "name": "Производство кранов (без строительных)",
                        "children": []
                      },
                      {
                        "code": "28222",
                        "name": "Производство кранов для строительства",
                        "children": []
                      },
                      {
                        "code": "28223",
                        "name": "Производство оборудования непрерывного транспорта",
                        "children": []
                      },
                      {
                        "code": "28224",
                        "name": "Производство лифтов",
                        "children": []
                      },
                      {
                        "code": "28225",
                        "name": "Производство авто- и электропогрузчиков",
                        "children": []
                      },
                      {
                        "code": "28229",
                        "name": "Производство прочего подъемно-транспортного оборудования",
                        "children": []
                      }
                    ]
                  },
                  {
                    "code": "2823",
                    "name": "Производство офисной техники и оборудования (за исключением компьютеров и периферийного оборудования)",
                    "children": []
                  },
                  {
                    "code": "28230",
                    "name": "Производство офисной техники и оборудования (за исключением компьютеров и периферийного оборудования)",
                    "children": []
                  },
                  {
                    "code": "2824",
                    "name": "Производство ручных механизированных инструментов",
                    "children": []
                  },
                  {
                    "code": "28240",
                    "name": "Производство ручных механизированных инструментов",
                    "children": []
                  },
                  {
                    "code": "2825",
                    "name": "Производство промышленного холодильного и вентиляционного оборудования",
                    "children": [
                      {
                        "code": "28251",
                        "name": "Производство холодильного или морозильного оборудования",
                        "children": []
                      },
                      {
                        "code": "28252",
                        "name": "Производство кондиционеров воздуха, вентиляторов",
                        "children": []
                      }
                    ]
                  },
                  {
                    "code": "2829",
                    "name": "Производство прочих машин и оборудования общего назначения, не включенных в другие группировки",
                    "children": [
                      {
                        "code": "28291",
                        "name": "Производство весоизмерительного оборудования (кроме высокоточного лабораторного оборудования)",
                        "children": []
                      },
                      {
                        "code": "28292",
                        "name": "Производство оборудования для фильтрования и очистки",
                        "children": []
                      },
                      {
                        "code": "28293",
                        "name": "Производство оборудования для распыления и разбрызгивания жидкостей или порошков",
                        "children": []
                      },
                      {
                        "code": "28294",
                        "name": "Производство упаковочных и оберточных машин",
                        "children": []
                      },
                      {
                        "code": "28295",
                        "name": "Производство оборудования и аппаратуры для химических процессов",
                        "children": []
                      },
                      {
                        "code": "28296",
                        "name": "Производство чертежных, разметочных и измерительных инструментов",
                        "children": []
                      },
                      {
                        "code": "28299",
                        "name": "Производство прочих машин и оборудования, деталей и узлов",
                        "children": []
                      }
                    ]
                  }
                ]
              },
              {
                "code": "283",
                "name": "Производство сельскохозяйственной и лесохозяйственной техники",
                "children": []
              },
              {
                "code": "2830",
                "name": "Производство сельскохозяйственной и лесохозяйственной техники",
                "children": [
                  {
                    "code": "28301",
                    "name": "Производство сельскохозяйственных и лесохозяйственных тракторов",
                    "children": []
                  },
                  {
                    "code": "28302",
                    "name": "Производство сельскохозяйственных машин",
                    "children": []
                  },
                  {
                    "code": "28303",
                    "name": "Производство оборудования для животноводства и кормопроизводства",
                    "children": []
                  },
                  {
                    "code": "28304",
                    "name": "Производство лесозаготовительного и мелиоративного оборудования",
                    "children": []
                  }
                ]
              },
              {
                "code": "284",
                "name": "Производство станков для обработки металлов и прочих станков",
                "children": [
                  {
                    "code": "2841",
                    "name": "Производство станков для обработки металлов",
                    "children": [
                      {
                        "code": "28411",
                        "name": "Производство станков для обработки металлов лазером и станков аналогичных",
                        "children": []
                      },
                      {
                        "code": "28412",
                        "name": "Производство токарных, расточных, сверлильных и фрезерных станков",
                        "children": []
                      },
                      {
                        "code": "28413",
                        "name": "Производство прочих металлорежущих станков",
                        "children": []
                      },
                      {
                        "code": "28414",
                        "name": "Производство частей и приспособлений к металлообрабатывающим станкам",
                        "children": []
                      }
                    ]
                  },
                  {
                    "code": "2849",
                    "name": "Производство прочих станков",
                    "children": [
                      {
                        "code": "28491",
                        "name": "Производство станков для обработки камня, дерева и материалов твердых аналогичных",
                        "children": []
                      },
                      {
                        "code": "28498",
                        "name": "Производство частей и приспособлений прочих станков",
                        "children": []
                      },
                      {
                        "code": "28499",
                        "name": "Производство прочих станков, не включенных в другие группировки",
                        "children": []
                      }
                    ]
                  }
                ]
              },
              {
                "code": "289",
                "name": "Производство прочих машин и оборудования специального назначения",
                "children": [
                  {
                    "code": "2891",
                    "name": "Производство машин и оборудования для металлургии",
                    "children": []
                  },
                  {
                    "code": "28910",
                    "name": "Производство машин и оборудования для металлургии",
                    "children": []
                  },
                  {
                    "code": "2892",
                    "name": "Производство машин и оборудования для горнодобывающей промышленности, подземной разработки и строительства",
                    "children": [
                      {
                        "code": "28921",
                        "name": "Производство горношахтного и горнорудного оборудования",
                        "children": []
                      },
                      {
                        "code": "28922",
                        "name": "Производство дорожных и землеройных машин",
                        "children": []
                      },
                      {
                        "code": "28923",
                        "name": "Производство строительных машин",
                        "children": []
                      },
                      {
                        "code": "28924",
                        "name": "Производство оборудования для обработки строительных материалов",
                        "children": []
                      },
                      {
                        "code": "28925",
                        "name": "Производство оборудования для торфяной промышленности",
                        "children": []
                      }
                    ]
                  },
                  {
                    "code": "2893",
                    "name": "Производство машин и оборудования для производства и переработки продуктов питания, напитков и табачных изделий",
                    "children": []
                  },
                  {
                    "code": "28930",
                    "name": "Производство машин и оборудования для производства и переработки продуктов питания, напитков и табачных изделий",
                    "children": []
                  },
                  {
                    "code": "2894",
                    "name": "Производство машин и оборудования для изготовления текстильных, швейных, меховых и кожаных изделий",
                    "children": [
                      {
                        "code": "28941",
                        "name": "Производство машин и оборудования для текстильной промышленности",
                        "children": []
                      },
                      {
                        "code": "28942",
                        "name": "Производство машин и оборудования для швейной и трикотажной промышленности",
                        "children": []
                      },
                      {
                        "code": "28943",
                        "name": "Производство швейных машин",
                        "children": []
                      },
                      {
                        "code": "28944",
                        "name": "Производство машин и оборудования для обувной, меховой, кожевенной и кожгалантерейной промышленности",
                        "children": []
                      },
                      {
                        "code": "28945",
                        "name": "Производство специального оборудования для предприятий бытового обслуживания",
                        "children": []
                      },
                      {
                        "code": "28946",
                        "name": "Производство оборудования для получения химического волокна",
                        "children": []
                      }
                    ]
                  },
                  {
                    "code": "2895",
                    "name": "Производство машин и оборудования для изготовления бумаги и картона",
                    "children": []
                  },
                  {
                    "code": "28950",
                    "name": "Производство машин и оборудования для изготовления бумаги и картона",
                    "children": []
                  },
                  {
                    "code": "2896",
                    "name": "Производство машин и оборудования для обработки пластмасс и резины",
                    "children": []
                  },
                  {
                    "code": "28960",
                    "name": "Производство машин и оборудования для обработки пластмасс и резины",
                    "children": []
                  },
                  {
                    "code": "2899",
                    "name": "Производство прочих машин и оборудования специального назначения, не включенных в другие группировки",
                    "children": [
                      {
                        "code": "28991",
                        "name": "Производство нефтепромыслового и бурового геологоразведочного оборудования",
                        "children": []
                      },
                      {
                        "code": "28992",
                        "name": "Производство нефтегазоперерабатывающего оборудования",
                        "children": []
                      },
                      {
                        "code": "28993",
                        "name": "Производство специального технологического оборудования для электронной промышленности",
                        "children": []
                      },
                      {
                        "code": "28994",
                        "name": "Производство технологического оборудования для стекольной промышленности",
                        "children": []
                      },
                      {
                        "code": "28995",
                        "name": "Производство технологического оборудования для полиграфической промышленности",
                        "children": []
                      },
                      {
                        "code": "28996",
                        "name": "Производство каруселей, качелей, тиров и других аттракционов",
                        "children": []
                      },
                      {
                        "code": "28999",
                        "name": "Производство других машин специального назначения",
                        "children": []
                      }
                    ]
                  }
                ]
              }
            ]
          },
          {
            "code": "29",
            "name": "Производство автомобилей, прицепов и полуприцепов",
            "children": [
              {
                "code": "291",
                "name": "Производство автомобилей",
                "children": []
              },
              {
                "code": "2910",
                "name": "Производство автомобилей",
                "children": [
                  {
                    "code": "29101",
                    "name": "Производство автомобилей, кроме двигателей для автомобилей",
                    "children": []
                  },
                  {
                    "code": "29102",
                    "name": "Производство двигателей",
                    "children": []
                  }
                ]
              },
              {
                "code": "292",
                "name": "Производство кузовов для автомобилей; производство прицепов и полуприцепов",
                "children": []
              },
              {
                "code": "2920",
                "name": "Производство кузовов для автомобилей; производство прицепов и полуприцепов",
                "children": [
                  {
                    "code": "29201",
                    "name": "Производство кузовов для автомобилей",
                    "children": []
                  },
                  {
                    "code": "29202",
                    "name": "Производство прицепов и полуприцепов",
                    "children": []
                  }
                ]
              },
              {
                "code": "293",
                "name": "Производство частей и принадлежностей автомобилей",
                "children": [
                  {
                    "code": "2931",
                    "name": "Производство электрического и электронного оборудования для автомобилей",
                    "children": []
                  },
                  {
                    "code": "29310",
                    "name": "Производство электрического и электронного оборудования для автомобилей",
                    "children": []
                  },
                  {
                    "code": "2932",
                    "name": "Производство прочих частей и принадлежностей автомобилей",
                    "children": []
                  },
                  {
                    "code": "29320",
                    "name": "Производство прочих частей и принадлежностей автомобилей",
                    "children": []
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "code": "30",
        "name": "Производство прочих транспортных средств",
        "children": [
          {
            "code": "301",
            "name": "Строительство судов и лодок",
            "children": [
              {
                "code": "3011",
                "name": "Строительство судов и плавучих средств",
                "children": []
              },
              {
                "code": "30110",
                "name": "Строительство судов и плавучих средств",
                "children": []
              },
              {
                "code": "3012",
                "name": "Строительство прогулочных и спортивных лодок",
                "children": []
              },
              {
                "code": "30120",
                "name": "Строительство прогулочных и спортивных лодок",
                "children": []
              }
            ]
          },
          {
            "code": "302",
            "name": "Производство железнодорожных локомотивов и подвижного состава",
            "children": []
          },
          {
            "code": "3020",
            "name": "Производство железнодорожных локомотивов и подвижного состава",
            "children": []
          },
          {
            "code": "30200",
            "name": "Производство железнодорожных локомотивов и подвижного состава",
            "children": []
          },
          {
            "code": "303",
            "name": "Производство воздушных и космических летательных аппаратов и связанного с ними оборудования",
            "children": []
          },
          {
            "code": "3030",
            "name": "Производство воздушных и космических летательных аппаратов и связанного с ними оборудования",
            "children": [
              {
                "code": "30301",
                "name": "Производство воздушных летательных аппаратов",
                "children": []
              },
              {
                "code": "30302",
                "name": "Производство космических летательных аппаратов",
                "children": []
              }
            ]
          },
          {
            "code": "304",
            "name": "Производство военных боевых транспортных средств",
            "children": []
          },
          {
            "code": "3040",
            "name": "Производство военных боевых транспортных средств",
            "children": []
          },
          {
            "code": "30400",
            "name": "Производство военных боевых транспортных средств",
            "children": []
          },
          {
            "code": "309",
            "name": "Производство транспортных средств, не включенных в другие группировки",
            "children": [
              {
                "code": "3091",
                "name": "Производство мотоциклов",
                "children": []
              },
              {
                "code": "30910",
                "name": "Производство мотоциклов",
                "children": []
              },
              {
                "code": "3092",
                "name": "Производство велосипедов, детских колясок и кресло-колясок для лиц с инвалидностью",
                "children": [
                  {
                    "code": "30921",
                    "name": "Производство велосипедов",
                    "children": []
                  },
                  {
                    "code": "30922",
                    "name": "Производство кресло-колясок для лиц с инвалидностью",
                    "children": []
                  },
                  {
                    "code": "30923",
                    "name": "Производство детских колясок",
                    "children": []
                  }
                ]
              },
              {
                "code": "3099",
                "name": "Производство прочих транспортных средств и оборудования, не включенных в другие группировки",
                "children": []
              },
              {
                "code": "30990",
                "name": "Производство прочих транспортных средств и оборудования, не включенных в другие группировки",
                "children": []
              }
            ]
          },
          {
            "code": "31",
            "name": "Производство мебели",
            "children": []
          },
          {
            "code": "32",
            "name": "Производство прочих готовых изделий",
            "children": [
              {
                "code": "321",
                "name": "Производство ювелирных изделий, бижутерии и аналогичных изделий",
                "children": [
                  {
                    "code": "3211",
                    "name": "Чеканка/выпуск монет и медалей",
                    "children": []
                  },
                  {
                    "code": "32110",
                    "name": "Чеканка/выпуск монет и медалей",
                    "children": []
                  },
                  {
                    "code": "3212",
                    "name": "Производство ювелирных и аналогичных изделий",
                    "children": []
                  },
                  {
                    "code": "32120",
                    "name": "Производство ювелирных и аналогичных изделий",
                    "children": []
                  },
                  {
                    "code": "3213",
                    "name": "Производство бижутерии и аналогичных изделий",
                    "children": []
                  },
                  {
                    "code": "32130",
                    "name": "Производство бижутерии и аналогичных изделий",
                    "children": []
                  }
                ]
              },
              {
                "code": "322",
                "name": "Производство музыкальных инструментов",
                "children": []
              },
              {
                "code": "3220",
                "name": "Производство музыкальных инструментов",
                "children": []
              },
              {
                "code": "32200",
                "name": "Производство музыкальных инструментов",
                "children": []
              },
              {
                "code": "323",
                "name": "Производство спортивных товаров",
                "children": []
              },
              {
                "code": "3230",
                "name": "Производство спортивных товаров",
                "children": []
              },
              {
                "code": "32300",
                "name": "Производство спортивных товаров",
                "children": []
              },
              {
                "code": "324",
                "name": "Производство игр и игрушек",
                "children": []
              },
              {
                "code": "3240",
                "name": "Производство игр и игрушек",
                "children": []
              },
              {
                "code": "32400",
                "name": "Производство игр и игрушек",
                "children": []
              },
              {
                "code": "325",
                "name": "Производство медицинских и стоматологических инструментов и принадлежностей",
                "children": []
              },
              {
                "code": "3250",
                "name": "Производство медицинских и стоматологических инструментов и принадлежностей",
                "children": [
                  {
                    "code": "32501",
                    "name": "Производство цементов, используемых в медицине",
                    "children": []
                  },
                  {
                    "code": "32502",
                    "name": "Производство медицинских и ветеринарных инструментов, аппаратов и оборудования",
                    "children": []
                  },
                  {
                    "code": "32503",
                    "name": "Производство хирургических и ортопедических приспособлений",
                    "children": []
                  },
                  {
                    "code": "32504",
                    "name": "Производство медицинской, хирургической, стоматологической и ветеринарной мебели",
                    "children": []
                  }
                ]
              },
              {
                "code": "329",
                "name": "Производство прочих готовых изделий, не включенных в другие группировки",
                "children": [
                  {
                    "code": "3291",
                    "name": "Производство метел и щеток",
                    "children": []
                  },
                  {
                    "code": "32910",
                    "name": "Производство метел и щеток",
                    "children": []
                  },
                  {
                    "code": "3299",
                    "name": "Производство прочей продукции, не включенной в другие группировки",
                    "children": [
                      {
                        "code": "32991",
                        "name": "Производство канцелярских изделий",
                        "children": []
                      },
                      {
                        "code": "32992",
                        "name": "Производство изделий металлической галантереи",
                        "children": []
                      },
                      {
                        "code": "32993",
                        "name": "Производство сувенирных изделий",
                        "children": []
                      },
                      {
                        "code": "32999",
                        "name": "Производство прочих изделий",
                        "children": []
                      }
                    ]
                  }
                ]
              }
            ]
          },
          {
            "code": "33",
            "name": "Ремонт и установка машин и оборудования",
            "children": [
              {
                "code": "331",
                "name": "Ремонт готовых металлических изделий, машин и оборудования",
                "children": [
                  {
                    "code": "3311",
                    "name": "Ремонт готовых металлических изделий",
                    "children": [
                      {
                        "code": "33111",
                        "name": "Ремонт металлических цистерн, резервуаров и контейнеров",
                        "children": []
                      },
                      {
                        "code": "33112",
                        "name": "Ремонт радиаторов и котлов центрального отопления",
                        "children": []
                      },
                      {
                        "code": "33113",
                        "name": "Ремонт паровых котлов, кроме котлов центрального отопления",
                        "children": []
                      },
                      {
                        "code": "33114",
                        "name": "Ремонт огнестрельного оружия и артиллерийских орудий",
                        "children": []
                      },
                      {
                        "code": "33119",
                        "name": "Ремонт прочих металлических изделий",
                        "children": []
                      }
                    ]
                  },
                  {
                    "code": "3312",
                    "name": "Ремонт машин и оборудования",
                    "children": [
                      {
                        "code": "33121",
                        "name": "Ремонт и техническое обслуживание механического оборудования",
                        "children": []
                      },
                      {
                        "code": "33122",
                        "name": "Ремонт и техническое обслуживание прочего оборудования общего назначения",
                        "children": []
                      },
                      {
                        "code": "33123",
                        "name": "Ремонт и техническое обслуживание машин и оборудования для сельского и лесного хозяйства",
                        "children": []
                      },
                      {
                        "code": "33124",
                        "name": "Ремонт и техническое обслуживание станков",
                        "children": []
                      },
                      {
                        "code": "33125",
                        "name": "Ремонт и техническое обслуживание прочих машин и оборудования специального назначения",
                        "children": []
                      },
                      {
                        "code": "33126",
                        "name": "Ремонт и техническое обслуживание офисных машин и вычислительной техники",
                        "children": []
                      }
                    ]
                  },
                  {
                    "code": "3313",
                    "name": "Ремонт электронного и оптического оборудования",
                    "children": [
                      {
                        "code": "33131",
                        "name": "Ремонт и техническое обслуживание инструментов и приборов для измерения, тестирования и навигации",
                        "children": []
                      },
                      {
                        "code": "33132",
                        "name": "Ремонт контрольного оборудования",
                        "children": []
                      },
                      {
                        "code": "33133",
                        "name": "Ремонт и техническое обслуживание облучающего, электромедицинского и электротерапевтического оборудования",
                        "children": []
                      },
                      {
                        "code": "33134",
                        "name": "Ремонт и техническое обслуживание оптических приборов и фотографического оборудования",
                        "children": []
                      }
                    ]
                  },
                  {
                    "code": "3314",
                    "name": "Ремонт электрического оборудования",
                    "children": [
                      {
                        "code": "33141",
                        "name": "Ремонт и техническое обслуживание электродвигателей, генераторов и трансформаторов",
                        "children": []
                      },
                      {
                        "code": "33142",
                        "name": "Ремонт и техническое обслуживание электрораспределительной и регулирующей аппаратуры",
                        "children": []
                      },
                      {
                        "code": "33143",
                        "name": "Ремонт и техническое обслуживание электроосветительного оборудования",
                        "children": []
                      },
                      {
                        "code": "33149",
                        "name": "Ремонт и техническое обслуживание прочего электрооборудования, не включенного в другие группировки",
                        "children": []
                      }
                    ]
                  },
                  {
                    "code": "3315",
                    "name": "Ремонт и техническое обслуживание судов и лодок",
                    "children": [
                      {
                        "code": "33151",
                        "name": "Ремонт и техническое обслуживание судов",
                        "children": []
                      },
                      {
                        "code": "33152",
                        "name": "Ремонт и техническое обслуживание спортивных и прогулочных лодок",
                        "children": []
                      }
                    ]
                  },
                  {
                    "code": "3316",
                    "name": "Ремонт и техническое обслуживание воздушных и космических летательных аппаратов",
                    "children": []
                  },
                  {
                    "code": "33160",
                    "name": "Ремонт и техническое обслуживание воздушных и космических летательных аппаратов",
                    "children": []
                  },
                  {
                    "code": "3317",
                    "name": "Ремонт и техническое обслуживание прочих транспортных средств и оборудования",
                    "children": [
                      {
                        "code": "33171",
                        "name": "Ремонт подвижного состава железных дорог",
                        "children": []
                      },
                      {
                        "code": "33172",
                        "name": "Ремонт трамваев, вагонов метро и троллейбусов",
                        "children": []
                      },
                      {
                        "code": "33179",
                        "name": "Ремонт прочих транспортных средств и оборудования, не включенных в другие группировки",
                        "children": []
                      }
                    ]
                  },
                  {
                    "code": "3319",
                    "name": "Ремонт прочего оборудования",
                    "children": []
                  },
                  {
                    "code": "33190",
                    "name": "Ремонт прочего оборудования",
                    "children": []
                  }
                ]
              },
              {
                "code": "332",
                "name": "Монтаж, установка промышленных машин и оборудования",
                "children": []
              },
              {
                "code": "3320",
                "name": "Монтаж, установка промышленных машин и оборудования",
                "children": []
              },
              {
                "code": "33200",
                "name": "Монтаж, установка промышленных машин и оборудования",
                "children": []
              }
            ]
          }
        ]
      },
      {
        "code": "310",
        "name": "Производство мебели",
        "children": [
          {
            "code": "3101",
            "name": "Производство мебели для офисов и предприятий торговли",
            "children": [
              {
                "code": "31011",
                "name": "Производство стульев и другой мебели для сидения",
                "children": []
              },
              {
                "code": "31012",
                "name": "Производство мебели для офисов и предприятий торговли, кроме стульев и другой мебели для сидения",
                "children": []
              }
            ]
          },
          {
            "code": "3102",
            "name": "Производство кухонной мебели",
            "children": []
          },
          {
            "code": "31020",
            "name": "Производство кухонной мебели",
            "children": []
          },
          {
            "code": "3103",
            "name": "Производство матрасов",
            "children": []
          },
          {
            "code": "31030",
            "name": "Производство матрасов",
            "children": []
          },
          {
            "code": "3109",
            "name": "Производство прочей мебели",
            "children": []
          },
          {
            "code": "31090",
            "name": "Производство прочей мебели",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "code": "D",
    "name": "Снабжение электроэнергией, газом, паром, горячей водой и кондиционированным воздухом",
    "children": [
      {
        "code": "35",
        "name": "Снабжение электроэнергией, газом, паром, горячей водой и кондиционированным воздухом",
        "children": [
          {
            "code": "351",
            "name": "Производство, передача и распределение электроэнергии",
            "children": [
              {
                "code": "3511",
                "name": "Производство электроэнергии",
                "children": [
                  {
                    "code": "35111",
                    "name": "Производство электроэнергии тепловыми электростанциями",
                    "children": []
                  },
                  {
                    "code": "35112",
                    "name": "Производство электроэнергии гидроэлектростанциями",
                    "children": []
                  },
                  {
                    "code": "35113",
                    "name": "Производство электроэнергии ядерными (атомными) электростанциями",
                    "children": []
                  },
                  {
                    "code": "35114",
                    "name": "Производство электроэнергии ветровыми электростанциями",
                    "children": []
                  },
                  {
                    "code": "35115",
                    "name": "Производство электроэнергии солнечными электростанциями",
                    "children": []
                  },
                  {
                    "code": "35119",
                    "name": "Производство электроэнергии прочими электростанциями",
                    "children": []
                  }
                ]
              },
              {
                "code": "3512",
                "name": "Передача электроэнергии",
                "children": [
                  {
                    "code": "35121",
                    "name": "Передача электроэнергии",
                    "children": []
                  },
                  {
                    "code": "35122",
                    "name": "Техническая диспетчеризация отпуска в сеть и потребления электрической энергии, организация балансирования производства-потребления электрической энергии",
                    "children": []
                  },
                  {
                    "code": "35123",
                    "name": "Эксплуатационное обслуживание оборудования Национальной электрической сети",
                    "children": []
                  },
                  {
                    "code": "35124",
                    "name": "Обеспечение готовности электрической мощности к несению нагрузки, регулирование и резервирование электрической мощности",
                    "children": []
                  }
                ]
              },
              {
                "code": "3513",
                "name": "Распределение электроэнергии",
                "children": []
              },
              {
                "code": "35130",
                "name": "Распределение электроэнергии",
                "children": []
              },
              {
                "code": "3514",
                "name": "Продажа электроэнергии",
                "children": []
              },
              {
                "code": "35140",
                "name": "Продажа электроэнергии",
                "children": []
              }
            ]
          },
          {
            "code": "352",
            "name": "Производство и распределение газообразного топлива по трубопроводам",
            "children": [
              {
                "code": "3521",
                "name": "Производство газообразного топлива",
                "children": []
              },
              {
                "code": "35210",
                "name": "Производство газообразного топлива",
                "children": []
              },
              {
                "code": "3522",
                "name": "Распределение газообразного топлива по трубопроводам",
                "children": []
              },
              {
                "code": "35220",
                "name": "Распределение газообразного топлива по трубопроводам",
                "children": []
              },
              {
                "code": "3523",
                "name": "Продажа газообразного топлива по трубопроводам",
                "children": []
              },
              {
                "code": "35230",
                "name": "Продажа газообразного топлива по трубопроводам",
                "children": []
              }
            ]
          },
          {
            "code": "353",
            "name": "Снабжение паром, горячей водой и кондиционированным воздухом",
            "children": []
          },
          {
            "code": "3530",
            "name": "Снабжение паром, горячей водой и кондиционированным воздухом",
            "children": [
              {
                "code": "35302",
                "name": "Производство тепловой энергии самостоятельными котельными",
                "children": []
              },
              {
                "code": "35303",
                "name": "Передача и распределение тепловой энергии",
                "children": []
              },
              {
                "code": "35304",
                "name": "Кондиционирование воздуха",
                "children": []
              },
              {
                "code": "35305",
                "name": "Производство тепловой энергии тепловыми электростанциями (включая ТЭЦ)",
                "children": []
              },
              {
                "code": "35307",
                "name": "Продажа тепловой энергии",
                "children": []
              },
              {
                "code": "35308",
                "name": "Производство тепловой энергии возобновляемыми и альтернативными источниками энергии",
                "children": []
              }
            ]
          }
        ]
      }
    ]
  },
  {
    "code": "E",
    "name": "Водоснабжение; водоотведение; сбор, обработка и удаление отходов, деятельность по ликвидации загрязнений",
    "children": [
      {
        "code": "36",
        "name": "Забор, обработка и распределение воды",
        "children": []
      },
      {
        "code": "360",
        "name": "Забор, обработка и распределение воды",
        "children": []
      },
      {
        "code": "3600",
        "name": "Забор, обработка и распределение воды",
        "children": []
      },
      {
        "code": "36000",
        "name": "Забор, обработка и распределение воды",
        "children": []
      },
      {
        "code": "37",
        "name": "Сбор и обработка сточных вод",
        "children": []
      },
      {
        "code": "370",
        "name": "Сбор и обработка сточных вод",
        "children": []
      },
      {
        "code": "3700",
        "name": "Сбор и обработка сточных вод",
        "children": [
          {
            "code": "37001",
            "name": "Эксплуатация сетей и сооружений систем водоотведения (канализации)",
            "children": []
          },
          {
            "code": "37002",
            "name": "Ассенизаторская деятельность",
            "children": []
          }
        ]
      },
      {
        "code": "38",
        "name": "Сбор, обработка и удаление отходов; утилизация (восстановление) материалов",
        "children": [
          {
            "code": "381",
            "name": "Сбор отходов",
            "children": [
              {
                "code": "3811",
                "name": "Сбор неопасных отходов",
                "children": []
              },
              {
                "code": "38110",
                "name": "Сбор неопасных отходов",
                "children": []
              },
              {
                "code": "3812",
                "name": "Сбор опасных отходов",
                "children": []
              },
              {
                "code": "38120",
                "name": "Сбор опасных отходов",
                "children": []
              }
            ]
          },
          {
            "code": "382",
            "name": "Обработка и удаление отходов",
            "children": [
              {
                "code": "3821",
                "name": "Обработка и удаление неопасных отходов",
                "children": []
              },
              {
                "code": "38210",
                "name": "Обработка и удаление неопасных отходов",
                "children": []
              },
              {
                "code": "3822",
                "name": "Обработка и удаление опасных отходов",
                "children": []
              },
              {
                "code": "38220",
                "name": "Обработка и удаление опасных отходов",
                "children": []
              }
            ]
          },
          {
            "code": "383",
            "name": "Утилизация (восстановление) материалов",
            "children": [
              {
                "code": "3831",
                "name": "Разборка машин и оборудования, не подлежащих восстановлению",
                "children": []
              },
              {
                "code": "38310",
                "name": "Разборка машин и оборудования, не подлежащих восстановлению",
                "children": []
              },
              {
                "code": "3832",
                "name": "Переработка отсортированных материалов",
                "children": [
                  {
                    "code": "38321",
                    "name": "Переработка отходов и лома черных металлов",
                    "children": []
                  },
                  {
                    "code": "38322",
                    "name": "Переработка отходов и лома цветных металлов",
                    "children": []
                  },
                  {
                    "code": "38323",
                    "name": "Переработка неметаллических отходов",
                    "children": []
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "code": "39",
        "name": "Деятельность по ликвидации загрязнений и прочие услуги в области удаления отходов",
        "children": []
      },
      {
        "code": "390",
        "name": "Деятельность по ликвидации загрязнений и прочие услуги в области удаления отходов",
        "children": []
      },
      {
        "code": "3900",
        "name": "Деятельность по ликвидации загрязнений и прочие услуги в области удаления отходов",
        "children": []
      },
      {
        "code": "39000",
        "name": "Деятельность по ликвидации загрязнений и прочие услуги в области удаления отходов",
        "children": []
      }
    ]
  },
  {
    "code": "F",
    "name": "Строительство",
    "children": [
      {
        "code": "41",
        "name": "Строительство зданий",
        "children": [
          {
            "code": "411",
            "name": "Разработка строительных проектов",
            "children": []
          },
          {
            "code": "4110",
            "name": "Разработка строительных проектов",
            "children": []
          },
          {
            "code": "41100",
            "name": "Разработка строительных проектов",
            "children": []
          },
          {
            "code": "412",
            "name": "Строительство жилых и нежилых зданий",
            "children": []
          },
          {
            "code": "4120",
            "name": "Строительство жилых и нежилых зданий",
            "children": [
              {
                "code": "41201",
                "name": "Строительство жилых зданий",
                "children": []
              },
              {
                "code": "41202",
                "name": "Строительство нежилых зданий, за исключением стационарных торговых объектов категорий 1, 2",
                "children": []
              },
              {
                "code": "41203",
                "name": "Строительство стационарных торговых объектов категории 1",
                "children": []
              },
              {
                "code": "41204",
                "name": "Строительство стационарных торговых объектов категории 2",
                "children": []
              }
            ]
          }
        ]
      },
      {
        "code": "42",
        "name": "Гражданское строительство",
        "children": [
          {
            "code": "421",
            "name": "Строительство автомобильных и железных дорог",
            "children": [
              {
                "code": "4211",
                "name": "Строительство автомобильных дорог",
                "children": [
                  {
                    "code": "42111",
                    "name": "Строительство дорог и автомагистралей",
                    "children": []
                  },
                  {
                    "code": "42112",
                    "name": "Деятельность по организации строительства, реконструкции, ремонта, платного движения и содержания автомобильных дорог (участков) общего пользования международного и республиканского значения",
                    "children": []
                  }
                ]
              },
              {
                "code": "4212",
                "name": "Строительство железных дорог и метро",
                "children": []
              },
              {
                "code": "42120",
                "name": "Строительство железных дорог и метро",
                "children": []
              },
              {
                "code": "4213",
                "name": "Строительство мостов и туннелей",
                "children": []
              },
              {
                "code": "42130",
                "name": "Строительство мостов и туннелей",
                "children": []
              }
            ]
          },
          {
            "code": "422",
            "name": "Строительство распределительных инженерных сооружений",
            "children": [
              {
                "code": "4221",
                "name": "Строительство трубопроводов",
                "children": [
                  {
                    "code": "42211",
                    "name": "Строительство нефтяных и газовых магистральных трубопроводов",
                    "children": []
                  },
                  {
                    "code": "42212",
                    "name": "Строительство трубопроводов для систем водоснабжения и канализации",
                    "children": []
                  },
                  {
                    "code": "42219",
                    "name": "Строительство прочих трубопроводов",
                    "children": []
                  }
                ]
              },
              {
                "code": "4222",
                "name": "Строительство линий электропередач и телекоммуникаций",
                "children": []
              },
              {
                "code": "42220",
                "name": "Строительство линий электропередач и телекоммуникаций",
                "children": []
              }
            ]
          },
          {
            "code": "429",
            "name": "Строительство прочих инженерных сооружений",
            "children": [
              {
                "code": "4291",
                "name": "Строительство водных сооружений",
                "children": []
              },
              {
                "code": "42910",
                "name": "Строительство водных сооружений",
                "children": []
              },
              {
                "code": "4299",
                "name": "Строительство прочих инженерных сооружений, не включенных в другие группировки",
                "children": []
              },
              {
                "code": "42990",
                "name": "Строительство прочих инженерных сооружений, не включенных в другие группировки",
                "children": []
              }
            ]
          }
        ]
      },
      {
        "code": "43",
        "name": "Специализированные строительные работы",
        "children": [
          {
            "code": "431",
            "name": "Снос зданий и сооружений, подготовка строительного участка",
            "children": [
              {
                "code": "4311",
                "name": "Разборка и снос зданий и сооружений",
                "children": []
              },
              {
                "code": "43110",
                "name": "Разборка и снос зданий и сооружений",
                "children": []
              },
              {
                "code": "4312",
                "name": "Подготовка строительного участка",
                "children": [
                  {
                    "code": "43121",
                    "name": "Земляные работы",
                    "children": []
                  },
                  {
                    "code": "43122",
                    "name": "Взрывные работы",
                    "children": []
                  },
                  {
                    "code": "43123",
                    "name": "Специальные работы в грунтах",
                    "children": []
                  }
                ]
              },
              {
                "code": "4313",
                "name": "Разведочное бурение",
                "children": []
              },
              {
                "code": "43130",
                "name": "Разведочное бурение",
                "children": []
              }
            ]
          },
          {
            "code": "432",
            "name": "Монтаж и установка электрического, водопроводного и прочего оборудования",
            "children": [
              {
                "code": "4321",
                "name": "Электромонтажные работы",
                "children": [
                  {
                    "code": "43211",
                    "name": "Электромонтажные работы по прокладке телекоммуникационных, компьютерных и телевизионных сетей",
                    "children": []
                  },
                  {
                    "code": "43219",
                    "name": "Прочие электромонтажные работы",
                    "children": []
                  }
                ]
              },
              {
                "code": "4322",
                "name": "Монтаж систем водоснабжения, отопления и кондиционирования воздуха",
                "children": []
              },
              {
                "code": "43220",
                "name": "Монтаж систем водоснабжения, отопления и кондиционирования воздуха",
                "children": []
              },
              {
                "code": "4329",
                "name": "Прочие строительно-монтажные работы",
                "children": [
                  {
                    "code": "43291",
                    "name": "Изоляционные работы",
                    "children": []
                  },
                  {
                    "code": "43298",
                    "name": "Прочие строительно-монтажные работы, не включенные в другие группировки",
                    "children": []
                  },
                  {
                    "code": "43299",
                    "name": "Пуск и наладка смонтированного оборудования",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "code": "433",
            "name": "Отделочные работы",
            "children": [
              {
                "code": "4331",
                "name": "Штукатурные работы",
                "children": []
              },
              {
                "code": "43310",
                "name": "Штукатурные работы",
                "children": []
              },
              {
                "code": "4332",
                "name": "Столярные и плотницкие работы",
                "children": []
              },
              {
                "code": "43320",
                "name": "Столярные и плотницкие работы",
                "children": []
              },
              {
                "code": "4333",
                "name": "Покрытие полов и облицовка стен",
                "children": []
              },
              {
                "code": "43330",
                "name": "Покрытие полов и облицовка стен",
                "children": []
              },
              {
                "code": "4334",
                "name": "Малярные и стекольные работы",
                "children": []
              },
              {
                "code": "43340",
                "name": "Малярные и стекольные работы",
                "children": []
              },
              {
                "code": "4339",
                "name": "Прочие отделочные работы",
                "children": []
              },
              {
                "code": "43390",
                "name": "Прочие отделочные работы",
                "children": []
              }
            ]
          },
          {
            "code": "439",
            "name": "Прочие специализированные строительные работы",
            "children": [
              {
                "code": "4391",
                "name": "Кровельные работы",
                "children": []
              },
              {
                "code": "43910",
                "name": "Кровельные работы",
                "children": []
              },
              {
                "code": "4399",
                "name": "Прочие специализированные строительные работы, не включенные в другие группировки",
                "children": [
                  {
                    "code": "43991",
                    "name": "Строительство шахт",
                    "children": []
                  },
                  {
                    "code": "43992",
                    "name": "Гидроизоляционные работы",
                    "children": []
                  },
                  {
                    "code": "43993",
                    "name": "Аренда строительного оборудования с оператором",
                    "children": []
                  },
                  {
                    "code": "43999",
                    "name": "Прочие строительные работы, требующие специальной квалификации",
                    "children": []
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  },
  {
    "code": "G",
    "name": "Оптовая и розничная торговля; ремонт автомобилей и мотоциклов",
    "children": [
      {
        "code": "45",
        "name": "Оптовая и розничная торговля автомобилями и мотоциклами и их ремонт",
        "children": [
          {
            "code": "451",
            "name": "Торговля автомобилями",
            "children": [
              {
                "code": "4511",
                "name": "Торговля автомобилями и легкими автотранспортными средствами",
                "children": [
                  {
                    "code": "45111",
                    "name": "Оптовая торговля автомобилями и легкими автотранспортными средствами",
                    "children": []
                  },
                  {
                    "code": "45112",
                    "name": "Розничная торговля автомобилями и легкими автотранспортными средствами в торговых объектах с торговой площадью менее 2000 кв.м",
                    "children": []
                  },
                  {
                    "code": "45113",
                    "name": "Розничная торговля автомобилями и легкими автотранспортными средствами в торговых объектах с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": []
                  }
                ]
              },
              {
                "code": "4519",
                "name": "Торговля прочими автотранспортными средствами",
                "children": [
                  {
                    "code": "45191",
                    "name": "Оптовая торговля прочими автотранспортными средствами",
                    "children": []
                  },
                  {
                    "code": "45192",
                    "name": "Розничная торговля прочими автотранспортными средствами в торговых объектах с торговой площадью менее 2000 кв.м",
                    "children": []
                  },
                  {
                    "code": "45193",
                    "name": "Розничная торговля прочими автотранспортными средствами в торговых объектах с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "code": "452",
            "name": "Техническое обслуживание и ремонт автомобилей",
            "children": []
          },
          {
            "code": "4520",
            "name": "Техническое обслуживание и ремонт автомобилей",
            "children": [
              {
                "code": "45201",
                "name": "Техническое обслуживание и ремонт автомобилей, за исключением произведенных станциями технического обслуживания, находящимися на придорожной полосе",
                "children": []
              },
              {
                "code": "45202",
                "name": "Техническое обслуживание и ремонт автомобилей станциями технического обслуживания, находящимися на придорожной полосе",
                "children": []
              },
              {
                "code": "45203",
                "name": "Деятельность по зарядке аккумуляторных батарей транспортных средств с электродвигателями",
                "children": []
              }
            ]
          },
          {
            "code": "453",
            "name": "Торговля автомобильными деталями, узлами и принадлежностями",
            "children": [
              {
                "code": "4531",
                "name": "Оптовая торговля автомобильными деталями, узлами и принадлежностями",
                "children": []
              },
              {
                "code": "45310",
                "name": "Оптовая торговля автомобильными деталями, узлами и принадлежностями",
                "children": []
              },
              {
                "code": "4532",
                "name": "Розничная торговля автомобильными деталями, узлами и принадлежностями",
                "children": [
                  {
                    "code": "45321",
                    "name": "Розничная торговля автомобильными деталями, узлами и принадлежностями в торговых объектах с торговой площадью менее 2000 кв.м",
                    "children": []
                  },
                  {
                    "code": "45322",
                    "name": "Розничная торговля автомобильными деталями, узлами и принадлежностями в торговых объектах с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "code": "454",
            "name": "Торговля мотоциклами, их деталями, узлами и принадлежностями; техническое обслуживание и ремонт мотоциклов",
            "children": []
          },
          {
            "code": "4540",
            "name": "Торговля мотоциклами, их деталями, узлами и принадлежностями; техническое обслуживание и ремонт мотоциклов",
            "children": [
              {
                "code": "45401",
                "name": "Оптовая торговля мотоциклами, мотороллерами, деталями и принадлежностями к ним",
                "children": []
              },
              {
                "code": "45402",
                "name": "Розничная торговля мотоциклами, мотороллерами, деталями и принадлежностями к ним",
                "children": []
              },
              {
                "code": "45403",
                "name": "Техническое обслуживание и ремонт мотоциклов и мотороллеров",
                "children": []
              }
            ]
          }
        ]
      },
      {
        "code": "46",
        "name": "Оптовая торговля, за исключением торговли автомобилями и мотоциклами",
        "children": [
          {
            "code": "461",
            "name": "Оптовая торговля за вознаграждение или на договорной основе",
            "children": [
              {
                "code": "4611",
                "name": "Деятельность агентов по оптовой торговле сельскохозяйственным сырьем, живыми животными, текстильным сырьем и полуфабрикатами",
                "children": []
              },
              {
                "code": "46110",
                "name": "Деятельность агентов по оптовой торговле сельскохозяйственным сырьем, живыми животными, текстильным сырьем и полуфабрикатами",
                "children": []
              },
              {
                "code": "4612",
                "name": "Деятельность агентов по оптовой торговле топливом, рудами, металлами и химическими веществами",
                "children": []
              },
              {
                "code": "46120",
                "name": "Деятельность агентов по оптовой торговле топливом, рудами, металлами и химическими веществами",
                "children": []
              },
              {
                "code": "4613",
                "name": "Деятельность агентов по оптовой торговле древесиной и строительными материалами",
                "children": []
              },
              {
                "code": "46130",
                "name": "Деятельность агентов по оптовой торговле древесиной и строительными материалами",
                "children": []
              },
              {
                "code": "4614",
                "name": "Деятельность агентов по оптовой торговле машинами, оборудованием, судами и летательными аппаратами",
                "children": []
              },
              {
                "code": "46140",
                "name": "Деятельность агентов по оптовой торговле машинами, оборудованием, судами и летательными аппаратами",
                "children": []
              },
              {
                "code": "4615",
                "name": "Деятельность агентов по оптовой торговле мебелью, бытовыми товарами, скобяными и прочими металлическими изделиями",
                "children": []
              },
              {
                "code": "46150",
                "name": "Деятельность агентов по оптовой торговле мебелью, бытовыми товарами, скобяными и прочими металлическими изделиями",
                "children": []
              },
              {
                "code": "4616",
                "name": "Деятельность агентов по оптовой торговле текстильными изделиями, одеждой, обувью, изделиями из кожи и меха",
                "children": []
              },
              {
                "code": "46160",
                "name": "Деятельность агентов по оптовой торговле текстильными изделиями, одеждой, обувью, изделиями из кожи и меха",
                "children": []
              },
              {
                "code": "4617",
                "name": "Деятельность агентов по оптовой торговле пищевыми продуктами, напитками и табачными изделиями",
                "children": []
              },
              {
                "code": "46170",
                "name": "Деятельность агентов по оптовой торговле пищевыми продуктами, напитками и табачными изделиями",
                "children": []
              },
              {
                "code": "4618",
                "name": "Деятельность агентов, специализирующихся на оптовой торговле отдельными видами товаров или группами товаров, не включенными в другие группировки",
                "children": []
              },
              {
                "code": "46180",
                "name": "Деятельность агентов, специализирующихся на оптовой торговле отдельными видами товаров или группами товаров, не включенными в другие группировки",
                "children": []
              },
              {
                "code": "4619",
                "name": "Деятельность агентов по оптовой торговле товарами широкого ассортимента",
                "children": []
              },
              {
                "code": "46190",
                "name": "Деятельность агентов по оптовой торговле товарами широкого ассортимента",
                "children": []
              }
            ]
          },
          {
            "code": "462",
            "name": "Оптовая торговля сельскохозяйственным сырьем и живыми животными",
            "children": [
              {
                "code": "4621",
                "name": "Оптовая торговля зерном, необработанным табаком, семенами и кормами для животных",
                "children": [
                  {
                    "code": "46211",
                    "name": "Оптовая торговля зерном, семенами и кормами для животных",
                    "children": []
                  },
                  {
                    "code": "46212",
                    "name": "Оптовая торговля необработанным табаком",
                    "children": []
                  },
                  {
                    "code": "46213",
                    "name": "Оптовая торговля масличными культурами",
                    "children": []
                  }
                ]
              },
              {
                "code": "4622",
                "name": "Оптовая торговля цветами и другими растениями",
                "children": []
              },
              {
                "code": "46220",
                "name": "Оптовая торговля цветами и другими растениями",
                "children": []
              },
              {
                "code": "4623",
                "name": "Оптовая торговля живыми животными",
                "children": []
              },
              {
                "code": "46230",
                "name": "Оптовая торговля живыми животными",
                "children": []
              },
              {
                "code": "4624",
                "name": "Оптовая торговля шкурами и кожей",
                "children": []
              },
              {
                "code": "46240",
                "name": "Оптовая торговля шкурами и кожей",
                "children": []
              }
            ]
          },
          {
            "code": "463",
            "name": "Оптовая торговля продуктами питания, напитками и табачными изделиями",
            "children": [
              {
                "code": "4631",
                "name": "Оптовая торговля фруктами и овощами",
                "children": []
              },
              {
                "code": "46310",
                "name": "Оптовая торговля фруктами и овощами",
                "children": []
              },
              {
                "code": "4632",
                "name": "Оптовая торговля мясом и мясными продуктами",
                "children": []
              },
              {
                "code": "46320",
                "name": "Оптовая торговля мясом и мясными продуктами",
                "children": []
              },
              {
                "code": "4633",
                "name": "Оптовая торговля молочными продуктами, яйцами и пищевыми маслами и жирами",
                "children": []
              },
              {
                "code": "46330",
                "name": "Оптовая торговля молочными продуктами, яйцами и пищевыми маслами и жирами",
                "children": []
              },
              {
                "code": "4634",
                "name": "Оптовая торговля напитками",
                "children": [
                  {
                    "code": "46341",
                    "name": "Оптовая торговля напитками в магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": []
                  },
                  {
                    "code": "46342",
                    "name": "Оптовая торговля напитками в магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше), включая оптово-продовольственные распределительные центры",
                    "children": []
                  }
                ]
              },
              {
                "code": "4635",
                "name": "Оптовая торговля табачными изделиями",
                "children": []
              },
              {
                "code": "46350",
                "name": "Оптовая торговля табачными изделиями",
                "children": []
              },
              {
                "code": "4636",
                "name": "Оптовая торговля сахаром, шоколадом и сахаристыми кондитерскими изделиями",
                "children": []
              },
              {
                "code": "46360",
                "name": "Оптовая торговля сахаром, шоколадом и сахаристыми кондитерскими изделиями",
                "children": []
              },
              {
                "code": "4637",
                "name": "Оптовая торговля кофе, чаем, какао и специями",
                "children": []
              },
              {
                "code": "46370",
                "name": "Оптовая торговля кофе, чаем, какао и специями",
                "children": []
              },
              {
                "code": "4638",
                "name": "Оптовая торговля прочими продуктами питания, включая рыбу, ракообразных и моллюсков",
                "children": [
                  {
                    "code": "46381",
                    "name": "Оптовая торговля рыбой и рыбными продуктами",
                    "children": []
                  },
                  {
                    "code": "46389",
                    "name": "Оптовая торговля прочими продуктами питания",
                    "children": []
                  }
                ]
              },
              {
                "code": "4639",
                "name": "Неспециализированная оптовая торговля продуктами питания, напитками и табачными изделиями",
                "children": []
              },
              {
                "code": "46390",
                "name": "Неспециализированная оптовая торговля продуктами питания, напитками и табачными изделиями",
                "children": []
              }
            ]
          },
          {
            "code": "464",
            "name": "Оптовая торговля непродовольственными товарами потребительского назначения",
            "children": [
              {
                "code": "4641",
                "name": "Оптовая торговля текстильными изделиями",
                "children": []
              },
              {
                "code": "46410",
                "name": "Оптовая торговля текстильными изделиями",
                "children": []
              },
              {
                "code": "4642",
                "name": "Оптовая торговля одеждой и обувью",
                "children": [
                  {
                    "code": "46421",
                    "name": "Оптовая торговля трикотажными и чулочно-носочными изделиями",
                    "children": []
                  },
                  {
                    "code": "46422",
                    "name": "Оптовая торговля одеждой, кроме трикотажных и чулочно-носочных изделий",
                    "children": []
                  },
                  {
                    "code": "46423",
                    "name": "Оптовая торговля обувью",
                    "children": []
                  }
                ]
              },
              {
                "code": "4643",
                "name": "Оптовая торговля бытовыми электротоварами, радио- и телевизионным оборудованием",
                "children": [
                  {
                    "code": "46431",
                    "name": "Оптовая торговля бытовыми электротоварами",
                    "children": []
                  },
                  {
                    "code": "46432",
                    "name": "Оптовая торговля радио- и телевизионным оборудованием",
                    "children": []
                  }
                ]
              },
              {
                "code": "4644",
                "name": "Оптовая торговля изделиями из керамики и стекла, чистящими средствами",
                "children": []
              },
              {
                "code": "46440",
                "name": "Оптовая торговля изделиями из керамики и стекла, чистящими средствами",
                "children": []
              },
              {
                "code": "4645",
                "name": "Оптовая торговля парфюмерными и косметическими средствами",
                "children": []
              },
              {
                "code": "46450",
                "name": "Оптовая торговля парфюмерными и косметическими средствами",
                "children": []
              },
              {
                "code": "4646",
                "name": "Оптовая торговля фармацевтическими товарами",
                "children": [
                  {
                    "code": "46461",
                    "name": "Оптовая торговля фармацевтическими товарами, кроме торговли медицинской техникой и ортопедическими изделиями",
                    "children": []
                  },
                  {
                    "code": "46462",
                    "name": "Оптовая реализация фармацевтических и медицинских товаров в рамках гарантированного объема бесплатной медицинской помощи",
                    "children": []
                  },
                  {
                    "code": "46463",
                    "name": "Оптовая торговля медицинской техникой и ортопедическими изделиями",
                    "children": []
                  }
                ]
              },
              {
                "code": "4647",
                "name": "Оптовая торговля мебелью, коврами и осветительным оборудованием",
                "children": []
              },
              {
                "code": "46470",
                "name": "Оптовая торговля мебелью, коврами и осветительным оборудованием",
                "children": []
              },
              {
                "code": "4648",
                "name": "Оптовая торговля часами и ювелирными изделиями",
                "children": []
              },
              {
                "code": "46480",
                "name": "Оптовая торговля часами и ювелирными изделиями",
                "children": []
              },
              {
                "code": "4649",
                "name": "Оптовая торговля прочими непродовольственными товарами потребительского назначения",
                "children": [
                  {
                    "code": "46491",
                    "name": "Оптовая торговля канцелярскими принадлежностями",
                    "children": []
                  },
                  {
                    "code": "46492",
                    "name": "Оптовая торговля музыкальными инструментами",
                    "children": []
                  },
                  {
                    "code": "46499",
                    "name": "Оптовая торговля прочими непродовольственными товарами потребительского назначения, не включенными в другие группировки",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "code": "465",
            "name": "Оптовая торговля компьютерами и коммуникационным оборудованием",
            "children": [
              {
                "code": "4651",
                "name": "Оптовая торговля компьютерами, периферийным компьютерным оборудованием и программным обеспечением",
                "children": []
              },
              {
                "code": "46510",
                "name": "Оптовая торговля компьютерами, периферийным компьютерным оборудованием и программным обеспечением",
                "children": []
              },
              {
                "code": "4652",
                "name": "Оптовая торговля электронным и телекоммуникационным оборудованием и их частями",
                "children": []
              },
              {
                "code": "46520",
                "name": "Оптовая торговля электронным и телекоммуникационным оборудованием и их частями",
                "children": []
              }
            ]
          },
          {
            "code": "466",
            "name": "Оптовая торговля прочими машинами, оборудованием и деталями и принадлежностями к ним",
            "children": [
              {
                "code": "4661",
                "name": "Оптовая торговля сельскохозяйственной техникой, оборудованием, деталями и принадлежностями к ним",
                "children": []
              },
              {
                "code": "46610",
                "name": "Оптовая торговля сельскохозяйственной техникой, оборудованием, деталями и принадлежностями к ним",
                "children": []
              },
              {
                "code": "4662",
                "name": "Оптовая торговля станками",
                "children": []
              },
              {
                "code": "46620",
                "name": "Оптовая торговля станками",
                "children": []
              },
              {
                "code": "4663",
                "name": "Оптовая торговля машинами и оборудованием для горнодобывающей промышленности и строительства",
                "children": []
              },
              {
                "code": "46630",
                "name": "Оптовая торговля машинами и оборудованием для горнодобывающей промышленности и строительства",
                "children": []
              },
              {
                "code": "4664",
                "name": "Оптовая торговля машинами и оборудованием для текстильной промышленности и швейными и вязальными машинами",
                "children": []
              },
              {
                "code": "46640",
                "name": "Оптовая торговля машинами и оборудованием для текстильной промышленности и швейными и вязальными машинами",
                "children": []
              },
              {
                "code": "4665",
                "name": "Оптовая торговля офисной мебелью",
                "children": []
              },
              {
                "code": "46650",
                "name": "Оптовая торговля офисной мебелью",
                "children": []
              },
              {
                "code": "4666",
                "name": "Оптовая торговля прочими офисными машинами и оборудованием",
                "children": []
              },
              {
                "code": "46660",
                "name": "Оптовая торговля прочими офисными машинами и оборудованием",
                "children": []
              },
              {
                "code": "4669",
                "name": "Оптовая торговля прочими машинами и оборудованием",
                "children": []
              },
              {
                "code": "46690",
                "name": "Оптовая торговля прочими машинами и оборудованием",
                "children": []
              }
            ]
          },
          {
            "code": "467",
            "name": "Прочая специализированная оптовая торговля",
            "children": [
              {
                "code": "4671",
                "name": "Оптовая торговля твердым, жидким и газообразным топливом и подобными продуктами",
                "children": [
                  {
                    "code": "46711",
                    "name": "Оптовая торговля сырой нефтью и попутным газом",
                    "children": []
                  },
                  {
                    "code": "46712",
                    "name": "Оптовая торговля природным (горючим) газом",
                    "children": []
                  },
                  {
                    "code": "46713",
                    "name": "Оптовая торговля каменным углем",
                    "children": []
                  },
                  {
                    "code": "46714",
                    "name": "Оптовая торговля лигнитом (бурым углем)",
                    "children": []
                  },
                  {
                    "code": "46715",
                    "name": "Оптовая торговля авиационным бензином и керосином",
                    "children": []
                  },
                  {
                    "code": "46716",
                    "name": "Оптовая торговля автомобильным бензином",
                    "children": []
                  },
                  {
                    "code": "46717",
                    "name": "Оптовая торговля дизельным топливом",
                    "children": []
                  },
                  {
                    "code": "46718",
                    "name": "Оптовая торговля мазутом топочным",
                    "children": []
                  },
                  {
                    "code": "46719",
                    "name": "Оптовая торговля прочим топливом",
                    "children": []
                  }
                ]
              },
              {
                "code": "4672",
                "name": "Оптовая торговля металлами и металлическими рудами",
                "children": [
                  {
                    "code": "46721",
                    "name": "Оптовая торговля рудами черных и цветных металлов",
                    "children": []
                  },
                  {
                    "code": "46722",
                    "name": "Оптовая торговля чугуном, сталью и их литьем",
                    "children": []
                  },
                  {
                    "code": "46723",
                    "name": "Оптовая торговля редкими, редкоземельными и цветными металлами и их литьем",
                    "children": []
                  },
                  {
                    "code": "46724",
                    "name": "Оптовая торговля драгоценными металлами",
                    "children": []
                  }
                ]
              },
              {
                "code": "4673",
                "name": "Оптовая торговля лесоматериалами, строительными материалами и санитарно-техническим оборудованием",
                "children": [
                  {
                    "code": "46731",
                    "name": "Оптовая торговля листовым стеклом",
                    "children": []
                  },
                  {
                    "code": "46732",
                    "name": "Оптовая торговля цементом, песком и гравием",
                    "children": []
                  },
                  {
                    "code": "46733",
                    "name": "Оптовая торговля изделиями из бетона, цемента, гипса и аналогичных материалов",
                    "children": []
                  },
                  {
                    "code": "46734",
                    "name": "Оптовая торговля лакокрасочной продукцией, обоями и напольными покрытиями",
                    "children": []
                  },
                  {
                    "code": "46735",
                    "name": "Оптовая торговля древесиной и продукцией обработки древесины",
                    "children": []
                  },
                  {
                    "code": "46736",
                    "name": "Оптовая торговля строительными металлическими конструкциями",
                    "children": []
                  },
                  {
                    "code": "46737",
                    "name": "Оптовая торговля санитарно-техническим оборудованием",
                    "children": []
                  },
                  {
                    "code": "46738",
                    "name": "Оптовая торговля стеновыми блоками",
                    "children": []
                  }
                ]
              },
              {
                "code": "4674",
                "name": "Оптовая торговля скобяными изделиями, водопроводным и отопительным оборудованием и инвентарем",
                "children": []
              },
              {
                "code": "46740",
                "name": "Оптовая торговля скобяными изделиями, водопроводным и отопительным оборудованием и инвентарем",
                "children": []
              },
              {
                "code": "4675",
                "name": "Оптовая торговля химической продукцией",
                "children": [
                  {
                    "code": "46751",
                    "name": "Оптовая торговля химическими веществами и химическими продуктами",
                    "children": []
                  },
                  {
                    "code": "46752",
                    "name": "Оптовая торговля резинотехническими изделиями",
                    "children": []
                  },
                  {
                    "code": "46753",
                    "name": "Оптовая торговля минеральными удобрениями",
                    "children": []
                  },
                  {
                    "code": "46754",
                    "name": "Оптовая торговля пестицидами и прочими агрохимическими продуктами",
                    "children": []
                  }
                ]
              },
              {
                "code": "4676",
                "name": "Оптовая торговля прочими промежуточными продуктами",
                "children": [
                  {
                    "code": "46761",
                    "name": "Оптовая торговля пластмассами в первичных формах и синтетическим каучуком",
                    "children": []
                  },
                  {
                    "code": "46762",
                    "name": "Оптовая торговля прочими промежуточными продуктами",
                    "children": []
                  },
                  {
                    "code": "46763",
                    "name": "Оптовая торговля драгоценными камнями",
                    "children": []
                  }
                ]
              },
              {
                "code": "4677",
                "name": "Оптовая торговля отходами и ломом",
                "children": [
                  {
                    "code": "46771",
                    "name": "Оптовая торговля ломом и отходами черных и цветных металлов",
                    "children": []
                  },
                  {
                    "code": "46772",
                    "name": "Оптовая торговля ломом драгоценных металлов и драгоценных камней",
                    "children": []
                  },
                  {
                    "code": "46779",
                    "name": "Оптовая торговля прочими неметаллическими отходами и неметаллическим ломом",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "code": "469",
            "name": "Неспециализированная оптовая торговля",
            "children": []
          },
          {
            "code": "4690",
            "name": "Неспециализированная оптовая торговля",
            "children": [
              {
                "code": "46901",
                "name": "Оптовая торговля полудрагоценными камнями",
                "children": []
              },
              {
                "code": "46902",
                "name": "Оптовая торговля мореным дубом",
                "children": []
              },
              {
                "code": "46903",
                "name": "Оптовая торговля широким ассортиментом товаров без какой-либо конкретизации в торговых объектах с торговой площадью более 2000 кв.м (2000 кв.м и выше), включая оптово-продовольственные распределительные центры",
                "children": []
              },
              {
                "code": "46904",
                "name": "Оптовая торговля оборудованием и материалами, бывшими в употреблении",
                "children": []
              },
              {
                "code": "46905",
                "name": "Оптовая торговля углеродными единицами",
                "children": []
              },
              {
                "code": "46908",
                "name": "Специализированная оптовая торговля товарами, не включенными в другие группировки",
                "children": []
              },
              {
                "code": "46909",
                "name": "Оптовая торговля широким ассортиментом товаров без какой-либо конкретизации",
                "children": []
              }
            ]
          }
        ]
      },
      {
        "code": "47",
        "name": "Розничная торговля, кроме торговли автомобилями и мотоциклами",
        "children": [
          {
            "code": "471",
            "name": "Розничная торговля в неспециализированных магазинах",
            "children": [
              {
                "code": "4711",
                "name": "Розничная торговля в неспециализированных магазинах преимущественно продуктами питания, напитками и табачными изделиями",
                "children": [
                  {
                    "code": "47111",
                    "name": "Розничная торговля преимущественно продуктами питания, напитками и табачными изделиями в неспециализированных магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": []
                  },
                  {
                    "code": "47112",
                    "name": "Розничная торговля преимущественно продуктами питания, напитками и табачными изделиями, в неспециализированных магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": []
                  }
                ]
              },
              {
                "code": "4719",
                "name": "Прочая розничная торговля в неспециализированных магазинах",
                "children": [
                  {
                    "code": "47191",
                    "name": "Прочая розничная торговля в неспециализированных магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": []
                  },
                  {
                    "code": "47192",
                    "name": "Прочая розничная торговля в неспециализированных магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "code": "472",
            "name": "Розничная торговля продуктами питания, напитками и табачными изделиями в специализированных магазинах",
            "children": [
              {
                "code": "4721",
                "name": "Розничная торговля фруктами и овощами в специализированных магазинах",
                "children": [
                  {
                    "code": "47211",
                    "name": "Розничная торговля фруктами и овощами в специализированных магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": []
                  },
                  {
                    "code": "47212",
                    "name": "Розничная торговля фруктами и овощами в специализированных магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": []
                  }
                ]
              },
              {
                "code": "4722",
                "name": "Розничная торговля мясом и мясными продуктами в специализированных магазинах",
                "children": [
                  {
                    "code": "47221",
                    "name": "Розничная торговля домашней птицей, дичью и изделиями из них в специализированных магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": []
                  },
                  {
                    "code": "47222",
                    "name": "Розничная торговля домашней птицей, дичью и изделиями из них в специализированных магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": []
                  },
                  {
                    "code": "47223",
                    "name": "Прочая розничная торговля мясом и мясными продуктами в специализированных магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": []
                  },
                  {
                    "code": "47224",
                    "name": "Прочая розничная торговля мясом и мясными продуктами в специализированных магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": []
                  }
                ]
              },
              {
                "code": "4723",
                "name": "Розничная торговля рыбой, ракообразными и моллюсками в специализированных магазинах",
                "children": [
                  {
                    "code": "47231",
                    "name": "Розничная торговля рыбой, ракообразными и моллюсками в специализированных магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": []
                  },
                  {
                    "code": "47232",
                    "name": "Розничная торговля рыбой, ракообразными и моллюсками в специализированных магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": []
                  }
                ]
              },
              {
                "code": "4724",
                "name": "Розничная торговля хлебобулочными, мучными и сахаристыми кондитерскими изделиями в специализированных магазинах",
                "children": [
                  {
                    "code": "47241",
                    "name": "Розничная торговля хлебобулочными, мучными и сахаристыми кондитерскими изделиями в специализированных магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": []
                  },
                  {
                    "code": "47242",
                    "name": "Розничная торговля хлебобулочными, мучными и сахаристыми кондитерскими изделиями в специализированных магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": []
                  }
                ]
              },
              {
                "code": "4725",
                "name": "Розничная торговля напитками в специализированных магазинах",
                "children": [
                  {
                    "code": "47251",
                    "name": "Розничная торговля напитками в специализированных магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": []
                  },
                  {
                    "code": "47252",
                    "name": "Розничная торговля напитками в специализированных магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": []
                  }
                ]
              },
              {
                "code": "4726",
                "name": "Розничная торговля табачными изделиями в специализированных магазинах",
                "children": [
                  {
                    "code": "47261",
                    "name": "Розничная торговля табачными изделиями в специализированных магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": []
                  },
                  {
                    "code": "47262",
                    "name": "Розничная торговля табачными изделиями в специализированных магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": []
                  }
                ]
              },
              {
                "code": "4729",
                "name": "Прочая розничная торговля продуктами питания в специализированных магазинах",
                "children": [
                  {
                    "code": "47291",
                    "name": "Прочая розничная торговля продуктами питания в специализированных магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": []
                  },
                  {
                    "code": "47292",
                    "name": "Прочая розничная торговля продуктами питания в специализированных магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "code": "473",
            "name": "Розничная торговля топливом в специализированных магазинах",
            "children": []
          },
          {
            "code": "4730",
            "name": "Розничная торговля топливом в специализированных магазинах",
            "children": [
              {
                "code": "47301",
                "name": "Розничная торговля моторным топливом в специализированных магазинах, за исключением находящихся на придорожной полосе",
                "children": []
              },
              {
                "code": "47302",
                "name": "Розничная торговля смазочными материалами в специализированных магазинах",
                "children": []
              },
              {
                "code": "47303",
                "name": "Розничная торговля моторным топливом в специализированных магазинах, находящихся на придорожной полосе",
                "children": []
              }
            ]
          },
          {
            "code": "474",
            "name": "Розничная торговля компьютерами и коммуникационным оборудованием в специализированных магазинах",
            "children": [
              {
                "code": "4741",
                "name": "Розничная торговля компьютерами, периферийным оборудованием и программным обеспечением в специализированных магазинах",
                "children": [
                  {
                    "code": "47411",
                    "name": "Розничная торговля компьютерами, периферийным оборудованием и программным обеспечением в специализированных магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": []
                  },
                  {
                    "code": "47412",
                    "name": "Розничная торговля компьютерами, периферийным оборудованием и программным обеспечением в специализированных магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": []
                  }
                ]
              },
              {
                "code": "4742",
                "name": "Розничная торговля телекоммуникационным оборудованием в специализированных магазинах",
                "children": [
                  {
                    "code": "47421",
                    "name": "Розничная торговля телекоммуникационным оборудованием в специализированных магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": []
                  },
                  {
                    "code": "47422",
                    "name": "Розничная торговля телекоммуникационным оборудованием в специализированных магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": []
                  }
                ]
              },
              {
                "code": "4743",
                "name": "Розничная торговля аудио- и видеоаппаратурой в специализированных магазинах",
                "children": [
                  {
                    "code": "47431",
                    "name": "Розничная торговля аудио- и видеоаппаратурой в специализированных магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": []
                  },
                  {
                    "code": "47432",
                    "name": "Розничная торговля аудио- и видеоаппаратурой в специализированных магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "code": "475",
            "name": "Розничная торговля прочими бытовыми товарами в специализированных магазинах",
            "children": [
              {
                "code": "4751",
                "name": "Розничная торговля текстильными изделиями в специализированных магазинах",
                "children": [
                  {
                    "code": "47511",
                    "name": "Розничная торговля текстильными изделиями в специализированных магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": []
                  },
                  {
                    "code": "47512",
                    "name": "Розничная торговля текстильными изделиями в специализированных магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": []
                  }
                ]
              },
              {
                "code": "4752",
                "name": "Розничная торговля скобяными изделиями, лакокрасочными материалами и стеклом в специализированных магазинах",
                "children": [
                  {
                    "code": "47521",
                    "name": "Розничная торговля скобяными изделиями, лакокрасочными материалами и стеклом в специализированных магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": []
                  },
                  {
                    "code": "47522",
                    "name": "Розничная торговля скобяными изделиями, лакокрасочными материалами и стеклом в специализированных магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": []
                  }
                ]
              },
              {
                "code": "4753",
                "name": "Розничная торговля коврами, ковровыми изделиями, настенными и напольными покрытиями в специализированных магазинах",
                "children": [
                  {
                    "code": "47531",
                    "name": "Розничная торговля коврами, ковровыми изделиями, настенными и напольными покрытиями в специализированных магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": []
                  },
                  {
                    "code": "47532",
                    "name": "Розничная торговля коврами, ковровыми изделиями, настенными и напольными покрытиями в специализированных магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": []
                  }
                ]
              },
              {
                "code": "4754",
                "name": "Розничная торговля электрическими бытовыми приборами в специализированных магазинах",
                "children": [
                  {
                    "code": "47541",
                    "name": "Розничная торговля электрическими бытовыми приборами в специализированных магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": []
                  },
                  {
                    "code": "47542",
                    "name": "Розничная торговля электрическими бытовыми приборами в специализированных магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": []
                  }
                ]
              },
              {
                "code": "4759",
                "name": "Розничная торговля мебелью, осветительным оборудованием и прочими бытовыми товарами в специализированных магазинах",
                "children": [
                  {
                    "code": "47591",
                    "name": "Розничная торговля мебелью в специализированных магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": []
                  },
                  {
                    "code": "47592",
                    "name": "Розничная торговля музыкальными инструментами и партитурами в специализированных магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": []
                  },
                  {
                    "code": "47593",
                    "name": "Розничная торговля мебелью в специализированных магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": []
                  },
                  {
                    "code": "47594",
                    "name": "Розничная торговля музыкальными инструментами и партитурами в специализированных магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": []
                  },
                  {
                    "code": "47595",
                    "name": "Розничная торговля осветительными приборами и бытовыми товарами, не включенными в другие группировки, в специализированных магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": []
                  },
                  {
                    "code": "47599",
                    "name": "Розничная торговля осветительными приборами и бытовыми товарами, не включенными в другие группировки, в специализированных магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "code": "476",
            "name": "Розничная торговля товарами культурно-развлекательного характера в специализированных магазинах",
            "children": [
              {
                "code": "4761",
                "name": "Розничная торговля книгами в специализированных магазинах",
                "children": [
                  {
                    "code": "47611",
                    "name": "Розничная торговля книгами в специализированных магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": []
                  },
                  {
                    "code": "47612",
                    "name": "Розничная торговля книгами в специализированных магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": []
                  }
                ]
              },
              {
                "code": "4762",
                "name": "Розничная торговля газетами, журналами и канцелярскими товарами в специализированных магазинах",
                "children": [
                  {
                    "code": "47621",
                    "name": "Розничная торговля газетами, журналами и канцелярскими товарами в специализированных магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": []
                  },
                  {
                    "code": "47622",
                    "name": "Розничная торговля газетами, журналами и канцелярскими товарами в специализированных магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": []
                  }
                ]
              },
              {
                "code": "4763",
                "name": "Розничная торговля аудио и видеозаписями в специализированных магазинах",
                "children": [
                  {
                    "code": "47631",
                    "name": "Розничная торговля аудио и видеозаписями в специализированных магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": []
                  },
                  {
                    "code": "47632",
                    "name": "Розничная торговля аудио и видеозаписями в специализированных магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": []
                  }
                ]
              },
              {
                "code": "4764",
                "name": "Розничная торговля спортивным оборудованием в специализированных магазинах",
                "children": [
                  {
                    "code": "47641",
                    "name": "Розничная торговля спортивным оборудованием в специализированных магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": []
                  },
                  {
                    "code": "47642",
                    "name": "Розничная торговля спортивным оборудованием в специализированных магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": []
                  }
                ]
              },
              {
                "code": "4765",
                "name": "Розничная торговля играми и игрушками в специализированных магазинах",
                "children": [
                  {
                    "code": "47651",
                    "name": "Розничная торговля играми и игрушками в специализированных магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": []
                  },
                  {
                    "code": "47652",
                    "name": "Розничная торговля играми и игрушками в специализированных магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "code": "477",
            "name": "Розничная торговля прочими товарами в специализированных магазинах",
            "children": [
              {
                "code": "4771",
                "name": "Розничная торговля одеждой в специализированных магазинах",
                "children": [
                  {
                    "code": "47711",
                    "name": "Розничная торговля трикотажными и чулочно-носочными изделиями в специализированных магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": []
                  },
                  {
                    "code": "47712",
                    "name": "Розничная торговля одеждой, кроме трикотажных и чулочно-носочных изделий, в специализированных магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": []
                  },
                  {
                    "code": "47713",
                    "name": "Розничная торговля трикотажными и чулочно-носочными изделиями в специализированных магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": []
                  },
                  {
                    "code": "47714",
                    "name": "Розничная торговля одеждой, кроме трикотажных и чулочно-носочных изделий, в специализированных магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": []
                  }
                ]
              },
              {
                "code": "4772",
                "name": "Розничная торговля обувью и кожаными изделиями в специализированных магазинах",
                "children": [
                  {
                    "code": "47721",
                    "name": "Розничная торговля обувью в специализированных магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": []
                  },
                  {
                    "code": "47722",
                    "name": "Розничная торговля кожаными изделиями в специализированных магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": []
                  },
                  {
                    "code": "47723",
                    "name": "Розничная торговля обувью в специализированных магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": []
                  },
                  {
                    "code": "47724",
                    "name": "Розничная торговля кожаными изделиями в специализированных магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": []
                  }
                ]
              },
              {
                "code": "4773",
                "name": "Розничная торговля фармацевтическими товарами в специализированных магазинах",
                "children": [
                  {
                    "code": "47731",
                    "name": "Розничная торговля фармацевтическими товарами в специализированных магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": []
                  },
                  {
                    "code": "47732",
                    "name": "Розничная торговля фармацевтическими товарами в специализированных магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": []
                  }
                ]
              },
              {
                "code": "4774",
                "name": "Розничная торговля медицинскими и ортопедическими товарами в специализированных магазинах",
                "children": [
                  {
                    "code": "47741",
                    "name": "Розничная торговля медицинскими и ортопедическими товарами в специализированных магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": []
                  },
                  {
                    "code": "47742",
                    "name": "Розничная торговля медицинскими и ортопедическими товарами в специализированных магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": []
                  }
                ]
              },
              {
                "code": "4775",
                "name": "Розничная торговля косметическими товарами и туалетными принадлежностями в специализированных магазинах",
                "children": [
                  {
                    "code": "47751",
                    "name": "Розничная торговля косметическими товарами и туалетными принадлежностями в специализированных магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": []
                  },
                  {
                    "code": "47752",
                    "name": "Розничная торговля косметическими товарами и туалетными принадлежностями в специализированных магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": []
                  }
                ]
              },
              {
                "code": "4776",
                "name": "Розничная торговля цветами, комнатными растениями, семенами, удобрениями, домашними животными и кормами для домашних животных в специализированных магазинах",
                "children": [
                  {
                    "code": "47761",
                    "name": "Розничная торговля цветами, комнатными растениями в специализированных магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": []
                  },
                  {
                    "code": "47762",
                    "name": "Розничная торговля семенами и удобрениями в специализированных магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": []
                  },
                  {
                    "code": "47763",
                    "name": "Розничная торговля домашними животными и кормами для домашних животных в специализированных магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": []
                  },
                  {
                    "code": "47764",
                    "name": "Розничная торговля цветами, комнатными растениями в специализированных магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": []
                  },
                  {
                    "code": "47765",
                    "name": "Розничная торговля семенами и удобрениями в специализированных магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": []
                  },
                  {
                    "code": "47766",
                    "name": "Розничная торговля домашними животными и кормами для домашних животных в специализированных магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": []
                  }
                ]
              },
              {
                "code": "4777",
                "name": "Розничная торговля часами и ювелирными изделиями в специализированных магазинах",
                "children": [
                  {
                    "code": "47771",
                    "name": "Розничная торговля часами и ювелирными изделиями в специализированных магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": []
                  },
                  {
                    "code": "47772",
                    "name": "Розничная торговля часами и ювелирными изделиями в специализированных магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": []
                  }
                ]
              },
              {
                "code": "4778",
                "name": "Прочая розничная торговля новыми товарами в специализированных магазинах",
                "children": [
                  {
                    "code": "47781",
                    "name": "Розничная торговля фотографическим, оптическим и точным оборудованием в специализированных магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": []
                  },
                  {
                    "code": "47782",
                    "name": "Розничная торговля велосипедами в специализированных магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": []
                  },
                  {
                    "code": "47783",
                    "name": "Розничная торговля фотографическим, оптическим и точным оборудованием в специализированных магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": []
                  },
                  {
                    "code": "47784",
                    "name": "Розничная торговля велосипедами в специализированных магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": []
                  },
                  {
                    "code": "47785",
                    "name": "Прочая розничная торговля в специализированных магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": []
                  },
                  {
                    "code": "47789",
                    "name": "Прочая розничная торговля в специализированных магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": []
                  }
                ]
              },
              {
                "code": "4779",
                "name": "Розничная торговля подержанными товарами в магазинах",
                "children": [
                  {
                    "code": "47791",
                    "name": "Розничная торговля подержанными товарами в магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": []
                  },
                  {
                    "code": "47792",
                    "name": "Розничная торговля подержанными товарами в магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "code": "478",
            "name": "Розничная торговля в палатках, киосках и на рынках",
            "children": [
              {
                "code": "4781",
                "name": "Розничная торговля продуктами питания, напитками и табачными изделиями в торговых палатках, киосках и на рынках",
                "children": [
                  {
                    "code": "47811",
                    "name": "Розничная торговля продуктами питания, напитками и табачными изделиями в торговых палатках, ларьках и киосках",
                    "children": []
                  },
                  {
                    "code": "47812",
                    "name": "Розничная торговля продуктами питания, напитками и табачными изделиями на рынках",
                    "children": []
                  }
                ]
              },
              {
                "code": "4782",
                "name": "Розничная торговля одеждой, обувью и текстильными изделиями в торговых палатках, киосках и на рынках",
                "children": [
                  {
                    "code": "47821",
                    "name": "Розничная торговля одеждой, обувью и текстильными изделиями в торговых палатках, ларьках и киосках",
                    "children": []
                  },
                  {
                    "code": "47822",
                    "name": "Розничная торговля одеждой, обувью и текстильными изделиями на рынках",
                    "children": []
                  }
                ]
              },
              {
                "code": "4789",
                "name": "Розничная торговля прочими товарами в палатках, киосках и на рынках",
                "children": [
                  {
                    "code": "47891",
                    "name": "Розничная торговля прочими товарами в торговых палатках, ларьках и киосках",
                    "children": []
                  },
                  {
                    "code": "47892",
                    "name": "Розничная торговля прочими товарами на рынках",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "code": "479",
            "name": "Розничная торговля вне магазинов, палаток, киосков или рынков",
            "children": [
              {
                "code": "4791",
                "name": "Розничная торговля путем заказа товаров по почте или через сеть Интернет",
                "children": []
              },
              {
                "code": "47910",
                "name": "Розничная торговля путем заказа товаров по почте или через сеть Интернет",
                "children": []
              },
              {
                "code": "4799",
                "name": "Прочая розничная торговля вне магазинов, палаток, киосков или рынков",
                "children": [
                  {
                    "code": "47991",
                    "name": "Развозная и разносная розничная торговля",
                    "children": []
                  },
                  {
                    "code": "47992",
                    "name": "Розничная торговля через сетевой маркетинг",
                    "children": []
                  },
                  {
                    "code": "47999",
                    "name": "Прочая розничная торговля вне магазинов",
                    "children": []
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  },
  {
    "code": "H",
    "name": "Транспорт и складирование",
    "children": [
      {
        "code": "49",
        "name": "Деятельность сухопутного и трубопроводного транспорта",
        "children": [
          {
            "code": "491",
            "name": "Деятельность пассажирского железнодорожного транспорта в междугородном сообщении",
            "children": []
          },
          {
            "code": "4910",
            "name": "Деятельность пассажирского железнодорожного транспорта в междугородном сообщении",
            "children": []
          },
          {
            "code": "49100",
            "name": "Деятельность пассажирского железнодорожного транспорта в междугородном сообщении",
            "children": []
          },
          {
            "code": "492",
            "name": "Деятельность грузового железнодорожного транспорта",
            "children": []
          },
          {
            "code": "4920",
            "name": "Деятельность грузового железнодорожного транспорта",
            "children": []
          },
          {
            "code": "49200",
            "name": "Деятельность грузового железнодорожного транспорта",
            "children": []
          },
          {
            "code": "493",
            "name": "Деятельность прочего пассажирского сухопутного транспорта",
            "children": [
              {
                "code": "4931",
                "name": "Деятельность сухопутного транспорта по городским и пригородным пассажирским перевозкам",
                "children": [
                  {
                    "code": "49311",
                    "name": "Перевозки автобусами",
                    "children": []
                  },
                  {
                    "code": "49312",
                    "name": "Перевозки трамваями",
                    "children": []
                  },
                  {
                    "code": "49313",
                    "name": "Перевозки троллейбусами",
                    "children": []
                  },
                  {
                    "code": "49314",
                    "name": "Перевозки метрополитеном",
                    "children": []
                  },
                  {
                    "code": "49315",
                    "name": "Перевозки легкорельсовым транспортом",
                    "children": []
                  },
                  {
                    "code": "49319",
                    "name": "Перевозки прочими видами транспорта, подчиняющегося расписанию",
                    "children": []
                  }
                ]
              },
              {
                "code": "4932",
                "name": "Деятельность такси",
                "children": []
              },
              {
                "code": "49320",
                "name": "Деятельность такси",
                "children": []
              },
              {
                "code": "4939",
                "name": "Деятельность прочего пассажирского сухопутного транспорта, не включенного в другие группировки",
                "children": []
              },
              {
                "code": "49390",
                "name": "Деятельность прочего пассажирского сухопутного транспорта, не включенного в другие группировки",
                "children": []
              }
            ]
          },
          {
            "code": "494",
            "name": "Деятельность грузового автомобильного транспорта и предоставление услуг по переезду",
            "children": [
              {
                "code": "4941",
                "name": "Деятельность грузового автомобильного транспорта",
                "children": []
              },
              {
                "code": "49410",
                "name": "Деятельность грузового автомобильного транспорта",
                "children": []
              },
              {
                "code": "4942",
                "name": "Предоставление услуг по переезду",
                "children": []
              },
              {
                "code": "49420",
                "name": "Предоставление услуг по переезду",
                "children": []
              }
            ]
          },
          {
            "code": "495",
            "name": "Деятельность трубопроводного транспорта",
            "children": []
          },
          {
            "code": "4950",
            "name": "Деятельность трубопроводного транспорта",
            "children": []
          },
          {
            "code": "49500",
            "name": "Деятельность трубопроводного транспорта",
            "children": []
          }
        ]
      },
      {
        "code": "50",
        "name": "Деятельность водного транспорта",
        "children": [
          {
            "code": "501",
            "name": "Деятельность морского и прибрежного пассажирского транспорта",
            "children": []
          },
          {
            "code": "5010",
            "name": "Деятельность морского и прибрежного пассажирского транспорта",
            "children": []
          },
          {
            "code": "50100",
            "name": "Деятельность морского и прибрежного пассажирского транспорта",
            "children": []
          },
          {
            "code": "502",
            "name": "Деятельность морского и прибрежного грузового транспорта",
            "children": []
          },
          {
            "code": "5020",
            "name": "Деятельность морского и прибрежного грузового транспорта",
            "children": []
          },
          {
            "code": "50200",
            "name": "Деятельность морского и прибрежного грузового транспорта",
            "children": []
          },
          {
            "code": "503",
            "name": "Деятельность речного пассажирского транспорта",
            "children": []
          },
          {
            "code": "5030",
            "name": "Деятельность речного пассажирского транспорта",
            "children": []
          },
          {
            "code": "50300",
            "name": "Деятельность речного пассажирского транспорта",
            "children": []
          },
          {
            "code": "504",
            "name": "Деятельность речного грузового транспорта",
            "children": []
          },
          {
            "code": "5040",
            "name": "Деятельность речного грузового транспорта",
            "children": [
              {
                "code": "50401",
                "name": "Деятельность речного грузового транспорта, кроме лесосплава",
                "children": []
              },
              {
                "code": "50402",
                "name": "Лесосплав",
                "children": []
              }
            ]
          },
          {
            "code": "51",
            "name": "Деятельность воздушного транспорта",
            "children": [
              {
                "code": "511",
                "name": "Деятельность воздушного пассажирского транспорта",
                "children": []
              },
              {
                "code": "5110",
                "name": "Деятельность воздушного пассажирского транспорта",
                "children": [
                  {
                    "code": "51101",
                    "name": "Деятельность воздушного пассажирского транспорта, подчиняющегося расписанию",
                    "children": []
                  },
                  {
                    "code": "51102",
                    "name": "Деятельность воздушного пассажирского транспорта, не подчиняющегося расписанию",
                    "children": []
                  }
                ]
              },
              {
                "code": "512",
                "name": "Деятельность воздушного грузового транспорта и космического транспорта",
                "children": [
                  {
                    "code": "5121",
                    "name": "Деятельность грузового воздушного транспорта",
                    "children": [
                      {
                        "code": "51211",
                        "name": "Деятельность грузового воздушного транспорта, подчиняющего расписанию",
                        "children": []
                      },
                      {
                        "code": "51212",
                        "name": "Деятельность грузового воздушного транспорта, не подчиняющего расписанию",
                        "children": []
                      }
                    ]
                  },
                  {
                    "code": "5122",
                    "name": "Деятельность космического транспорта",
                    "children": []
                  },
                  {
                    "code": "51220",
                    "name": "Деятельность космического транспорта",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "code": "52",
            "name": "Складирование грузов и вспомогательная транспортная деятельность",
            "children": [
              {
                "code": "521",
                "name": "Складирование и хранение грузов",
                "children": []
              },
              {
                "code": "5210",
                "name": "Складирование и хранение грузов",
                "children": [
                  {
                    "code": "52101",
                    "name": "Складирование и хранение зерна",
                    "children": []
                  },
                  {
                    "code": "52102",
                    "name": "Складирование и хранение непродовольственных товаров, кроме зерна, масличных культур и нефти",
                    "children": []
                  },
                  {
                    "code": "52103",
                    "name": "Складирование и хранение продовольственных товаров, кроме овощей и фруктов",
                    "children": []
                  },
                  {
                    "code": "52104",
                    "name": "Хранение нефти",
                    "children": []
                  },
                  {
                    "code": "52105",
                    "name": "Складирование и хранение овощей и фруктов",
                    "children": []
                  },
                  {
                    "code": "52106",
                    "name": "Складирование и хранение масличных культур",
                    "children": []
                  }
                ]
              },
              {
                "code": "522",
                "name": "Вспомогательная транспортная деятельность",
                "children": [
                  {
                    "code": "5221",
                    "name": "Вспомогательная деятельность сухопутного транспорта",
                    "children": [
                      {
                        "code": "52211",
                        "name": "Эксплуатация железных дорог",
                        "children": []
                      },
                      {
                        "code": "52212",
                        "name": "Эксплуатация автомобильных дорог",
                        "children": []
                      },
                      {
                        "code": "52213",
                        "name": "Деятельность терминалов",
                        "children": []
                      },
                      {
                        "code": "52214",
                        "name": "Деятельность автомобильных стоянок",
                        "children": []
                      },
                      {
                        "code": "52215",
                        "name": "Эксплуатация магистральных и иных трубопроводов, в том числе водоводов",
                        "children": []
                      },
                      {
                        "code": "52216",
                        "name": "Деятельность по подсоединению (подключению) трубопровода к действующим магистральным и иным трубопроводам",
                        "children": []
                      },
                      {
                        "code": "52219",
                        "name": "Прочая вспомогательная деятельность сухопутного транспорта",
                        "children": []
                      }
                    ]
                  },
                  {
                    "code": "5222",
                    "name": "Вспомогательная деятельность водного транспорта",
                    "children": []
                  },
                  {
                    "code": "52220",
                    "name": "Вспомогательная деятельность водного транспорта",
                    "children": []
                  },
                  {
                    "code": "5223",
                    "name": "Вспомогательная деятельность воздушного транспорта",
                    "children": [
                      {
                        "code": "52231",
                        "name": "Регулирование использования воздушного пространства",
                        "children": []
                      },
                      {
                        "code": "52232",
                        "name": "Деятельность аэропортов",
                        "children": []
                      },
                      {
                        "code": "52239",
                        "name": "Прочая деятельность, относящаяся к пассажирским и грузовым перевозкам воздушным транспортом",
                        "children": []
                      }
                    ]
                  },
                  {
                    "code": "5224",
                    "name": "Транспортная обработка грузов",
                    "children": []
                  },
                  {
                    "code": "52240",
                    "name": "Транспортная обработка грузов",
                    "children": []
                  },
                  {
                    "code": "5229",
                    "name": "Прочая вспомогательная транспортная деятельность",
                    "children": [
                      {
                        "code": "52291",
                        "name": "Транспортно-экспедиционные услуги",
                        "children": []
                      },
                      {
                        "code": "52292",
                        "name": "Технический надзор на транспорте",
                        "children": []
                      },
                      {
                        "code": "52299",
                        "name": "Прочая транспортно-экспедиционная деятельность",
                        "children": []
                      }
                    ]
                  }
                ]
              }
            ]
          },
          {
            "code": "53",
            "name": "Почтовая и курьерская деятельность",
            "children": [
              {
                "code": "531",
                "name": "Почтовая деятельность в рамках предоставления услуг общего пользования",
                "children": []
              },
              {
                "code": "5310",
                "name": "Почтовая деятельность в рамках предоставления услуг общего пользования",
                "children": []
              },
              {
                "code": "53100",
                "name": "Почтовая деятельность в рамках предоставления услуг общего пользования",
                "children": []
              },
              {
                "code": "532",
                "name": "Прочая почтовая и курьерская деятельность",
                "children": []
              },
              {
                "code": "5320",
                "name": "Прочая почтовая и курьерская деятельность",
                "children": []
              },
              {
                "code": "53200",
                "name": "Прочая почтовая и курьерская деятельность",
                "children": []
              }
            ]
          }
        ]
      }
    ]
  },
  {
    "code": "I",
    "name": "Предоставление услуг по проживанию и питанию",
    "children": [
      {
        "code": "55",
        "name": "Предоставление услуг по временному проживанию",
        "children": [
          {
            "code": "551",
            "name": "Предоставление услуг гостиницами и аналогичными местами для проживания",
            "children": []
          },
          {
            "code": "5510",
            "name": "Предоставление услуг гостиницами и аналогичными местами для проживания",
            "children": [
              {
                "code": "55101",
                "name": "Предоставление услуг гостиницами с ресторанами, за исключением гостиниц, находящихся на придорожной полосе",
                "children": []
              },
              {
                "code": "55102",
                "name": "Предоставление услуг гостиницами без ресторанов, за исключением гостиниц, находящихся на придорожной полосе",
                "children": []
              },
              {
                "code": "55103",
                "name": "Предоставление гостиничных услуг с ресторанами для официальных мероприятий",
                "children": []
              },
              {
                "code": "55104",
                "name": "Предоставление услуг гостиницами, находящимися на придорожной полосе",
                "children": []
              }
            ]
          },
          {
            "code": "552",
            "name": "Предоставление жилья на выходные дни и прочие периоды краткосрочного проживания",
            "children": []
          },
          {
            "code": "5520",
            "name": "Предоставление жилья на выходные дни и прочие периоды краткосрочного проживания",
            "children": []
          },
          {
            "code": "55200",
            "name": "Предоставление жилья на выходные дни и прочие периоды краткосрочного проживания",
            "children": []
          },
          {
            "code": "553",
            "name": "Предоставление услуг кемпингами, стоянками для автофургонов и автоприцепов для жилья",
            "children": []
          },
          {
            "code": "5530",
            "name": "Предоставление услуг кемпингами, стоянками для автофургонов и автоприцепов для жилья",
            "children": [
              {
                "code": "55301",
                "name": "Предоставление услуг кемпингами, стоянками для автофургонов и автоприцепов для жилья, за исключением находящихся на придорожной полосе",
                "children": []
              },
              {
                "code": "55302",
                "name": "Предоставление услуг кемпингами, стоянками для автофургонов и автоприцепов для жилья, находящимися на придорожной полосе",
                "children": []
              }
            ]
          },
          {
            "code": "559",
            "name": "Предоставление услуг прочими местами для проживания",
            "children": []
          },
          {
            "code": "5590",
            "name": "Предоставление услуг прочими местами для проживания",
            "children": [
              {
                "code": "55901",
                "name": "Предоставление услуг общежитиями при школах-интернатах",
                "children": []
              },
              {
                "code": "55902",
                "name": "Предоставление услуг студенческими общежитиями",
                "children": []
              },
              {
                "code": "55909",
                "name": "Предоставление услуг прочими местами для проживания, не включенными в другие категории",
                "children": []
              }
            ]
          }
        ]
      },
      {
        "code": "56",
        "name": "Предоставление услуг по обеспечению питанием и напитками",
        "children": [
          {
            "code": "561",
            "name": "Деятельность ресторанов и предоставление услуг по доставке продуктов питания",
            "children": []
          },
          {
            "code": "5610",
            "name": "Деятельность ресторанов и предоставление услуг по доставке продуктов питания",
            "children": [
              {
                "code": "56101",
                "name": "Деятельность ресторанов и предоставление услуг по доставке продуктов питания, за исключением деятельности объектов, находящихся на придорожной полосе",
                "children": []
              },
              {
                "code": "56102",
                "name": "Деятельность ресторанов и предоставление услуг по доставке продуктов питания объектами, находящимися на придорожной полосе",
                "children": []
              }
            ]
          },
          {
            "code": "562",
            "name": "Доставка готовой пищи на заказ и прочая деятельность по обеспечению питанием",
            "children": [
              {
                "code": "5621",
                "name": "Доставка готовой пищи на заказ",
                "children": []
              },
              {
                "code": "56210",
                "name": "Доставка готовой пищи на заказ",
                "children": []
              },
              {
                "code": "5629",
                "name": "Прочая деятельность по обеспечению питанием",
                "children": [
                  {
                    "code": "56291",
                    "name": "Прочие виды организации питания вне населенных пунктов",
                    "children": []
                  },
                  {
                    "code": "56292",
                    "name": "Прочие виды организации питания в пассажирских поездах",
                    "children": []
                  },
                  {
                    "code": "56299",
                    "name": "Прочая деятельность по обеспечению питанием, не включенная в другие группировки",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "code": "563",
            "name": "Подача напитков",
            "children": []
          },
          {
            "code": "5630",
            "name": "Подача напитков",
            "children": []
          },
          {
            "code": "56300",
            "name": "Подача напитков",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "code": "J",
    "name": "Информация и связь",
    "children": [
      {
        "code": "58",
        "name": "Издательская деятельность",
        "children": [
          {
            "code": "581",
            "name": "Издание книг, периодических публикаций и другие виды издательской деятельности",
            "children": [
              {
                "code": "5811",
                "name": "Издание книг",
                "children": []
              },
              {
                "code": "58110",
                "name": "Издание книг",
                "children": []
              },
              {
                "code": "5812",
                "name": "Издание справочников и списков рассылок",
                "children": []
              },
              {
                "code": "58120",
                "name": "Издание справочников и списков рассылок",
                "children": []
              },
              {
                "code": "5813",
                "name": "Издание газет",
                "children": []
              },
              {
                "code": "58130",
                "name": "Издание газет",
                "children": []
              },
              {
                "code": "5814",
                "name": "Издание журналов и периодических публикаций",
                "children": []
              },
              {
                "code": "58140",
                "name": "Издание журналов и периодических публикаций",
                "children": []
              },
              {
                "code": "5819",
                "name": "Прочие виды издательской деятельности",
                "children": []
              },
              {
                "code": "58190",
                "name": "Прочие виды издательской деятельности",
                "children": []
              }
            ]
          },
          {
            "code": "582",
            "name": "Издание программного обеспечения",
            "children": [
              {
                "code": "5821",
                "name": "Издание компьютерных игр",
                "children": []
              },
              {
                "code": "58210",
                "name": "Издание компьютерных игр",
                "children": []
              },
              {
                "code": "5829",
                "name": "Издание прочего программного обеспечения",
                "children": []
              },
              {
                "code": "58290",
                "name": "Издание прочего программного обеспечения",
                "children": []
              }
            ]
          }
        ]
      },
      {
        "code": "59",
        "name": "Производство кино-, видеофильмов и телевизионных программ, деятельность в сфере звукозаписи и издания музыкальных произведений",
        "children": [
          {
            "code": "591",
            "name": "Деятельность по производству кино-, видеофильмов и телевизионных программ",
            "children": [
              {
                "code": "5911",
                "name": "Деятельность по производству кино-, видеофильмов и телевизионных программ",
                "children": []
              },
              {
                "code": "59110",
                "name": "Деятельность по производству кино-, видеофильмов и телевизионных программ",
                "children": []
              },
              {
                "code": "5912",
                "name": "Деятельность по завершению создания кино-, видеофильмов и телевизионных программ",
                "children": []
              },
              {
                "code": "59120",
                "name": "Деятельность по завершению создания кино-, видеофильмов и телевизионных программ",
                "children": []
              },
              {
                "code": "5913",
                "name": "Деятельность по распространению кино-, видеофильмов и телевизионных программ",
                "children": []
              },
              {
                "code": "59130",
                "name": "Деятельность по распространению кино-, видеофильмов и телевизионных программ",
                "children": []
              },
              {
                "code": "5914",
                "name": "Деятельность по показу кинофильмов",
                "children": []
              },
              {
                "code": "59140",
                "name": "Деятельность по показу кинофильмов",
                "children": []
              }
            ]
          },
          {
            "code": "592",
            "name": "Деятельность в сфере звукозаписи и издания музыкальных произведений",
            "children": []
          },
          {
            "code": "5920",
            "name": "Деятельность в сфере звукозаписи и издания музыкальных произведений",
            "children": []
          },
          {
            "code": "59200",
            "name": "Деятельность в сфере звукозаписи и издания музыкальных произведений",
            "children": []
          }
        ]
      },
      {
        "code": "60",
        "name": "Деятельность по созданию программ и телерадиовещание",
        "children": [
          {
            "code": "601",
            "name": "Радиовещание",
            "children": []
          },
          {
            "code": "6010",
            "name": "Радиовещание",
            "children": []
          },
          {
            "code": "60100",
            "name": "Радиовещание",
            "children": []
          },
          {
            "code": "602",
            "name": "Деятельность по созданию и трансляции телевизионных программ",
            "children": []
          },
          {
            "code": "6020",
            "name": "Деятельность по созданию и трансляции телевизионных программ",
            "children": []
          },
          {
            "code": "60200",
            "name": "Деятельность по созданию и трансляции телевизионных программ",
            "children": []
          },
          {
            "code": "61",
            "name": "Телекоммуникации",
            "children": [
              {
                "code": "611",
                "name": "Проводная телекоммуникационная связь",
                "children": []
              },
              {
                "code": "6110",
                "name": "Проводная телекоммуникационная связь",
                "children": [
                  {
                    "code": "61101",
                    "name": "Проводная телекоммуникационная связь для государственных органов посредством единой транспортной среды",
                    "children": []
                  },
                  {
                    "code": "61109",
                    "name": "Прочая проводная телекоммуникационная связь",
                    "children": []
                  }
                ]
              },
              {
                "code": "612",
                "name": "Беспроводная телекоммуникационная связь",
                "children": []
              },
              {
                "code": "6120",
                "name": "Беспроводная телекоммуникационная связь",
                "children": [
                  {
                    "code": "61201",
                    "name": "Беспроводная телекоммуникационная связь посредством единой транспортной среды",
                    "children": []
                  },
                  {
                    "code": "61202",
                    "name": "Организация вещания теле-, радиопрограмм посредством сети национального оператора телерадиовещания",
                    "children": []
                  },
                  {
                    "code": "61209",
                    "name": "Прочая беспроводная телекоммуникационная связь",
                    "children": []
                  }
                ]
              },
              {
                "code": "613",
                "name": "Деятельность в области спутниковых телекоммуникаций",
                "children": []
              },
              {
                "code": "6130",
                "name": "Деятельность в области спутниковых телекоммуникаций",
                "children": [
                  {
                    "code": "61301",
                    "name": "Деятельность в области спутниковых телекоммуникаций для государственных органов посредством единой транспортной среды",
                    "children": []
                  },
                  {
                    "code": "61302",
                    "name": "Деятельность в области спутниковых телекоммуникаций для целей телерадиовещания",
                    "children": []
                  },
                  {
                    "code": "61303",
                    "name": "Деятельность в области спутниковых телекоммуникаций для организации связи",
                    "children": []
                  },
                  {
                    "code": "61309",
                    "name": "Прочая деятельность в области спутниковых телекоммуникаций",
                    "children": []
                  }
                ]
              },
              {
                "code": "619",
                "name": "Прочая деятельность в области телекоммуникаций",
                "children": []
              },
              {
                "code": "6190",
                "name": "Прочая деятельность в области телекоммуникаций",
                "children": [
                  {
                    "code": "61901",
                    "name": "Деятельность по распространению телерадиопрограмм посредством сети Интернет",
                    "children": []
                  },
                  {
                    "code": "61909",
                    "name": "Прочая деятельность в области телекоммуникаций, не включенная в другие группировки",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "code": "62",
            "name": "Компьютерное программирование, консультационные и другие сопутствующие услуги",
            "children": []
          },
          {
            "code": "63",
            "name": "Деятельность в области информационного обслуживания",
            "children": [
              {
                "code": "631",
                "name": "Обработка данных, размещение приложений (прикладных программ) и связанная с этим деятельность; деятельность веб-порталов",
                "children": [
                  {
                    "code": "6311",
                    "name": "Обработка данных, размещение приложений (прикладных программ) и связанная с этим деятельность",
                    "children": [
                      {
                        "code": "63111",
                        "name": "Деятельность по предоставлению в пользование серверных помещений (центров обработки данных)",
                        "children": []
                      },
                      {
                        "code": "63113",
                        "name": "Деятельность по осуществлению цифрового майнинга",
                        "children": []
                      },
                      {
                        "code": "63114",
                        "name": "Деятельность в области обработки данных",
                        "children": []
                      },
                      {
                        "code": "63115",
                        "name": "Предоставление в пользование программных продуктов, электронных информационных ресурсов, мобильных и иных приложений",
                        "children": []
                      }
                    ]
                  },
                  {
                    "code": "6312",
                    "name": "Деятельность веб-порталов",
                    "children": []
                  },
                  {
                    "code": "63120",
                    "name": "Деятельность веб-порталов",
                    "children": []
                  }
                ]
              },
              {
                "code": "639",
                "name": "Прочая деятельность в области информационного обслуживания",
                "children": [
                  {
                    "code": "6391",
                    "name": "Деятельность информационных агентств",
                    "children": []
                  },
                  {
                    "code": "63910",
                    "name": "Деятельность информационных агентств",
                    "children": []
                  },
                  {
                    "code": "6399",
                    "name": "Прочая деятельность в области информационного обслуживания, не включенная в другие группировки",
                    "children": [
                      {
                        "code": "63991",
                        "name": "Прочие виды деятельности, связанные с предоставлением компьютеризированных услуг телефонной связи",
                        "children": []
                      },
                      {
                        "code": "63999",
                        "name": "Прочие виды деятельности в области информационного обслуживания",
                        "children": []
                      }
                    ]
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "code": "620",
        "name": "Компьютерное программирование, консультационные и другие сопутствующие услуги",
        "children": [
          {
            "code": "6201",
            "name": "Деятельность в области компьютерного программирования",
            "children": [
              {
                "code": "62011",
                "name": "Деятельность в области разработки и тестирования программного кода",
                "children": []
              },
              {
                "code": "62012",
                "name": "Сопровождение программного обеспечения, программных продуктов, баз данных, интернет-ресурсов (сайтов), информационных систем",
                "children": []
              },
              {
                "code": "62013",
                "name": "Деятельность по управлению проектом в области информационных технологий",
                "children": []
              },
              {
                "code": "62014",
                "name": "Деятельность в области разработки технической документации и системной архитектуры",
                "children": []
              }
            ]
          },
          {
            "code": "6202",
            "name": "Консультационные услуги в области информационных технологий",
            "children": []
          },
          {
            "code": "62020",
            "name": "Консультационные услуги в области информационных технологий",
            "children": []
          },
          {
            "code": "6203",
            "name": "Деятельность по управлению компьютерным оборудованием",
            "children": [
              {
                "code": "62031",
                "name": "Системно-техническое обслуживание аппаратно-программных комплексов",
                "children": []
              },
              {
                "code": "62032",
                "name": "Деятельность в области монтажа и настройки аппаратно-программных комплексов",
                "children": []
              }
            ]
          },
          {
            "code": "6209",
            "name": "Другие виды деятельности в области информационных технологий и информационных систем",
            "children": [
              {
                "code": "62092",
                "name": "Деятельность в области кибербезопасности",
                "children": []
              },
              {
                "code": "62099",
                "name": "Другие виды деятельности в области информационных технологий",
                "children": []
              }
            ]
          }
        ]
      }
    ]
  },
  {
    "code": "K",
    "name": "Финансовая и страховая деятельность",
    "children": [
      {
        "code": "64",
        "name": "Финансовое посредничество, кроме страхования и пенсионного обеспечения",
        "children": [
          {
            "code": "641",
            "name": "Денежное посредничество",
            "children": [
              {
                "code": "6411",
                "name": "Деятельность национального банка",
                "children": []
              },
              {
                "code": "64110",
                "name": "Деятельность национального банка",
                "children": []
              },
              {
                "code": "6419",
                "name": "Прочее денежное посредничество",
                "children": [
                  {
                    "code": "64191",
                    "name": "Деятельность банков, за исключением, банка, являющегося национальным институтом развития, и его дочерней организации-лизингодателя",
                    "children": []
                  },
                  {
                    "code": "64192",
                    "name": "Деятельность сберегательных банков",
                    "children": []
                  },
                  {
                    "code": "64193",
                    "name": "Деятельность банка, являющегося национальным институтом развития, и его дочерней организации-лизингодателя",
                    "children": []
                  },
                  {
                    "code": "64199",
                    "name": "Денежное посредничество прочих финансовых учреждений",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "code": "642",
            "name": "Деятельность холдинговых компаний",
            "children": []
          },
          {
            "code": "6420",
            "name": "Деятельность холдинговых компаний",
            "children": []
          },
          {
            "code": "64200",
            "name": "Деятельность холдинговых компаний",
            "children": []
          },
          {
            "code": "643",
            "name": "Деятельность трастовых компаний, инвестиционных фондов и аналогичных финансовых организаций",
            "children": []
          },
          {
            "code": "6430",
            "name": "Деятельность трастовых компаний, инвестиционных фондов и аналогичных финансовых организаций",
            "children": []
          },
          {
            "code": "64300",
            "name": "Деятельность трастовых компаний, инвестиционных фондов и аналогичных финансовых организаций",
            "children": []
          },
          {
            "code": "649",
            "name": "Прочее финансовое посредничество, кроме страхования и пенсионного обеспечения",
            "children": [
              {
                "code": "6491",
                "name": "Финансовый лизинг",
                "children": [
                  {
                    "code": "64911",
                    "name": "Финансовый лизинг, кроме финансового лизинга медицинского оборудования и техники",
                    "children": []
                  },
                  {
                    "code": "64912",
                    "name": "Финансовый лизинг медицинского оборудования и техники",
                    "children": []
                  }
                ]
              },
              {
                "code": "6492",
                "name": "Прочие виды кредитования",
                "children": [
                  {
                    "code": "64921",
                    "name": "Деятельность ломбардов",
                    "children": []
                  },
                  {
                    "code": "64922",
                    "name": "Деятельность специальных фондов финансовой поддержки субъектов частного предпринимательства",
                    "children": []
                  },
                  {
                    "code": "64929",
                    "name": "Прочие виды кредитования, не включенные в другие группировки",
                    "children": []
                  }
                ]
              },
              {
                "code": "6499",
                "name": "Прочее финансовое посредничество, кроме страхования и пенсионного обеспечения, не включенное в другие группировки",
                "children": [
                  {
                    "code": "64991",
                    "name": "Финансово-экономические услуги, оказываемые субъектам индустриально-инновационной деятельности и агропромышленного комплекса",
                    "children": []
                  },
                  {
                    "code": "64992",
                    "name": "Другие финансовые услуги, финансирование в различных отраслях экономики, инвестиционная деятельность",
                    "children": []
                  },
                  {
                    "code": "64999",
                    "name": "Другие виды финансовых услуг, кроме страхования и пенсионного обеспечения, не включенные в другие группировки",
                    "children": []
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "code": "65",
        "name": "Страхование, перестрахование и пенсионное обеспечение, кроме обязательного социального обеспечения",
        "children": [
          {
            "code": "651",
            "name": "Страхование",
            "children": [
              {
                "code": "6511",
                "name": "Страхование жизни",
                "children": [
                  {
                    "code": "65111",
                    "name": "Государственное страхование жизни",
                    "children": []
                  },
                  {
                    "code": "65112",
                    "name": "Негосударственное страхование жизни",
                    "children": []
                  }
                ]
              },
              {
                "code": "6512",
                "name": "Страхование ущерба",
                "children": [
                  {
                    "code": "65121",
                    "name": "Государственное страхование ущерба",
                    "children": []
                  },
                  {
                    "code": "65122",
                    "name": "Негосударственное страхование ущерба",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "code": "652",
            "name": "Перестрахование",
            "children": []
          },
          {
            "code": "6520",
            "name": "Перестрахование",
            "children": []
          },
          {
            "code": "65200",
            "name": "Перестрахование",
            "children": []
          },
          {
            "code": "653",
            "name": "Пенсионное обеспечение",
            "children": []
          },
          {
            "code": "6530",
            "name": "Пенсионное обеспечение",
            "children": [
              {
                "code": "65301",
                "name": "Государственное пенсионное обеспечение",
                "children": []
              },
              {
                "code": "65302",
                "name": "Негосударственное пенсионное обеспечение",
                "children": []
              }
            ]
          }
        ]
      },
      {
        "code": "66",
        "name": "Вспомогательная деятельность в сфере финансовых услуг и страхования",
        "children": [
          {
            "code": "661",
            "name": "Вспомогательная деятельность в сфере финансовых услуг, кроме страхования и пенсионного обеспечения",
            "children": [
              {
                "code": "6611",
                "name": "Управление финансовыми рынками",
                "children": [
                  {
                    "code": "66111",
                    "name": "Деятельность товарных бирж",
                    "children": []
                  },
                  {
                    "code": "66112",
                    "name": "Деятельность, связанная с управлением финансовыми рынками",
                    "children": []
                  },
                  {
                    "code": "66113",
                    "name": "Деятельность по ведению системы реестров держателей ценных бумаг и участников хозяйственных товариществ",
                    "children": []
                  }
                ]
              },
              {
                "code": "6612",
                "name": "Брокерская деятельность по сделкам с ценными бумагами и товарами",
                "children": [
                  {
                    "code": "66121",
                    "name": "Брокерская и дилерская деятельность, связанная с управлением активами Национального фонда, золотовалютными активами Национального Банка, пенсионными активами",
                    "children": []
                  },
                  {
                    "code": "66122",
                    "name": "Брокерская деятельность по сделкам с ценными бумагами и товарами, за исключением деятельности, связанной с управлением активами Национального фонда, золотовалютными активами Национального Банка, пенсионными активами",
                    "children": []
                  }
                ]
              },
              {
                "code": "6619",
                "name": "Прочая вспомогательная деятельность в сфере финансовых услуг, кроме страхования и пенсионного обеспечения",
                "children": []
              },
              {
                "code": "66190",
                "name": "Прочая вспомогательная деятельность в сфере финансовых услуг, кроме страхования и пенсионного обеспечения",
                "children": []
              }
            ]
          },
          {
            "code": "662",
            "name": "Вспомогательная деятельность по страхованию и пенсионному обеспечению",
            "children": [
              {
                "code": "6621",
                "name": "Оценка страховых рисков и убытков",
                "children": []
              },
              {
                "code": "66210",
                "name": "Оценка страховых рисков и убытков",
                "children": []
              },
              {
                "code": "6622",
                "name": "Деятельность страховых агентов и брокеров",
                "children": []
              },
              {
                "code": "66220",
                "name": "Деятельность страховых агентов и брокеров",
                "children": []
              },
              {
                "code": "6629",
                "name": "Прочая вспомогательная деятельность по страхованию и пенсионному обеспечению",
                "children": []
              },
              {
                "code": "66290",
                "name": "Прочая вспомогательная деятельность по страхованию и пенсионному обеспечению",
                "children": []
              }
            ]
          },
          {
            "code": "663",
            "name": "Деятельность по управлению фондами",
            "children": []
          },
          {
            "code": "6630",
            "name": "Деятельность по управлению фондами",
            "children": [
              {
                "code": "66301",
                "name": "Деятельность по управлению активами Национального фонда, золотовалютными активами Национального Банка, пенсионными активами",
                "children": []
              },
              {
                "code": "66302",
                "name": "Деятельность по доверительному управлению портфелем активов фондов",
                "children": []
              }
            ]
          }
        ]
      }
    ]
  },
  {
    "code": "L",
    "name": "Операции с недвижимым имуществом",
    "children": [
      {
        "code": "68",
        "name": "Операции с недвижимым имуществом",
        "children": [
          {
            "code": "681",
            "name": "Покупка и продажа собственного недвижимого имущества",
            "children": []
          },
          {
            "code": "6810",
            "name": "Покупка и продажа собственного недвижимого имущества",
            "children": [
              {
                "code": "68101",
                "name": "Покупка и продажа многоквартирных и жилых домов (особняков)",
                "children": []
              },
              {
                "code": "68102",
                "name": "Покупка и продажа прочей недвижимости",
                "children": []
              }
            ]
          },
          {
            "code": "682",
            "name": "Аренда и управление собственной или арендуемой недвижимостью",
            "children": []
          },
          {
            "code": "6820",
            "name": "Аренда и управление собственной или арендуемой недвижимостью",
            "children": [
              {
                "code": "68201",
                "name": "Аренда (субаренда) и управление собственной или арендованной жилой недвижимостью",
                "children": []
              },
              {
                "code": "68202",
                "name": "Аренда (субаренда) и управление собственными или арендованными бизнес-центром, офисными помещениями, административным зданием",
                "children": []
              },
              {
                "code": "68203",
                "name": "Аренда (субаренда) и управление собственным или арендованным торговым рынком",
                "children": []
              },
              {
                "code": "68204",
                "name": "Аренда и управление собственной торговой недвижимостью и многофункциональными комплексами в торговой деятельности",
                "children": []
              },
              {
                "code": "68205",
                "name": "Аренда (субаренда) и управление арендуемой торговой недвижимостью и арендованными многофункциональными комплексами в торговой деятельности",
                "children": []
              },
              {
                "code": "68206",
                "name": "Аренда (субаренда) и управление собственными или арендованными встроенными, пристроенными нежилыми помещениями в жилых домах",
                "children": []
              },
              {
                "code": "68207",
                "name": "Аренда (субаренда) и управление собственными или арендованными выставочным залом, конференц-залами",
                "children": []
              },
              {
                "code": "68208",
                "name": "Аренда (субаренда) и управление собственными или арендованными складскими помещениями",
                "children": []
              },
              {
                "code": "68209",
                "name": "Аренда (субаренда) и управление собственной или арендованной прочей недвижимостью, не включенной в другие группировки",
                "children": []
              }
            ]
          },
          {
            "code": "683",
            "name": "Операции с недвижимым имуществом за вознаграждение или на договорной основе",
            "children": [
              {
                "code": "6831",
                "name": "Деятельность агентств по операциям с недвижимым имуществом",
                "children": [
                  {
                    "code": "68311",
                    "name": "Посреднические услуги при купле-продаже и сдаче внаем недвижимого имущества производственно-технического назначения",
                    "children": []
                  },
                  {
                    "code": "68312",
                    "name": "Посреднические услуги при купле-продаже и сдаче внаем жилья и другого недвижимого имущества непроизводственного назначения",
                    "children": []
                  }
                ]
              },
              {
                "code": "6832",
                "name": "Управление недвижимым имуществом за вознаграждение или на договорной основе",
                "children": [
                  {
                    "code": "68321",
                    "name": "Управление недвижимостью за вознаграждение или на договорной основе",
                    "children": []
                  },
                  {
                    "code": "68322",
                    "name": "Обеспечение мер при эксплуатаций «Эталонного центра»",
                    "children": []
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  },
  {
    "code": "M",
    "name": "Профессиональная, научная и техническая деятельность",
    "children": [
      {
        "code": "69",
        "name": "Деятельность в области права и бухгалтерского учета",
        "children": [
          {
            "code": "691",
            "name": "Деятельность в области права",
            "children": []
          },
          {
            "code": "6910",
            "name": "Деятельность в области права",
            "children": [
              {
                "code": "69101",
                "name": "Адвокатская деятельность",
                "children": []
              },
              {
                "code": "69102",
                "name": "Нотариальная деятельность",
                "children": []
              },
              {
                "code": "69109",
                "name": "Прочая деятельность в области права",
                "children": []
              }
            ]
          },
          {
            "code": "692",
            "name": "Деятельность в области бухгалтерского учета и аудита; консультирование по налогообложению",
            "children": []
          },
          {
            "code": "6920",
            "name": "Деятельность в области бухгалтерского учета и аудита; консультирование по налогообложению",
            "children": [
              {
                "code": "69201",
                "name": "Деятельность по проведению финансовой ревизии (аудита)",
                "children": []
              },
              {
                "code": "69202",
                "name": "Деятельность в области составления счетов и бухгалтерского учета",
                "children": []
              },
              {
                "code": "69203",
                "name": "Консультрование в области налогообложения",
                "children": []
              },
              {
                "code": "69204",
                "name": "Деятельность, связанная с неплатежеспособностью и взысканием задолженности",
                "children": []
              },
              {
                "code": "69205",
                "name": "Деятельность в области бухгалтерского, налогового учета и казначейских операций для национального управляющего холдинга",
                "children": []
              }
            ]
          }
        ]
      },
      {
        "code": "70",
        "name": "Деятельность головных компаний; консультирование по вопросам управления",
        "children": [
          {
            "code": "701",
            "name": "Деятельность головных компаний",
            "children": []
          },
          {
            "code": "7010",
            "name": "Деятельность головных компаний",
            "children": [
              {
                "code": "70101",
                "name": "Деятельность головных компаний, связанная с реализацией государственной политики индустриально-инновационного развития",
                "children": []
              },
              {
                "code": "70109",
                "name": "Деятельность прочих головных компаний",
                "children": []
              }
            ]
          },
          {
            "code": "702",
            "name": "Деятельность по консультированию по вопросам управления",
            "children": [
              {
                "code": "7021",
                "name": "Деятельность по взаимоотношениям и связью с общественностью",
                "children": []
              },
              {
                "code": "70210",
                "name": "Деятельность по взаимоотношениям и связью с общественностью",
                "children": []
              },
              {
                "code": "7022",
                "name": "Консультирование по вопросам коммерческой деятельности и прочее консультирование по вопросам управления",
                "children": [
                  {
                    "code": "70221",
                    "name": "Консультирование по вопросам коммерческой деятельности и управления",
                    "children": []
                  },
                  {
                    "code": "70222",
                    "name": "Консультативное сопровождение концессионных проектов и проектов государственно-частного партнерства",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "code": "71",
            "name": "Деятельность в области архитектуры, инженерных изысканий, технических испытаний и анализа",
            "children": [
              {
                "code": "711",
                "name": "Деятельность в области архитектуры, инженерных изысканий и предоставление технических консультаций в этих областях",
                "children": [
                  {
                    "code": "7111",
                    "name": "Деятельность в области архитектуры",
                    "children": [
                      {
                        "code": "71111",
                        "name": "Деятельность в области архитектуры для объектов атомной промышленности и атомной энергетики",
                        "children": []
                      },
                      {
                        "code": "71112",
                        "name": "Деятельность в области архитектуры, за исключением объектов атомной промышленности и атомной энергетики",
                        "children": []
                      }
                    ]
                  },
                  {
                    "code": "7112",
                    "name": "Деятельность в области инженерных изысканий и предоставление технических консультаций в этой области",
                    "children": [
                      {
                        "code": "71121",
                        "name": "Деятельность в области инженерно-технического проектирования, за исключением объектов атомной промышленности и атомной энергетики",
                        "children": []
                      },
                      {
                        "code": "71122",
                        "name": "Деятельность по проведению геологической разведки и изысканий (без научных исследований и разработок)",
                        "children": []
                      },
                      {
                        "code": "71123",
                        "name": "Геодезическая деятельность",
                        "children": []
                      },
                      {
                        "code": "71124",
                        "name": "Землеустройство",
                        "children": []
                      },
                      {
                        "code": "71125",
                        "name": "Деятельность в области картографии",
                        "children": []
                      },
                      {
                        "code": "71126",
                        "name": "Деятельность в области инженерных изысканий и предоставление технических консультаций в этой области для объектов атомной промышленности и атомной энергетики",
                        "children": []
                      },
                      {
                        "code": "71127",
                        "name": "Деятельность по предоставлению инженерно-технических консультаций",
                        "children": []
                      },
                      {
                        "code": "71128",
                        "name": "Деятельность в области технического регулирования, стандартизации, метрологии и оценки соответствия",
                        "children": []
                      }
                    ]
                  }
                ]
              },
              {
                "code": "712",
                "name": "Технические испытания и анализы",
                "children": []
              },
              {
                "code": "7120",
                "name": "Технические испытания и анализы",
                "children": [
                  {
                    "code": "71201",
                    "name": "Деятельность санитарно-эпидемиологических организаций",
                    "children": []
                  },
                  {
                    "code": "71202",
                    "name": "Деятельность организаций санитарного просвещения",
                    "children": []
                  },
                  {
                    "code": "71203",
                    "name": "Деятельность нефтеперерабатывающих заводов по осуществлению лабораторных испытаний и анализов",
                    "children": []
                  },
                  {
                    "code": "71204",
                    "name": "Лабораторно-аналитические исследования в геологической отрасли",
                    "children": []
                  },
                  {
                    "code": "71205",
                    "name": "Деятельность по производству судебных экспертиз и исследований, кроме медицинских",
                    "children": []
                  },
                  {
                    "code": "71209",
                    "name": "Деятельность прочих учреждений, осуществляющих технические испытания и анализы",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "code": "72",
            "name": "Научные исследования и разработки",
            "children": [
              {
                "code": "721",
                "name": "Научные исследования и экспериментальные разработки в области естественных и технических наук",
                "children": [
                  {
                    "code": "7211",
                    "name": "Научные исследования и экспериментальные разработки в области биотехнологий",
                    "children": []
                  },
                  {
                    "code": "72110",
                    "name": "Научные исследования и экспериментальные разработки в области биотехнологий",
                    "children": []
                  },
                  {
                    "code": "7219",
                    "name": "Прочие научные исследования и экспериментальные разработки в области естественных и технических наук",
                    "children": [
                      {
                        "code": "72191",
                        "name": "Научные исследования и экспериментальные разработки в области проектирования, строительства, ремонта, содержания и диагностики автомобильных дорог и мостовых сооружений",
                        "children": []
                      },
                      {
                        "code": "72192",
                        "name": "Научно-исследовательские, опытно-методические и опытно-конструкторские работы в геологической отрасли",
                        "children": []
                      },
                      {
                        "code": "72193",
                        "name": "Научные исследования и разработки в области космической деятельности",
                        "children": []
                      },
                      {
                        "code": "72194",
                        "name": "Исследования и экспериментальные разработки в области мирного использования атомной энергии",
                        "children": []
                      },
                      {
                        "code": "72195",
                        "name": "Исследования и разработки в области противоинфекционных препаратов",
                        "children": []
                      },
                      {
                        "code": "72199",
                        "name": "Прочие исследования и разработки в области естественных и технических наук",
                        "children": []
                      }
                    ]
                  }
                ]
              },
              {
                "code": "722",
                "name": "Исследования и экспериментальные разработки в области общественных и гуманитарных наук",
                "children": []
              },
              {
                "code": "7220",
                "name": "Исследования и экспериментальные разработки в области общественных и гуманитарных наук",
                "children": [
                  {
                    "code": "72201",
                    "name": "Прикладные исследования в области общественных и гуманитарных наук, направленные на содействие развитию отечественных производств",
                    "children": []
                  },
                  {
                    "code": "72202",
                    "name": "Прикладные исследования в области общественных и гуманитарных наук, направленных на развитие индустрии",
                    "children": []
                  },
                  {
                    "code": "72203",
                    "name": "Исследования и экспериментальные разработки в области обороны и национальной безопасности",
                    "children": []
                  },
                  {
                    "code": "72204",
                    "name": "Междисциплинарные исследования и разработки в области экономического, бюджетного и стратегического планирования",
                    "children": []
                  },
                  {
                    "code": "72209",
                    "name": "Исследования и экспериментальные разработки в области общественных и гуманитарных наук, не включенные в другие группировки",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "code": "73",
            "name": "Рекламная деятельность и исследование конъюнктуры рынка",
            "children": [
              {
                "code": "731",
                "name": "Рекламная деятельность",
                "children": [
                  {
                    "code": "7311",
                    "name": "Деятельность рекламных агентств",
                    "children": []
                  },
                  {
                    "code": "73110",
                    "name": "Деятельность рекламных агентств",
                    "children": []
                  },
                  {
                    "code": "7312",
                    "name": "Размещение рекламы в средствах массовой информации",
                    "children": []
                  },
                  {
                    "code": "73120",
                    "name": "Размещение рекламы в средствах массовой информации",
                    "children": []
                  }
                ]
              },
              {
                "code": "732",
                "name": "Исследование конъюнктуры рынка и изучение общественного мнения",
                "children": []
              },
              {
                "code": "7320",
                "name": "Исследование конъюнктуры рынка и изучение общественного мнения",
                "children": []
              },
              {
                "code": "73200",
                "name": "Исследование конъюнктуры рынка и изучение общественного мнения",
                "children": []
              }
            ]
          },
          {
            "code": "74",
            "name": "Прочая профессиональная, научная и техническая деятельность",
            "children": [
              {
                "code": "741",
                "name": "Специализированная дизайнерская деятельность",
                "children": []
              },
              {
                "code": "7410",
                "name": "Специализированная дизайнерская деятельность",
                "children": []
              },
              {
                "code": "74100",
                "name": "Специализированная дизайнерская деятельность",
                "children": []
              },
              {
                "code": "742",
                "name": "Деятельность в области фотографии",
                "children": []
              },
              {
                "code": "7420",
                "name": "Деятельность в области фотографии",
                "children": []
              },
              {
                "code": "74200",
                "name": "Деятельность в области фотографии",
                "children": []
              },
              {
                "code": "743",
                "name": "Деятельность по устному и письменному переводу",
                "children": []
              },
              {
                "code": "7430",
                "name": "Деятельность по устному и письменному переводу",
                "children": []
              },
              {
                "code": "74300",
                "name": "Деятельность по устному и письменному переводу",
                "children": []
              },
              {
                "code": "749",
                "name": "Прочая профессиональная, научная и техническая деятельность, не включенная в другие группировки",
                "children": []
              },
              {
                "code": "7490",
                "name": "Прочая профессиональная, научная и техническая деятельность, не включенная в другие группировки",
                "children": [
                  {
                    "code": "74901",
                    "name": "Деятельность гидрометеорологической службы",
                    "children": []
                  },
                  {
                    "code": "74902",
                    "name": "Аккредитация в области оценки соответствия",
                    "children": []
                  },
                  {
                    "code": "74903",
                    "name": "Деятельность ведомственных служб, занимающихся инновационными технологиями (медицинские, образовательные, консультационные и др.)",
                    "children": []
                  },
                  {
                    "code": "74909",
                    "name": "Иная профессиональная, научная и техническая деятельность, не включенная в другие группировки",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "code": "75",
            "name": "Ветеринарная деятельность",
            "children": []
          }
        ]
      },
      {
        "code": "750",
        "name": "Ветеринарная деятельность",
        "children": []
      },
      {
        "code": "7500",
        "name": "Ветеринарная деятельность",
        "children": []
      },
      {
        "code": "75000",
        "name": "Ветеринарная деятельность",
        "children": []
      }
    ]
  },
  {
    "code": "N",
    "name": "Деятельность в области административного и вспомогательного обслуживания",
    "children": [
      {
        "code": "77",
        "name": "Аренда, прокат и лизинг",
        "children": [
          {
            "code": "771",
            "name": "Аренда и лизинг автомобилей",
            "children": [
              {
                "code": "7711",
                "name": "Аренда и лизинг легковых автомобилей и легких автотранспортных средств",
                "children": [
                  {
                    "code": "77111",
                    "name": "Аренда легковых автомобилей и легких автотранспортных средств",
                    "children": []
                  },
                  {
                    "code": "77112",
                    "name": "Лизинг легковых автомобилей и легких автотранспортных средств",
                    "children": []
                  }
                ]
              },
              {
                "code": "7712",
                "name": "Аренда и лизинг грузовых автомобилей",
                "children": [
                  {
                    "code": "77121",
                    "name": "Аренда грузовых автомобилей",
                    "children": []
                  },
                  {
                    "code": "77122",
                    "name": "Лизинг грузовых автомобилей",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "code": "772",
            "name": "Аренда и лизинг предметов личного потребления и бытовых товаров",
            "children": [
              {
                "code": "7721",
                "name": "Аренда и лизинг развлекательного и спортивного оборудования",
                "children": []
              },
              {
                "code": "77210",
                "name": "Аренда и лизинг развлекательного и спортивного оборудования",
                "children": []
              },
              {
                "code": "7722",
                "name": "Прокат видеокассет и дисков",
                "children": []
              },
              {
                "code": "77220",
                "name": "Прокат видеокассет и дисков",
                "children": []
              },
              {
                "code": "7729",
                "name": "Аренда и лизинг прочих предметов личного потребления и бытовых товаров",
                "children": []
              },
              {
                "code": "77290",
                "name": "Аренда и лизинг прочих предметов личного потребления и бытовых товаров",
                "children": []
              }
            ]
          },
          {
            "code": "773",
            "name": "Аренда и лизинг прочих машин, оборудования и материальных активов",
            "children": [
              {
                "code": "7731",
                "name": "Аренда и лизинг сельскохозяйственных машин и оборудования",
                "children": [
                  {
                    "code": "77311",
                    "name": "Аренда сельскохозяйственных машин и оборудования",
                    "children": []
                  },
                  {
                    "code": "77312",
                    "name": "Лизинг сельскохозяйственных машин и оборудования",
                    "children": []
                  }
                ]
              },
              {
                "code": "7732",
                "name": "Аренда и лизинг строительных машин и оборудования",
                "children": [
                  {
                    "code": "77321",
                    "name": "Аренда строительных машин и оборудования",
                    "children": []
                  },
                  {
                    "code": "77322",
                    "name": "Лизинг строительных машин и оборудования",
                    "children": []
                  }
                ]
              },
              {
                "code": "7733",
                "name": "Аренда и лизинг офисных машин и оборудования, включая вычислительную технику",
                "children": [
                  {
                    "code": "77331",
                    "name": "Аренда компьютерного и периферийного оборудования для инфотелекоммуникационной системы",
                    "children": []
                  },
                  {
                    "code": "77332",
                    "name": "Лизинг компьютерного и периферийного оборудования для инфотелекоммуникационной системы",
                    "children": []
                  },
                  {
                    "code": "77338",
                    "name": "Аренда прочих офисных машин и оборудования",
                    "children": []
                  },
                  {
                    "code": "77339",
                    "name": "Лизинг прочих офисных машин и оборудования",
                    "children": []
                  }
                ]
              },
              {
                "code": "7734",
                "name": "Аренда и лизинг водных транспортных средств и оборудования",
                "children": [
                  {
                    "code": "77341",
                    "name": "Аренда водных транспортных средств и оборудования",
                    "children": []
                  },
                  {
                    "code": "77342",
                    "name": "Лизинг водных транспортных средств и оборудования",
                    "children": []
                  }
                ]
              },
              {
                "code": "7735",
                "name": "Аренда и лизинг воздушных транспортных средств и оборудования",
                "children": [
                  {
                    "code": "77351",
                    "name": "Аренда воздушных транспортных средств и оборудования",
                    "children": []
                  },
                  {
                    "code": "77352",
                    "name": "Лизинг воздушных транспортных средств и оборудования",
                    "children": []
                  }
                ]
              },
              {
                "code": "7739",
                "name": "Аренда и лизинг прочих машин, оборудования и материальных активов, не включенных в другие группировки",
                "children": [
                  {
                    "code": "77391",
                    "name": "Аренда прочих машин, оборудования и материальных активов, не включенных в другие группировки",
                    "children": []
                  },
                  {
                    "code": "77392",
                    "name": "Лизинг прочих машин, оборудования и материальных активов, не включенных в другие группировки",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "code": "774",
            "name": "Лизинг продуктов интеллектуальной собственности и аналогичных продуктов, кроме работ, защищенным авторским правом",
            "children": []
          },
          {
            "code": "7740",
            "name": "Лизинг продуктов интеллектуальной собственности и аналогичных продуктов, кроме работ, защищенным авторским правом",
            "children": []
          },
          {
            "code": "77400",
            "name": "Лизинг продуктов интеллектуальной собственности и аналогичных продуктов, кроме работ, защищенным авторским правом",
            "children": []
          }
        ]
      },
      {
        "code": "78",
        "name": "Деятельность в области трудоустройства",
        "children": [
          {
            "code": "781",
            "name": "Деятельность агентств по трудоустройству",
            "children": []
          },
          {
            "code": "7810",
            "name": "Деятельность агентств по трудоустройству",
            "children": []
          },
          {
            "code": "78100",
            "name": "Деятельность агентств по трудоустройству",
            "children": []
          },
          {
            "code": "782",
            "name": "Деятельность агентств по временному трудоустройству",
            "children": []
          },
          {
            "code": "7820",
            "name": "Деятельность агентств по временному трудоустройству",
            "children": []
          },
          {
            "code": "78200",
            "name": "Деятельность агентств по временному трудоустройству",
            "children": []
          },
          {
            "code": "783",
            "name": "Прочая деятельность по обеспечению трудовыми ресурсами (персоналом)",
            "children": []
          },
          {
            "code": "7830",
            "name": "Прочая деятельность по обеспечению трудовыми ресурсами (персоналом)",
            "children": [
              {
                "code": "78301",
                "name": "Прочая деятельность по обеспечению трудовыми ресурсами (персоналом), кроме деятельности организаций, учрежденных национальными компаниями",
                "children": []
              },
              {
                "code": "78302",
                "name": "Деятельность организаций, учрежденных национальными компаниями, по предоставлению технического и вспомогательного персонала для обслуживания стратегических объектов",
                "children": []
              },
              {
                "code": "78303",
                "name": "Деятельность по кадровому делопроизводству для национального управляющего холдинга",
                "children": []
              }
            ]
          }
        ]
      },
      {
        "code": "79",
        "name": "Деятельность туристских агентств и операторов, бронирование и сопутствующая деятельность",
        "children": [
          {
            "code": "791",
            "name": "Деятельность туристских агентств и операторов",
            "children": [
              {
                "code": "7911",
                "name": "Деятельность туристских агентств",
                "children": []
              },
              {
                "code": "79110",
                "name": "Деятельность туристских агентств",
                "children": []
              },
              {
                "code": "7912",
                "name": "Деятельность туристских операторов",
                "children": []
              },
              {
                "code": "79120",
                "name": "Деятельность туристских операторов",
                "children": []
              }
            ]
          },
          {
            "code": "799",
            "name": "Прочие услуги по бронированию и сопутствующая деятельность",
            "children": []
          },
          {
            "code": "7990",
            "name": "Прочие услуги по бронированию и сопутствующая деятельность",
            "children": []
          },
          {
            "code": "79900",
            "name": "Прочие услуги по бронированию и сопутствующая деятельность",
            "children": []
          }
        ]
      },
      {
        "code": "80",
        "name": "Деятельность по обеспечению безопасности и проведению расследований",
        "children": [
          {
            "code": "801",
            "name": "Деятельность по обеспечению безопасности частных лиц и имущества",
            "children": []
          },
          {
            "code": "8010",
            "name": "Деятельность по обеспечению безопасности частных лиц и имущества",
            "children": [
              {
                "code": "80101",
                "name": "Деятельность частных охранных служб",
                "children": []
              },
              {
                "code": "80102",
                "name": "Деятельность охранных организаций, учрежденных национальными компаниями",
                "children": []
              }
            ]
          },
          {
            "code": "802",
            "name": "Деятельность в области систем обеспечения безопасности",
            "children": []
          },
          {
            "code": "8020",
            "name": "Деятельность в области систем обеспечения безопасности",
            "children": []
          },
          {
            "code": "80200",
            "name": "Деятельность в области систем обеспечения безопасности",
            "children": []
          },
          {
            "code": "803",
            "name": "Деятельность по проведению расследований",
            "children": []
          },
          {
            "code": "8030",
            "name": "Деятельность по проведению расследований",
            "children": []
          },
          {
            "code": "80300",
            "name": "Деятельность по проведению расследований",
            "children": []
          },
          {
            "code": "81",
            "name": "Деятельность по обслуживанию зданий и благоустройству территорий",
            "children": [
              {
                "code": "811",
                "name": "Комплексное обслуживание объектов",
                "children": []
              },
              {
                "code": "8110",
                "name": "Комплексное обслуживание объектов",
                "children": [
                  {
                    "code": "81101",
                    "name": "Комплексное обслуживание жилых объектов",
                    "children": []
                  },
                  {
                    "code": "81102",
                    "name": "Комплексное обслуживание коммерческих объектов",
                    "children": []
                  }
                ]
              },
              {
                "code": "812",
                "name": "Деятельность по уборке",
                "children": [
                  {
                    "code": "8121",
                    "name": "Общая уборка зданий",
                    "children": [
                      {
                        "code": "81211",
                        "name": "Общая уборка жилых домов",
                        "children": []
                      },
                      {
                        "code": "81212",
                        "name": "Общая уборка коммерческих зданий",
                        "children": []
                      }
                    ]
                  },
                  {
                    "code": "8122",
                    "name": "Прочая деятельность (специализированная) по уборке зданий, чистке промышленных машин и оборудования",
                    "children": []
                  },
                  {
                    "code": "81220",
                    "name": "Прочая деятельность (специализированная) по уборке зданий, чистке промышленных машин и оборудования",
                    "children": []
                  },
                  {
                    "code": "8129",
                    "name": "Прочая деятельность по уборке",
                    "children": []
                  },
                  {
                    "code": "81290",
                    "name": "Прочая деятельность по уборке",
                    "children": []
                  }
                ]
              },
              {
                "code": "813",
                "name": "Деятельность по благоустройству территорий",
                "children": []
              },
              {
                "code": "8130",
                "name": "Деятельность по благоустройству территорий",
                "children": []
              },
              {
                "code": "81300",
                "name": "Деятельность по благоустройству территорий",
                "children": []
              }
            ]
          },
          {
            "code": "82",
            "name": "Деятельность в области офисного административного и вспомогательного обслуживания, направленная на поддержание коммерческой деятельности",
            "children": [
              {
                "code": "821",
                "name": "Деятельность в области офисного административного и вспомогательного обслуживания",
                "children": [
                  {
                    "code": "8211",
                    "name": "Деятельность по предоставлению комплексных офисных административных услуг",
                    "children": []
                  },
                  {
                    "code": "82110",
                    "name": "Деятельность по предоставлению комплексных офисных административных услуг",
                    "children": []
                  },
                  {
                    "code": "8219",
                    "name": "Деятельность по копированию, подготовке документов и прочая специализированная офисная вспомогательная деятельность",
                    "children": []
                  },
                  {
                    "code": "82190",
                    "name": "Деятельность по копированию, подготовке документов и прочая специализированная офисная вспомогательная деятельность",
                    "children": []
                  }
                ]
              },
              {
                "code": "822",
                "name": "Деятельность телефонных справочно-информационных служб",
                "children": []
              },
              {
                "code": "8220",
                "name": "Деятельность телефонных справочно-информационных служб",
                "children": []
              },
              {
                "code": "82200",
                "name": "Деятельность телефонных справочно-информационных служб",
                "children": []
              },
              {
                "code": "823",
                "name": "Организация конференций и торговых выставок",
                "children": []
              },
              {
                "code": "8230",
                "name": "Организация конференций и торговых выставок",
                "children": []
              },
              {
                "code": "82300",
                "name": "Организация конференций и торговых выставок",
                "children": []
              },
              {
                "code": "829",
                "name": "Деятельность по предоставлению вспомогательных коммерческих услуг, не включенная в другие группировки",
                "children": [
                  {
                    "code": "8291",
                    "name": "Деятельность агентств по сбору платежей и кредитных бюро",
                    "children": [
                      {
                        "code": "82911",
                        "name": "Деятельность государственного кредитного бюро",
                        "children": []
                      },
                      {
                        "code": "82912",
                        "name": "Деятельность агентств по сбору платежей и кредитных бюро, за исключением государственного",
                        "children": []
                      }
                    ]
                  },
                  {
                    "code": "8292",
                    "name": "Упаковывание",
                    "children": []
                  },
                  {
                    "code": "82920",
                    "name": "Упаковывание",
                    "children": []
                  },
                  {
                    "code": "8299",
                    "name": "Прочая деятельность по предоставлению вспомогательных коммерческих услуг, не включенная в другие группировки",
                    "children": []
                  },
                  {
                    "code": "82990",
                    "name": "Прочая деятельность по предоставлению вспомогательных коммерческих услуг, не включенная в другие группировки",
                    "children": []
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  },
  {
    "code": "O",
    "name": "Государственное управление и оборона; обязательное социальное обеспечение",
    "children": [
      {
        "code": "84",
        "name": "Государственное управление и оборона; обязательное социальное обеспечение",
        "children": [
          {
            "code": "841",
            "name": "Государственное управление общего характера и управление социально-экономической политикой общества",
            "children": [
              {
                "code": "8411",
                "name": "Государственное управление общего характера",
                "children": [
                  {
                    "code": "84111",
                    "name": "Деятельность республиканских органов управления",
                    "children": []
                  },
                  {
                    "code": "84112",
                    "name": "Деятельность региональных органов управления",
                    "children": []
                  },
                  {
                    "code": "84113",
                    "name": "Деятельность местных органов управления",
                    "children": []
                  },
                  {
                    "code": "84114",
                    "name": "Деятельность сельских и поселковых органов управления",
                    "children": []
                  },
                  {
                    "code": "84115",
                    "name": "Деятельность, связанная с налогообложением",
                    "children": []
                  },
                  {
                    "code": "84116",
                    "name": "Деятельность таможни",
                    "children": []
                  },
                  {
                    "code": "84117",
                    "name": "Деятельность в области статистики и социологии",
                    "children": []
                  }
                ]
              },
              {
                "code": "8412",
                "name": "Регулирование деятельности учреждений здравоохранения, образования, культуры и других социальных услуг, кроме социального обеспечения",
                "children": []
              },
              {
                "code": "84120",
                "name": "Регулирование деятельности учреждений здравоохранения, образования, культуры и других социальных услуг, кроме социального обеспечения",
                "children": []
              },
              {
                "code": "8413",
                "name": "Регулирование и содействие эффективному ведению экономической деятельности",
                "children": []
              },
              {
                "code": "84130",
                "name": "Регулирование и содействие эффективному ведению экономической деятельности",
                "children": []
              }
            ]
          },
          {
            "code": "842",
            "name": "Предоставление государством услуг обществу в целом",
            "children": [
              {
                "code": "8421",
                "name": "Международная деятельность",
                "children": []
              },
              {
                "code": "84210",
                "name": "Международная деятельность",
                "children": []
              },
              {
                "code": "8422",
                "name": "Оборонная деятельность",
                "children": []
              },
              {
                "code": "84220",
                "name": "Оборонная деятельность",
                "children": []
              },
              {
                "code": "8423",
                "name": "Деятельность в области юстиции и правосудия",
                "children": []
              },
              {
                "code": "84230",
                "name": "Деятельность в области юстиции и правосудия",
                "children": []
              },
              {
                "code": "8424",
                "name": "Деятельность по обеспечению общественного порядка и безопасности",
                "children": []
              },
              {
                "code": "84240",
                "name": "Деятельность по обеспечению общественного порядка и безопасности",
                "children": []
              },
              {
                "code": "8425",
                "name": "Деятельность по обеспечению безопасности в чрезвычайных ситуациях",
                "children": []
              },
              {
                "code": "84250",
                "name": "Деятельность по обеспечению безопасности в чрезвычайных ситуациях",
                "children": []
              }
            ]
          },
          {
            "code": "843",
            "name": "Деятельность в области обязательного социального страхования",
            "children": []
          },
          {
            "code": "8430",
            "name": "Деятельность в области обязательного социального страхования",
            "children": []
          },
          {
            "code": "84300",
            "name": "Деятельность в области обязательного социального страхования",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "code": "P",
    "name": "Образование",
    "children": [
      {
        "code": "85",
        "name": "Образование",
        "children": [
          {
            "code": "851",
            "name": "Дошкольное образование",
            "children": []
          },
          {
            "code": "8510",
            "name": "Дошкольное образование",
            "children": []
          },
          {
            "code": "85100",
            "name": "Дошкольное образование",
            "children": []
          },
          {
            "code": "852",
            "name": "Начальное образование (1-й уровень)",
            "children": []
          },
          {
            "code": "8520",
            "name": "Начальное образование (1-й уровень)",
            "children": []
          },
          {
            "code": "85200",
            "name": "Начальное образование (1-й уровень)",
            "children": []
          },
          {
            "code": "853",
            "name": "Среднее образование (2-й и 3-й уровни)",
            "children": [
              {
                "code": "8531",
                "name": "Основное и общее среднее образование",
                "children": []
              },
              {
                "code": "85310",
                "name": "Основное и общее среднее образование",
                "children": []
              },
              {
                "code": "8532",
                "name": "Техническое и профессиональное среднее образование",
                "children": [
                  {
                    "code": "85321",
                    "name": "Профессионально-техническое образование",
                    "children": []
                  },
                  {
                    "code": "85322",
                    "name": "Среднее специальное образование",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "code": "854",
            "name": "Высшее образование (5-й, 6-й, 7-й, 8-й уровни)",
            "children": [
              {
                "code": "8541",
                "name": "Послесреднее образование",
                "children": []
              },
              {
                "code": "85410",
                "name": "Послесреднее образование",
                "children": []
              },
              {
                "code": "8542",
                "name": "Высшее и послевузовское образование",
                "children": [
                  {
                    "code": "85421",
                    "name": "Высшее образование",
                    "children": []
                  },
                  {
                    "code": "85422",
                    "name": "Послевузовское образование",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "code": "855",
            "name": "Прочие виды образования",
            "children": [
              {
                "code": "8551",
                "name": "Образование в области спорта и отдыха",
                "children": []
              },
              {
                "code": "85510",
                "name": "Образование в области спорта и отдыха",
                "children": []
              },
              {
                "code": "8552",
                "name": "Образование в области культуры",
                "children": []
              },
              {
                "code": "85520",
                "name": "Образование в области культуры",
                "children": []
              },
              {
                "code": "8553",
                "name": "Деятельность школ подготовки водителей транспортных средств",
                "children": []
              },
              {
                "code": "85530",
                "name": "Деятельность школ подготовки водителей транспортных средств",
                "children": []
              },
              {
                "code": "8559",
                "name": "Прочие виды образования, не включенные в другие группировки",
                "children": [
                  {
                    "code": "85591",
                    "name": "Деятельность вечерних общеобразовательных школ",
                    "children": []
                  },
                  {
                    "code": "85592",
                    "name": "Виды образования, предоставляемые национальными компаниями и их дочерними организациями",
                    "children": []
                  },
                  {
                    "code": "85599",
                    "name": "Прочая деятельность в области образования, не включенная в другие группировки",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "code": "856",
            "name": "Вспомогательная деятельность в области образования",
            "children": []
          },
          {
            "code": "8560",
            "name": "Вспомогательная деятельность в области образования",
            "children": [
              {
                "code": "85601",
                "name": "Вспомогательная деятельность в области образования, предоставляемая национальными компаниями и их дочерними организациями",
                "children": []
              },
              {
                "code": "85609",
                "name": "Прочая вспомогательная деятельность в области образования",
                "children": []
              }
            ]
          }
        ]
      }
    ]
  },
  {
    "code": "Q",
    "name": "Здравоохранение и социальное обслуживание населения",
    "children": [
      {
        "code": "86",
        "name": "Деятельность в области здравоохранения",
        "children": [
          {
            "code": "861",
            "name": "Деятельность больничных организаций",
            "children": []
          },
          {
            "code": "8610",
            "name": "Деятельность больничных организаций",
            "children": [
              {
                "code": "86101",
                "name": "Деятельность больниц широкого профиля и специализированных больниц",
                "children": []
              },
              {
                "code": "86102",
                "name": "Деятельность родильных домов",
                "children": []
              },
              {
                "code": "86103",
                "name": "Деятельность санаторно-курортных организаций",
                "children": []
              },
              {
                "code": "86104",
                "name": "Деятельность лепрозориев",
                "children": []
              },
              {
                "code": "86109",
                "name": "Деятельность других лечебных учреждений, имеющих стационары",
                "children": []
              }
            ]
          },
          {
            "code": "862",
            "name": "Деятельности в области врачебной практики и стоматологии",
            "children": [
              {
                "code": "8621",
                "name": "Общая врачебная практика",
                "children": []
              },
              {
                "code": "86210",
                "name": "Общая врачебная практика",
                "children": []
              },
              {
                "code": "8622",
                "name": "Специальная врачебная практика",
                "children": []
              },
              {
                "code": "86220",
                "name": "Специальная врачебная практика",
                "children": []
              },
              {
                "code": "8623",
                "name": "Стоматологическая деятельность",
                "children": []
              },
              {
                "code": "86230",
                "name": "Стоматологическая деятельность",
                "children": []
              }
            ]
          },
          {
            "code": "869",
            "name": "Прочая деятельность в области здравоохранения",
            "children": []
          },
          {
            "code": "8690",
            "name": "Прочая деятельность в области здравоохранения",
            "children": [
              {
                "code": "86901",
                "name": "Деятельность по производству судебно-медицинских экспертиз и исследований",
                "children": []
              },
              {
                "code": "86909",
                "name": "Прочая деятельность в области здравоохранения, не включенная в другие группировки",
                "children": []
              }
            ]
          }
        ]
      },
      {
        "code": "87",
        "name": "Деятельность в области социального обслуживания населения с обеспечением проживания",
        "children": [
          {
            "code": "871",
            "name": "Предоставление специальных социальных услуг с обеспечением проживания и ухода за пациентами средним медицинским персоналом",
            "children": []
          },
          {
            "code": "8710",
            "name": "Предоставление специальных социальных услуг с обеспечением проживания и ухода за пациентами средним медицинским персоналом",
            "children": []
          },
          {
            "code": "87100",
            "name": "Предоставление специальных социальных услуг с обеспечением проживания и ухода за пациентами средним медицинским персоналом",
            "children": []
          },
          {
            "code": "872",
            "name": "Предоставление специальных социальных услуг с обеспечением проживания лицам, страдающим психическими расстройствами (заболеваниями), задержкой умственного развития и физическими недостатками, алкогольной или наркотической зависимостью",
            "children": []
          },
          {
            "code": "8720",
            "name": "Предоставление специальных социальных услуг с обеспечением проживания лицам, страдающим психическими расстройствами (заболеваниями), задержкой умственного развития и физическими недостатками, алкогольной или наркотической зависимостью",
            "children": []
          },
          {
            "code": "87200",
            "name": "Предоставление специальных социальных услуг с обеспечением проживания лицам, страдающим психическими расстройствами (заболеваниями), задержкой умственного развития и физическими недостатками, алкогольной или наркотической зависимостью",
            "children": []
          },
          {
            "code": "873",
            "name": "Предоставление специальных социальных услуг с обеспечением проживания пожилым гражданам и лицам с инвалидностью",
            "children": []
          },
          {
            "code": "8730",
            "name": "Предоставление специальных социальных услуг с обеспечением проживания пожилым гражданам и лицам с инвалидностью",
            "children": []
          },
          {
            "code": "87300",
            "name": "Предоставление специальных социальных услуг с обеспечением проживания пожилым гражданам и лицам с инвалидностью",
            "children": []
          },
          {
            "code": "879",
            "name": "Ппредоставление прочих социальных услуг с обеспечением проживания",
            "children": []
          },
          {
            "code": "8790",
            "name": "Ппредоставление прочих социальных услуг с обеспечением проживания",
            "children": []
          },
          {
            "code": "87900",
            "name": "Ппредоставление прочих социальных услуг с обеспечением проживания",
            "children": []
          }
        ]
      },
      {
        "code": "88",
        "name": "Деятельность в области социального обслуживания населения без обеспечения проживания",
        "children": [
          {
            "code": "881",
            "name": "Предоставление специальных социальных услуг без обеспечения проживания пожилым гражданам и лицам с инвалидностью",
            "children": []
          },
          {
            "code": "8810",
            "name": "Предоставление специальных социальных услуг без обеспечения проживания пожилым гражданам и лицам с инвалидностью",
            "children": []
          },
          {
            "code": "88100",
            "name": "Предоставление специальных социальных услуг без обеспечения проживания пожилым гражданам и лицам с инвалидностью",
            "children": []
          },
          {
            "code": "889",
            "name": "Предоставление прочих социальных услуг без обеспечения проживания",
            "children": [
              {
                "code": "8891",
                "name": "Дневной уход за детьми",
                "children": []
              },
              {
                "code": "88910",
                "name": "Дневной уход за детьми",
                "children": []
              },
              {
                "code": "8899",
                "name": "Предоставление прочих социальных услуг без обеспечения проживания, не включенные в другие группировки",
                "children": []
              },
              {
                "code": "88990",
                "name": "Предоставление прочих социальных услуг без обеспечения проживания, не включенные в другие группировки",
                "children": []
              }
            ]
          }
        ]
      }
    ]
  },
  {
    "code": "R",
    "name": "Искусство, развлечения и отдых",
    "children": [
      {
        "code": "90",
        "name": "Деятельность в области творчества, искусства и развлечений",
        "children": [
          {
            "code": "91",
            "name": "Деятельность библиотек, архивов, музеев и прочая деятельность в области культуры",
            "children": []
          },
          {
            "code": "92",
            "name": "Деятельность по организации азартных игр и заключению пари",
            "children": []
          },
          {
            "code": "93",
            "name": "Деятельность в области спорта, организации отдыха и развлечений",
            "children": []
          }
        ]
      },
      {
        "code": "900",
        "name": "Деятельность в области творчества, искусства и развлечений",
        "children": [
          {
            "code": "9001",
            "name": "Артистическая деятельность",
            "children": [
              {
                "code": "90011",
                "name": "Театральная деятельность",
                "children": []
              },
              {
                "code": "90012",
                "name": "Концертная деятельность",
                "children": []
              },
              {
                "code": "90013",
                "name": "Деятельность цирков",
                "children": []
              }
            ]
          },
          {
            "code": "9002",
            "name": "Деятельность, способствующая проведению культурно-зрелищных мероприятий",
            "children": []
          },
          {
            "code": "90020",
            "name": "Деятельность, способствующая проведению культурно-зрелищных мероприятий",
            "children": []
          },
          {
            "code": "9003",
            "name": "Художественное и литературное творчество",
            "children": []
          },
          {
            "code": "90030",
            "name": "Художественное и литературное творчество",
            "children": []
          },
          {
            "code": "9004",
            "name": "Деятельность концертных и театральных залов",
            "children": []
          },
          {
            "code": "90040",
            "name": "Деятельность концертных и театральных залов",
            "children": []
          },
          {
            "code": "910",
            "name": "Деятельность библиотек, архивов, музеев и прочая деятельность в области культуры",
            "children": [
              {
                "code": "9101",
                "name": "Деятельность библиотек и архивов",
                "children": [
                  {
                    "code": "91011",
                    "name": "Деятельность фильмо- и фонотек",
                    "children": []
                  },
                  {
                    "code": "91012",
                    "name": "Библиотечная деятельность, включая деятельность читальных залов, лекториев, демонстрационных залов",
                    "children": []
                  },
                  {
                    "code": "91013",
                    "name": "Деятельность архивов",
                    "children": []
                  },
                  {
                    "code": "91014",
                    "name": "Деятельность книжных палат",
                    "children": []
                  }
                ]
              },
              {
                "code": "9102",
                "name": "Деятельность музеев",
                "children": []
              },
              {
                "code": "91020",
                "name": "Деятельность музеев",
                "children": []
              },
              {
                "code": "9103",
                "name": "Деятельность исторических мест и зданий и аналогичных туристических достопримечательностей",
                "children": []
              },
              {
                "code": "91030",
                "name": "Деятельность исторических мест и зданий и аналогичных туристических достопримечательностей",
                "children": []
              },
              {
                "code": "9104",
                "name": "Деятельность ботанических садов, зоопарков и природных заповедников",
                "children": [
                  {
                    "code": "91041",
                    "name": "Деятельность ботанических садов и зоопарков",
                    "children": []
                  },
                  {
                    "code": "91042",
                    "name": "Деятельность природных заповедников, охрана дикой природы",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "code": "920",
            "name": "Деятельность по организации азартных игр и заключению пари",
            "children": []
          },
          {
            "code": "931",
            "name": "Деятельность в области спорта",
            "children": [
              {
                "code": "9311",
                "name": "Эксплуатация спортивных сооружений",
                "children": []
              },
              {
                "code": "93110",
                "name": "Эксплуатация спортивных сооружений",
                "children": []
              },
              {
                "code": "9312",
                "name": "Деятельность спортивных клубов",
                "children": []
              },
              {
                "code": "93120",
                "name": "Деятельность спортивных клубов",
                "children": []
              },
              {
                "code": "9313",
                "name": "Деятельность фитнес-клубов",
                "children": []
              },
              {
                "code": "93130",
                "name": "Деятельность фитнес-клубов",
                "children": []
              },
              {
                "code": "9319",
                "name": "Прочая деятельность в области спорта",
                "children": []
              },
              {
                "code": "93190",
                "name": "Прочая деятельность в области спорта",
                "children": []
              }
            ]
          },
          {
            "code": "932",
            "name": "Деятельность по организации отдыха и развлечений",
            "children": [
              {
                "code": "9321",
                "name": "Деятельность развлекательных и тематических парков",
                "children": []
              },
              {
                "code": "93210",
                "name": "Деятельность развлекательных и тематических парков",
                "children": []
              },
              {
                "code": "9329",
                "name": "Прочая деятельность по организации отдыха и развлечений",
                "children": [
                  {
                    "code": "93291",
                    "name": "Деятельность танцевальных залов, дискотек",
                    "children": []
                  },
                  {
                    "code": "93292",
                    "name": "Деятельность родео, тиров",
                    "children": []
                  },
                  {
                    "code": "93293",
                    "name": "Деятельность кукольных театров",
                    "children": []
                  },
                  {
                    "code": "93299",
                    "name": "Прочие виды деятельности по организации отдыха и развлечений",
                    "children": []
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "code": "9200",
        "name": "Деятельность по организации азартных игр и заключению пари",
        "children": []
      },
      {
        "code": "92000",
        "name": "Деятельность по организации азартных игр и заключению пари",
        "children": []
      }
    ]
  },
  {
    "code": "S",
    "name": "Предоставление прочих видов услуг",
    "children": [
      {
        "code": "94",
        "name": "Деятельность общественных объединений (организаций)",
        "children": [
          {
            "code": "941",
            "name": "Деятельность коммерческих, предпринимательских и профессиональных общественных организаций",
            "children": [
              {
                "code": "9411",
                "name": "Деятельность коммерческих и предпринимательских общественных организаций",
                "children": []
              },
              {
                "code": "94110",
                "name": "Деятельность коммерческих и предпринимательских общественных организаций",
                "children": []
              },
              {
                "code": "9412",
                "name": "Деятельность профессиональных общественных организаций",
                "children": []
              },
              {
                "code": "94120",
                "name": "Деятельность профессиональных общественных организаций",
                "children": []
              }
            ]
          },
          {
            "code": "942",
            "name": "Деятельность профессиональных союзов",
            "children": []
          },
          {
            "code": "9420",
            "name": "Деятельность профессиональных союзов",
            "children": []
          },
          {
            "code": "94200",
            "name": "Деятельность профессиональных союзов",
            "children": []
          },
          {
            "code": "949",
            "name": "Деятельность прочих общественных объединений",
            "children": [
              {
                "code": "9491",
                "name": "Деятельность религиозных организаций",
                "children": []
              },
              {
                "code": "94910",
                "name": "Деятельность религиозных организаций",
                "children": []
              },
              {
                "code": "9492",
                "name": "Деятельность политических организаций",
                "children": []
              },
              {
                "code": "94920",
                "name": "Деятельность политических организаций",
                "children": []
              },
              {
                "code": "9499",
                "name": "Деятельность прочих общественных организаций, не включенных в другие группировки",
                "children": []
              },
              {
                "code": "94990",
                "name": "Деятельность прочих общественных организаций, не включенных в другие группировки",
                "children": []
              }
            ]
          }
        ]
      },
      {
        "code": "95",
        "name": "Ремонт компьютеров, предметов личного потребления и бытовых товаров",
        "children": [
          {
            "code": "951",
            "name": "Ремонт компьютеров и коммуникационного оборудования",
            "children": [
              {
                "code": "9511",
                "name": "Ремонт компьютеров и периферийного оборудования",
                "children": []
              },
              {
                "code": "95110",
                "name": "Ремонт компьютеров и периферийного оборудования",
                "children": []
              },
              {
                "code": "9512",
                "name": "Ремонт коммуникационного оборудования",
                "children": []
              },
              {
                "code": "95120",
                "name": "Ремонт коммуникационного оборудования",
                "children": []
              }
            ]
          },
          {
            "code": "952",
            "name": "Ремонт предметов личного потребления и бытовых товаров",
            "children": [
              {
                "code": "9521",
                "name": "Ремонт электронной бытовой техники",
                "children": []
              },
              {
                "code": "95210",
                "name": "Ремонт электронной бытовой техники",
                "children": []
              },
              {
                "code": "9522",
                "name": "Ремонт бытовых приборов, домашнего и садового оборудования",
                "children": []
              },
              {
                "code": "95220",
                "name": "Ремонт бытовых приборов, домашнего и садового оборудования",
                "children": []
              },
              {
                "code": "9523",
                "name": "Ремонт обуви и изделий из кожи",
                "children": [
                  {
                    "code": "95231",
                    "name": "Ремонт обуви",
                    "children": []
                  },
                  {
                    "code": "95232",
                    "name": "Ремонт дорожных и галантерейных изделий из натуральной и искусственной кожи",
                    "children": []
                  }
                ]
              },
              {
                "code": "9524",
                "name": "Ремонт мебели и предметов интерьера",
                "children": []
              },
              {
                "code": "95240",
                "name": "Ремонт мебели и предметов интерьера",
                "children": []
              },
              {
                "code": "9525",
                "name": "Ремонт часов и ювелирных изделий",
                "children": [
                  {
                    "code": "95251",
                    "name": "Ремонт наручных и прочих часов",
                    "children": []
                  },
                  {
                    "code": "95252",
                    "name": "Ремонт ювелирных изделий",
                    "children": []
                  }
                ]
              },
              {
                "code": "9529",
                "name": "Ремонт прочих предметов личного потребления и бытовых товаров",
                "children": [
                  {
                    "code": "95291",
                    "name": "Ремонт трикотажных и вязаных изделий",
                    "children": []
                  },
                  {
                    "code": "95292",
                    "name": "Ремонт швейных изделий, головных уборов и изделий текстильной галантереи",
                    "children": []
                  },
                  {
                    "code": "95293",
                    "name": "Ремонт меховых и кожаных изделий и головных уборов",
                    "children": []
                  },
                  {
                    "code": "95294",
                    "name": "Ремонт музыкальных инструментов",
                    "children": []
                  },
                  {
                    "code": "95295",
                    "name": "Ремонт ковров и ковровых изделий",
                    "children": []
                  },
                  {
                    "code": "95296",
                    "name": "Ремонт велосипедов",
                    "children": []
                  },
                  {
                    "code": "95299",
                    "name": "Ремонт прочих предметов личного потребления и бытовых товаров, не включенных в другие группировки",
                    "children": []
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "code": "96",
        "name": "Предоставление прочих индивидуальных услуг",
        "children": []
      },
      {
        "code": "960",
        "name": "Предоставление прочих индивидуальных услуг",
        "children": [
          {
            "code": "9601",
            "name": "Стирка и (химическая) чистка текстильных и меховых изделий",
            "children": [
              {
                "code": "96011",
                "name": "Стирка и обработка белья",
                "children": []
              },
              {
                "code": "96012",
                "name": "Химическая чистка и крашение",
                "children": []
              }
            ]
          },
          {
            "code": "9602",
            "name": "Предоставление услуг парикмахерскими и салонами красоты",
            "children": []
          },
          {
            "code": "96020",
            "name": "Предоставление услуг парикмахерскими и салонами красоты",
            "children": []
          },
          {
            "code": "9603",
            "name": "Организация похорон и связанная с этим деятельность",
            "children": []
          },
          {
            "code": "96030",
            "name": "Организация похорон и связанная с этим деятельность",
            "children": []
          },
          {
            "code": "9604",
            "name": "Деятельность по обеспечению физического комфорта",
            "children": []
          },
          {
            "code": "96040",
            "name": "Деятельность по обеспечению физического комфорта",
            "children": []
          },
          {
            "code": "9609",
            "name": "Предоставление прочих индивидуальных услуг, не включенных в другие группировки",
            "children": []
          },
          {
            "code": "96090",
            "name": "Предоставление прочих индивидуальных услуг, не включенных в другие группировки",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "code": "T",
    "name": "Деятельность домашних хозяйств, нанимающих домашнюю прислугу; деятельность домашних хозяйств по производству товаров и услуг для собственного потребления",
    "children": [
      {
        "code": "97",
        "name": "Деятельность домашних хозяйств, нанимающих домашнюю прислугу",
        "children": []
      },
      {
        "code": "970",
        "name": "Деятельность домашних хозяйств, нанимающих домашнюю прислугу",
        "children": []
      },
      {
        "code": "9700",
        "name": "Деятельность домашних хозяйств, нанимающих домашнюю прислугу",
        "children": []
      },
      {
        "code": "97000",
        "name": "Деятельность домашних хозяйств, нанимающих домашнюю прислугу",
        "children": []
      },
      {
        "code": "98",
        "name": "Деятельность домашних хозяйств по производству товаров и услуг для собственного потребления",
        "children": [
          {
            "code": "981",
            "name": "Деятельность домашних хозяйств по производству товаров для собственного потребления",
            "children": []
          },
          {
            "code": "9810",
            "name": "Деятельность домашних хозяйств по производству товаров для собственного потребления",
            "children": []
          },
          {
            "code": "98100",
            "name": "Деятельность домашних хозяйств по производству товаров для собственного потребления",
            "children": []
          },
          {
            "code": "982",
            "name": "Деятельность домашних хозяйств по предоставлению услуг для собственного потребления",
            "children": []
          },
          {
            "code": "9820",
            "name": "Деятельность домашних хозяйств по предоставлению услуг для собственного потребления",
            "children": []
          },
          {
            "code": "98200",
            "name": "Деятельность домашних хозяйств по предоставлению услуг для собственного потребления",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "code": "U",
    "name": "Деятельность экстерриториальных организаций и органов",
    "children": [
      {
        "code": "99",
        "name": "Деятельность экстерриториальных организаций и органов",
        "children": []
      },
      {
        "code": "990",
        "name": "Деятельность экстерриториальных организаций и органов",
        "children": []
      },
      {
        "code": "9900",
        "name": "Деятельность экстерриториальных организаций и органов",
        "children": []
      },
      {
        "code": "99000",
        "name": "Деятельность экстерриториальных организаций и органов",
        "children": []
      }
    ]
  }
]
