oked_dict = [
  {
    "code": "A",
    "name": "Сельское, лесное и рыбное хозяйство",
    "children": [
      {
        "code": "01",
        "name": "Растениеводство и животноводство, охота и предоставление услуг в этих областях",
        "children": [
          {
            "code": "011",
            "name": "Выращивание одно- или двухлетних культур",
            "children": [
              {
                "code": "0111",
                "name": "Выращивание зерновых (кроме риса), бобовых и масличных культур",
                "children": [
                  {
                    "code": "01111",
                    "name": "Выращивание зерновых и зернобобовых культур, включая семеноводство",
                    "children": [],
                    "path": "A/01/011/0111/01111/"
                  },
                  {
                    "code": "01112",
                    "name": "Выращивание масличных культур и их семян",
                    "children": [],
                    "path": "A/01/011/0111/01112/"
                  }
                ],
                "path": "A/01/011/0111/"
              },
              {
                "code": "0112",
                "name": "Выращивание риса",
                "children": [],
                "path": "A/01/011/0112/"
              },
              {
                "code": "01120",
                "name": "Выращивание риса",
                "children": [],
                "path": "A/01/011/01120/"
              },
              {
                "code": "0113",
                "name": "Выращивание овощей, бахчевых, корнеплодов и клубнеплодов",
                "children": [
                  {
                    "code": "01131",
                    "name": "Выращивание картофеля и посадочного материала",
                    "children": [],
                    "path": "A/01/011/0113/01131/"
                  },
                  {
                    "code": "01132",
                    "name": "Выращивание овощей, их семян и рассады",
                    "children": [],
                    "path": "A/01/011/0113/01132/"
                  },
                  {
                    "code": "01133",
                    "name": "Выращивание сахарной свеклы и ее семян",
                    "children": [],
                    "path": "A/01/011/0113/01133/"
                  }
                ],
                "path": "A/01/011/0113/"
              },
              {
                "code": "0114",
                "name": "Выращивание сахарного тростника",
                "children": [],
                "path": "A/01/011/0114/"
              },
              {
                "code": "01140",
                "name": "Выращивание сахарного тростника",
                "children": [],
                "path": "A/01/011/01140/"
              },
              {
                "code": "0115",
                "name": "Выращивание табака",
                "children": [],
                "path": "A/01/011/0115/"
              },
              {
                "code": "01150",
                "name": "Выращивание табака",
                "children": [],
                "path": "A/01/011/01150/"
              },
              {
                "code": "0116",
                "name": "Выращивание прядильных культур",
                "children": [
                  {
                    "code": "01161",
                    "name": "Выращивание хлопка-сырца",
                    "children": [],
                    "path": "A/01/011/0116/01161/"
                  },
                  {
                    "code": "01162",
                    "name": "Выращивание прядильных культур и их семян",
                    "children": [],
                    "path": "A/01/011/0116/01162/"
                  }
                ],
                "path": "A/01/011/0116/"
              },
              {
                "code": "0119",
                "name": "Выращивание прочих одно- или двухлетних культур",
                "children": [
                  {
                    "code": "01191",
                    "name": "Выращивание кормовых культур и их семян",
                    "children": [],
                    "path": "A/01/011/0119/01191/"
                  },
                  {
                    "code": "01192",
                    "name": "Выращивание цветов, семеноводство цветочных культур",
                    "children": [],
                    "path": "A/01/011/0119/01192/"
                  },
                  {
                    "code": "01199",
                    "name": "Выращивание прочих одно- или двухлетних культур, не включенных в другие группировки",
                    "children": [],
                    "path": "A/01/011/0119/01199/"
                  }
                ],
                "path": "A/01/011/0119/"
              }
            ],
            "path": "A/01/011/"
          },
          {
            "code": "012",
            "name": "Выращивание многолетних культур",
            "children": [
              {
                "code": "0121",
                "name": "Выращивание винограда",
                "children": [],
                "path": "A/01/012/0121/"
              },
              {
                "code": "01210",
                "name": "Выращивание винограда",
                "children": [],
                "path": "A/01/012/01210/"
              },
              {
                "code": "0122",
                "name": "Выращивание тропических и субтропических плодов",
                "children": [],
                "path": "A/01/012/0122/"
              },
              {
                "code": "01220",
                "name": "Выращивание тропических и субтропических плодов",
                "children": [],
                "path": "A/01/012/01220/"
              },
              {
                "code": "0123",
                "name": "Выращивание цитрусовых плодов",
                "children": [],
                "path": "A/01/012/0123/"
              },
              {
                "code": "01230",
                "name": "Выращивание цитрусовых плодов",
                "children": [],
                "path": "A/01/012/01230/"
              },
              {
                "code": "0124",
                "name": "Выращивание семечковых и косточковых плодов",
                "children": [],
                "path": "A/01/012/0124/"
              },
              {
                "code": "01240",
                "name": "Выращивание семечковых и косточковых плодов",
                "children": [],
                "path": "A/01/012/01240/"
              },
              {
                "code": "0125",
                "name": "Выращивание прочих плодов, ягод и орехов",
                "children": [],
                "path": "A/01/012/0125/"
              },
              {
                "code": "01250",
                "name": "Выращивание прочих плодов, ягод и орехов",
                "children": [],
                "path": "A/01/012/01250/"
              },
              {
                "code": "0126",
                "name": "Выращивание маслосодержащих плодов",
                "children": [],
                "path": "A/01/012/0126/"
              },
              {
                "code": "01260",
                "name": "Выращивание маслосодержащих плодов",
                "children": [],
                "path": "A/01/012/01260/"
              },
              {
                "code": "0127",
                "name": "Выращивание культур для производства напитков",
                "children": [],
                "path": "A/01/012/0127/"
              },
              {
                "code": "01270",
                "name": "Выращивание культур для производства напитков",
                "children": [],
                "path": "A/01/012/01270/"
              },
              {
                "code": "0128",
                "name": "Выращивание специй, пряностей, лекарственных и используемых в парфюмерии растений",
                "children": [],
                "path": "A/01/012/0128/"
              },
              {
                "code": "01280",
                "name": "Выращивание специй, пряностей, лекарственных и используемых в парфюмерии растений",
                "children": [],
                "path": "A/01/012/01280/"
              },
              {
                "code": "0129",
                "name": "Выращивание прочих многолетних культур",
                "children": [],
                "path": "A/01/012/0129/"
              },
              {
                "code": "01290",
                "name": "Выращивание прочих многолетних культур",
                "children": [],
                "path": "A/01/012/01290/"
              }
            ],
            "path": "A/01/012/"
          },
          {
            "code": "013",
            "name": "Воспроизводство растений",
            "children": [],
            "path": "A/01/013/"
          },
          {
            "code": "0130",
            "name": "Воспроизводство растений",
            "children": [],
            "path": "A/01/0130/"
          },
          {
            "code": "01300",
            "name": "Воспроизводство растений",
            "children": [],
            "path": "A/01/01300/"
          },
          {
            "code": "014",
            "name": "Животноводство",
            "children": [
              {
                "code": "0141",
                "name": "Разведение крупного рогатого скота молочного направления",
                "children": [],
                "path": "A/01/014/0141/"
              },
              {
                "code": "01410",
                "name": "Разведение крупного рогатого скота молочного направления",
                "children": [],
                "path": "A/01/014/01410/"
              },
              {
                "code": "0142",
                "name": "Разведение прочего крупного рогатого скота и буйволов",
                "children": [],
                "path": "A/01/014/0142/"
              },
              {
                "code": "01420",
                "name": "Разведение прочего крупного рогатого скота и буйволов",
                "children": [],
                "path": "A/01/014/01420/"
              },
              {
                "code": "0143",
                "name": "Разведение лошадей и прочих животных семейства лошадиных",
                "children": [
                  {
                    "code": "01431",
                    "name": "Разведение лошадей",
                    "children": [],
                    "path": "A/01/014/0143/01431/"
                  },
                  {
                    "code": "01432",
                    "name": "Разведение и выращивание ослов, мулов или лошаков",
                    "children": [],
                    "path": "A/01/014/0143/01432/"
                  }
                ],
                "path": "A/01/014/0143/"
              },
              {
                "code": "0144",
                "name": "Разведение верблюдов и прочих животных семейства верблюжьих",
                "children": [],
                "path": "A/01/014/0144/"
              },
              {
                "code": "01440",
                "name": "Разведение верблюдов и прочих животных семейства верблюжьих",
                "children": [],
                "path": "A/01/014/01440/"
              },
              {
                "code": "0145",
                "name": "Разведение овец и коз",
                "children": [],
                "path": "A/01/014/0145/"
              },
              {
                "code": "01450",
                "name": "Разведение овец и коз",
                "children": [],
                "path": "A/01/014/01450/"
              },
              {
                "code": "0146",
                "name": "Разведение свиней",
                "children": [],
                "path": "A/01/014/0146/"
              },
              {
                "code": "01460",
                "name": "Разведение свиней",
                "children": [],
                "path": "A/01/014/01460/"
              },
              {
                "code": "0147",
                "name": "Разведение сельскохозяйственной птицы",
                "children": [
                  {
                    "code": "01471",
                    "name": "Разведение птицы на мясо, племенной птицы и молодняка",
                    "children": [],
                    "path": "A/01/014/0147/01471/"
                  },
                  {
                    "code": "01472",
                    "name": "Производство яиц",
                    "children": [],
                    "path": "A/01/014/0147/01472/"
                  },
                  {
                    "code": "01473",
                    "name": "Производство смешанное, мясояичное",
                    "children": [],
                    "path": "A/01/014/0147/01473/"
                  },
                  {
                    "code": "01474",
                    "name": "Деятельность инкубаторно-птицеводческих станций",
                    "children": [],
                    "path": "A/01/014/0147/01474/"
                  }
                ],
                "path": "A/01/014/0147/"
              },
              {
                "code": "0149",
                "name": "Разведение прочих видов животных",
                "children": [],
                "path": "A/01/014/0149/"
              },
              {
                "code": "01490",
                "name": "Разведение прочих видов животных",
                "children": [],
                "path": "A/01/014/01490/"
              }
            ],
            "path": "A/01/014/"
          },
          {
            "code": "015",
            "name": "Смешанное сельское хозяйство",
            "children": [],
            "path": "A/01/015/"
          },
          {
            "code": "0150",
            "name": "Смешанное сельское хозяйство",
            "children": [],
            "path": "A/01/0150/"
          },
          {
            "code": "01500",
            "name": "Смешанное сельское хозяйство",
            "children": [],
            "path": "A/01/01500/"
          },
          {
            "code": "016",
            "name": "Деятельность, способствующая выращиванию сельскохозяйственных культур и разведению животных и деятельность по обработке урожая",
            "children": [
              {
                "code": "0161",
                "name": "Деятельность, способствующая растениеводству",
                "children": [
                  {
                    "code": "01611",
                    "name": "Деятельность, способствующая растениеводству, кроме эксплуатации оросительных систем",
                    "children": [],
                    "path": "A/01/016/0161/01611/"
                  },
                  {
                    "code": "01612",
                    "name": "Эксплуатация оросительных систем",
                    "children": [],
                    "path": "A/01/016/0161/01612/"
                  }
                ],
                "path": "A/01/016/0161/"
              },
              {
                "code": "0162",
                "name": "Деятельность, способствующая животноводству",
                "children": [],
                "path": "A/01/016/0162/"
              },
              {
                "code": "01620",
                "name": "Деятельность, способствующая животноводству",
                "children": [],
                "path": "A/01/016/01620/"
              },
              {
                "code": "0163",
                "name": "Деятельность по обработке урожая",
                "children": [],
                "path": "A/01/016/0163/"
              },
              {
                "code": "01630",
                "name": "Деятельность по обработке урожая",
                "children": [],
                "path": "A/01/016/01630/"
              },
              {
                "code": "0164",
                "name": "Деятельность по обработке семян для посадки",
                "children": [],
                "path": "A/01/016/0164/"
              },
              {
                "code": "01640",
                "name": "Деятельность по обработке семян для посадки",
                "children": [],
                "path": "A/01/016/01640/"
              }
            ],
            "path": "A/01/016/"
          },
          {
            "code": "017",
            "name": "Охота и отлов, включая предоставление услуг в этих областях",
            "children": [],
            "path": "A/01/017/"
          },
          {
            "code": "0170",
            "name": "Охота и отлов, включая предоставление услуг в этих областях",
            "children": [],
            "path": "A/01/0170/"
          },
          {
            "code": "01700",
            "name": "Охота и отлов, включая предоставление услуг в этих областях",
            "children": [],
            "path": "A/01/01700/"
          }
        ],
        "path": "A/01/"
      },
      {
        "code": "02",
        "name": "Лесоводство и лесозаготовки",
        "children": [
          {
            "code": "021",
            "name": "Лесоводство и прочая лесохозяйственная деятельность",
            "children": [],
            "path": "A/02/021/"
          },
          {
            "code": "0210",
            "name": "Лесоводство и прочая лесохозяйственная деятельность",
            "children": [],
            "path": "A/02/0210/"
          },
          {
            "code": "02100",
            "name": "Лесоводство и прочая лесохозяйственная деятельность",
            "children": [],
            "path": "A/02/02100/"
          },
          {
            "code": "022",
            "name": "Лесозаготовки",
            "children": [],
            "path": "A/02/022/"
          },
          {
            "code": "0220",
            "name": "Лесозаготовки",
            "children": [],
            "path": "A/02/0220/"
          },
          {
            "code": "02200",
            "name": "Лесозаготовки",
            "children": [],
            "path": "A/02/02200/"
          },
          {
            "code": "023",
            "name": "Сбор дикорастущей недревесной продукции",
            "children": [],
            "path": "A/02/023/"
          },
          {
            "code": "0230",
            "name": "Сбор дикорастущей недревесной продукции",
            "children": [],
            "path": "A/02/0230/"
          },
          {
            "code": "02300",
            "name": "Сбор дикорастущей недревесной продукции",
            "children": [],
            "path": "A/02/02300/"
          },
          {
            "code": "024",
            "name": "Услуги, связанные с лесоводство и лесозаготовками",
            "children": [],
            "path": "A/02/024/"
          },
          {
            "code": "0240",
            "name": "Услуги, связанные с лесоводство и лесозаготовками",
            "children": [],
            "path": "A/02/0240/"
          },
          {
            "code": "02400",
            "name": "Услуги, связанные с лесоводство и лесозаготовками",
            "children": [],
            "path": "A/02/02400/"
          }
        ],
        "path": "A/02/"
      },
      {
        "code": "03",
        "name": "Рыболовство и рыбоводство",
        "children": [
          {
            "code": "031",
            "name": "Рыболовство",
            "children": [
              {
                "code": "0311",
                "name": "Морское рыболовство",
                "children": [],
                "path": "A/03/031/0311/"
              },
              {
                "code": "03110",
                "name": "Морское рыболовство",
                "children": [],
                "path": "A/03/031/03110/"
              },
              {
                "code": "0312",
                "name": "Пресноводное рыболовство",
                "children": [],
                "path": "A/03/031/0312/"
              },
              {
                "code": "03120",
                "name": "Пресноводное рыболовство",
                "children": [],
                "path": "A/03/031/03120/"
              }
            ],
            "path": "A/03/031/"
          },
          {
            "code": "032",
            "name": "Рыбоводство",
            "children": [
              {
                "code": "0321",
                "name": "Морское рыбоводство",
                "children": [],
                "path": "A/03/032/0321/"
              },
              {
                "code": "03210",
                "name": "Морское рыбоводство",
                "children": [],
                "path": "A/03/032/03210/"
              },
              {
                "code": "0322",
                "name": "Пресноводное рыбоводство",
                "children": [],
                "path": "A/03/032/0322/"
              },
              {
                "code": "03220",
                "name": "Пресноводное рыбоводство",
                "children": [],
                "path": "A/03/032/03220/"
              }
            ],
            "path": "A/03/032/"
          }
        ],
        "path": "A/03/"
      }
    ],
    "path": "A/"
  },
  {
    "code": "B",
    "name": "Горнодобывающая промышленность и разработка карьеров",
    "children": [
      {
        "code": "05",
        "name": "Добыча угля",
        "children": [
          {
            "code": "051",
            "name": "Добыча каменного угля",
            "children": [],
            "path": "B/05/051/"
          },
          {
            "code": "0510",
            "name": "Добыча каменного угля",
            "children": [
              {
                "code": "05101",
                "name": "Добыча каменного угля открытым способом",
                "children": [],
                "path": "B/05/0510/05101/"
              },
              {
                "code": "05102",
                "name": "Добыча каменного угля подземным способом",
                "children": [],
                "path": "B/05/0510/05102/"
              },
              {
                "code": "05103",
                "name": "Обогащение каменного угля",
                "children": [],
                "path": "B/05/0510/05103/"
              }
            ],
            "path": "B/05/0510/"
          },
          {
            "code": "052",
            "name": "Добыча лигнита (бурого угля)",
            "children": [],
            "path": "B/05/052/"
          },
          {
            "code": "0520",
            "name": "Добыча лигнита (бурого угля)",
            "children": [
              {
                "code": "05201",
                "name": "Добыча лигнита (бурого угля) открытым способом",
                "children": [],
                "path": "B/05/0520/05201/"
              },
              {
                "code": "05202",
                "name": "Добыча лигнита (бурого угля) подземным способом",
                "children": [],
                "path": "B/05/0520/05202/"
              },
              {
                "code": "05203",
                "name": "Обогащение лигнита (бурого угля)",
                "children": [],
                "path": "B/05/0520/05203/"
              }
            ],
            "path": "B/05/0520/"
          }
        ],
        "path": "B/05/"
      },
      {
        "code": "06",
        "name": "Добыча сырой нефти и природного газа",
        "children": [
          {
            "code": "061",
            "name": "Добыча сырой нефти",
            "children": [],
            "path": "B/06/061/"
          },
          {
            "code": "0610",
            "name": "Добыча сырой нефти",
            "children": [],
            "path": "B/06/0610/"
          },
          {
            "code": "06100",
            "name": "Добыча сырой нефти и попутного газа",
            "children": [],
            "path": "B/06/06100/"
          },
          {
            "code": "062",
            "name": "Добыча природного газа",
            "children": [],
            "path": "B/06/062/"
          },
          {
            "code": "0620",
            "name": "Добыча природного газа",
            "children": [
              {
                "code": "06201",
                "name": "Добыча природного газа, кроме метана",
                "children": [],
                "path": "B/06/0620/06201/"
              },
              {
                "code": "06202",
                "name": "Добыча метана из угольных месторождений",
                "children": [],
                "path": "B/06/0620/06202/"
              }
            ],
            "path": "B/06/0620/"
          }
        ],
        "path": "B/06/"
      },
      {
        "code": "07",
        "name": "Добыча металлических руд",
        "children": [
          {
            "code": "071",
            "name": "Добыча железных руд",
            "children": [],
            "path": "B/07/071/"
          },
          {
            "code": "0710",
            "name": "Добыча железных руд",
            "children": [
              {
                "code": "07101",
                "name": "Добыча железных руд подземным способом",
                "children": [],
                "path": "B/07/0710/07101/"
              },
              {
                "code": "07102",
                "name": "Добыча железных руд открытым способом",
                "children": [],
                "path": "B/07/0710/07102/"
              },
              {
                "code": "07103",
                "name": "Обогащение и агломерация железных руд",
                "children": [],
                "path": "B/07/0710/07103/"
              }
            ],
            "path": "B/07/0710/"
          },
          {
            "code": "072",
            "name": "Добыча руд, кроме железных",
            "children": [
              {
                "code": "0721",
                "name": "Добыча урановой и ториевой руд",
                "children": [],
                "path": "B/07/072/0721/"
              },
              {
                "code": "07210",
                "name": "Добыча урановой и ториевой руд",
                "children": [],
                "path": "B/07/072/07210/"
              },
              {
                "code": "0729",
                "name": "Добыча прочих металлических руд",
                "children": [
                  {
                    "code": "07291",
                    "name": "Добыча и обогащение алюминийсодержащего сырья",
                    "children": [],
                    "path": "B/07/072/0729/07291/"
                  },
                  {
                    "code": "07292",
                    "name": "Добыча и обогащение медной руды",
                    "children": [],
                    "path": "B/07/072/0729/07292/"
                  },
                  {
                    "code": "07293",
                    "name": "Добыча и обогащение свинцово-цинковой руды",
                    "children": [],
                    "path": "B/07/072/0729/07293/"
                  },
                  {
                    "code": "07294",
                    "name": "Добыча и обогащение никель-кобальтовых руд",
                    "children": [],
                    "path": "B/07/072/0729/07294/"
                  },
                  {
                    "code": "07295",
                    "name": "Добыча и обогащение титаномагниевого сырья (руды)",
                    "children": [],
                    "path": "B/07/072/0729/07295/"
                  },
                  {
                    "code": "07296",
                    "name": "Добыча и обогащение оловянной руды",
                    "children": [],
                    "path": "B/07/072/0729/07296/"
                  },
                  {
                    "code": "07297",
                    "name": "Добыча и обогащение сурьмяно-ртутных руд",
                    "children": [],
                    "path": "B/07/072/0729/07297/"
                  },
                  {
                    "code": "07298",
                    "name": "Добыча драгоценных металлов и руд редких металлов",
                    "children": [],
                    "path": "B/07/072/0729/07298/"
                  },
                  {
                    "code": "07299",
                    "name": "Добыча и обогащение прочих металлических руд, не включенных в другие группировки",
                    "children": [],
                    "path": "B/07/072/0729/07299/"
                  }
                ],
                "path": "B/07/072/0729/"
              }
            ],
            "path": "B/07/072/"
          }
        ],
        "path": "B/07/"
      },
      {
        "code": "08",
        "name": "Добыча прочих полезных ископаемых",
        "children": [
          {
            "code": "081",
            "name": "Добыча камня, песка и глины",
            "children": [
              {
                "code": "0811",
                "name": "Добыча отделочного и строительного камня, известняка, гипса, мела и сланцев",
                "children": [
                  {
                    "code": "08111",
                    "name": "Добыча отделочного и строительного камня",
                    "children": [],
                    "path": "B/08/081/0811/08111/"
                  },
                  {
                    "code": "08112",
                    "name": "Добыча известняка, гипса и мела",
                    "children": [],
                    "path": "B/08/081/0811/08112/"
                  },
                  {
                    "code": "08113",
                    "name": "Добыча сланцев",
                    "children": [],
                    "path": "B/08/081/0811/08113/"
                  }
                ],
                "path": "B/08/081/0811/"
              },
              {
                "code": "0812",
                "name": "Разработка гравийных и песчаных карьеров, добыча глины и каолина",
                "children": [
                  {
                    "code": "08121",
                    "name": "Разработка гравийных и песчаных карьеров",
                    "children": [],
                    "path": "B/08/081/0812/08121/"
                  },
                  {
                    "code": "08122",
                    "name": "Добыча глины и каолина",
                    "children": [],
                    "path": "B/08/081/0812/08122/"
                  }
                ],
                "path": "B/08/081/0812/"
              }
            ],
            "path": "B/08/081/"
          },
          {
            "code": "089",
            "name": "Добыча полезных ископаемых, не включенных в другие группировки",
            "children": [
              {
                "code": "0891",
                "name": "Добыча минерального сырья для химической промышленности и производства удобрений",
                "children": [],
                "path": "B/08/089/0891/"
              },
              {
                "code": "08910",
                "name": "Добыча минерального сырья для химической промышленности и производства удобрений",
                "children": [],
                "path": "B/08/089/08910/"
              },
              {
                "code": "0892",
                "name": "Добыча торфа",
                "children": [],
                "path": "B/08/089/0892/"
              },
              {
                "code": "08920",
                "name": "Добыча торфа",
                "children": [],
                "path": "B/08/089/08920/"
              },
              {
                "code": "0893",
                "name": "Добыча соли",
                "children": [],
                "path": "B/08/089/0893/"
              },
              {
                "code": "08930",
                "name": "Добыча соли",
                "children": [],
                "path": "B/08/089/08930/"
              },
              {
                "code": "0899",
                "name": "Добыча прочих полезных ископаемых, не включенных в другие группировки",
                "children": [
                  {
                    "code": "08991",
                    "name": "Добыча асбестовой руды",
                    "children": [],
                    "path": "B/08/089/0899/08991/"
                  },
                  {
                    "code": "08992",
                    "name": "Добыча и обогащение неметаллических руд",
                    "children": [],
                    "path": "B/08/089/0899/08992/"
                  },
                  {
                    "code": "08993",
                    "name": "Добыча сырья для естественных и искусственных пористых заполнителей",
                    "children": [],
                    "path": "B/08/089/0899/08993/"
                  },
                  {
                    "code": "08994",
                    "name": "Добыча исходного сырья для стекольной промышленности",
                    "children": [],
                    "path": "B/08/089/0899/08994/"
                  },
                  {
                    "code": "08995",
                    "name": "Добыча драгоценных камней (кроме алмазов) и полудрагоценных камней, самоцветов и янтаря",
                    "children": [],
                    "path": "B/08/089/0899/08995/"
                  },
                  {
                    "code": "08996",
                    "name": "Добыча алмазов",
                    "children": [],
                    "path": "B/08/089/0899/08996/"
                  }
                ],
                "path": "B/08/089/0899/"
              }
            ],
            "path": "B/08/089/"
          }
        ],
        "path": "B/08/"
      },
      {
        "code": "09",
        "name": "Предоставление услуг в горнодобывающей промышленности",
        "children": [
          {
            "code": "091",
            "name": "Предоставление услуг, способствующих добыче нефти и природного газа",
            "children": [],
            "path": "B/09/091/"
          },
          {
            "code": "0910",
            "name": "Предоставление услуг, способствующих добыче нефти и природного газа",
            "children": [],
            "path": "B/09/0910/"
          },
          {
            "code": "09100",
            "name": "Предоставление услуг, способствующих добыче нефти и природного газа",
            "children": [],
            "path": "B/09/09100/"
          },
          {
            "code": "099",
            "name": "Предоставление услуг, способствующих добыче других полезных ископаемых",
            "children": [],
            "path": "B/09/099/"
          },
          {
            "code": "0990",
            "name": "Предоставление услуг, способствующих добыче других полезных ископаемых",
            "children": [],
            "path": "B/09/0990/"
          },
          {
            "code": "09900",
            "name": "Предоставление услуг, способствующих добыче других полезных ископаемых",
            "children": [],
            "path": "B/09/09900/"
          }
        ],
        "path": "B/09/"
      }
    ],
    "path": "B/"
  },
  {
    "code": "C",
    "name": "Обрабатывающая промышленность",
    "children": [
      {
        "code": "10",
        "name": "Производство продуктов питания",
        "children": [
          {
            "code": "101",
            "name": "Переработка и консервирование мяса и производство мясной продукции",
            "children": [
              {
                "code": "1011",
                "name": "Переработка и консервирование мяса",
                "children": [],
                "path": "C/10/101/1011/"
              },
              {
                "code": "10110",
                "name": "Переработка и консервирование мяса",
                "children": [],
                "path": "C/10/101/10110/"
              },
              {
                "code": "1012",
                "name": "Переработка и консервирование мяса сельскохозяйственной птицы",
                "children": [],
                "path": "C/10/101/1012/"
              },
              {
                "code": "10120",
                "name": "Переработка и консервирование мяса сельскохозяйственной птицы",
                "children": [],
                "path": "C/10/101/10120/"
              },
              {
                "code": "1013",
                "name": "Производство продуктов из мяса и мяса сельскохозяйственной птицы",
                "children": [],
                "path": "C/10/101/1013/"
              },
              {
                "code": "10130",
                "name": "Производство продуктов из мяса и мяса сельскохозяйственной птицы",
                "children": [],
                "path": "C/10/101/10130/"
              }
            ],
            "path": "C/10/101/"
          },
          {
            "code": "102",
            "name": "Переработка и консервирование рыбы, ракообразных и моллюсков",
            "children": [],
            "path": "C/10/102/"
          },
          {
            "code": "1020",
            "name": "Переработка и консервирование рыбы, ракообразных и моллюсков",
            "children": [],
            "path": "C/10/1020/"
          },
          {
            "code": "10200",
            "name": "Переработка и консервирование рыбы, ракообразных и моллюсков",
            "children": [],
            "path": "C/10/10200/"
          },
          {
            "code": "103",
            "name": "Переработка и консервирование фруктов и овощей",
            "children": [
              {
                "code": "1031",
                "name": "Переработка и консервирование картофеля",
                "children": [],
                "path": "C/10/103/1031/"
              },
              {
                "code": "10310",
                "name": "Переработка и консервирование картофеля",
                "children": [],
                "path": "C/10/103/10310/"
              },
              {
                "code": "1032",
                "name": "Производство фруктовых и овощных соков",
                "children": [],
                "path": "C/10/103/1032/"
              },
              {
                "code": "10320",
                "name": "Производство фруктовых и овощных соков",
                "children": [],
                "path": "C/10/103/10320/"
              },
              {
                "code": "1039",
                "name": "Прочие виды переработки и консервирования фруктов и овощей",
                "children": [],
                "path": "C/10/103/1039/"
              },
              {
                "code": "10390",
                "name": "Прочие виды переработки и консервирования фруктов и овощей",
                "children": [],
                "path": "C/10/103/10390/"
              }
            ],
            "path": "C/10/103/"
          },
          {
            "code": "104",
            "name": "Производство растительных и животных масел и жиров",
            "children": [
              {
                "code": "1041",
                "name": "Производство масел и жиров",
                "children": [
                  {
                    "code": "10411",
                    "name": "Производство неочищенных масел и жиров",
                    "children": [],
                    "path": "C/10/104/1041/10411/"
                  },
                  {
                    "code": "10412",
                    "name": "Производство рафинированных масел и жиров",
                    "children": [],
                    "path": "C/10/104/1041/10412/"
                  }
                ],
                "path": "C/10/104/1041/"
              },
              {
                "code": "1042",
                "name": "Производство маргарина и аналогичных пищевых жиров",
                "children": [],
                "path": "C/10/104/1042/"
              },
              {
                "code": "10420",
                "name": "Производство маргарина и аналогичных пищевых жиров",
                "children": [],
                "path": "C/10/104/10420/"
              }
            ],
            "path": "C/10/104/"
          },
          {
            "code": "105",
            "name": "Производство молочных продуктов",
            "children": [
              {
                "code": "1051",
                "name": "Переработка молока и производство сыров",
                "children": [
                  {
                    "code": "10511",
                    "name": "Переработка молока, кроме консервирования, и производство сыров",
                    "children": [],
                    "path": "C/10/105/1051/10511/"
                  },
                  {
                    "code": "10512",
                    "name": "Производство молочных консервов",
                    "children": [],
                    "path": "C/10/105/1051/10512/"
                  }
                ],
                "path": "C/10/105/1051/"
              },
              {
                "code": "1052",
                "name": "Производство мороженого",
                "children": [],
                "path": "C/10/105/1052/"
              },
              {
                "code": "10520",
                "name": "Производство мороженого",
                "children": [],
                "path": "C/10/105/10520/"
              }
            ],
            "path": "C/10/105/"
          },
          {
            "code": "106",
            "name": "Производство мукомольно-крупяных продуктов, крахмалов и крахмальных продуктов",
            "children": [
              {
                "code": "1061",
                "name": "Производство мукомольно-крупяных продуктов",
                "children": [
                  {
                    "code": "10611",
                    "name": "Производство муки",
                    "children": [],
                    "path": "C/10/106/1061/10611/"
                  },
                  {
                    "code": "10612",
                    "name": "Производство круп",
                    "children": [],
                    "path": "C/10/106/1061/10612/"
                  },
                  {
                    "code": "10613",
                    "name": "Производство пищевых концентратов",
                    "children": [],
                    "path": "C/10/106/1061/10613/"
                  }
                ],
                "path": "C/10/106/1061/"
              },
              {
                "code": "1062",
                "name": "Производство крахмала и продукции из крахмала",
                "children": [],
                "path": "C/10/106/1062/"
              },
              {
                "code": "10620",
                "name": "Производство крахмала и продукции из крахмала",
                "children": [],
                "path": "C/10/106/10620/"
              }
            ],
            "path": "C/10/106/"
          },
          {
            "code": "107",
            "name": "Производство хлебобулочных, макаронных и мучных кондитерских изделий",
            "children": [
              {
                "code": "1071",
                "name": "Производство хлебобулочных и мучных кондитерских изделий недлительного хранения",
                "children": [],
                "path": "C/10/107/1071/"
              },
              {
                "code": "10710",
                "name": "Производство хлебобулочных и мучных кондитерских изделий недлительного хранения",
                "children": [],
                "path": "C/10/107/10710/"
              },
              {
                "code": "1072",
                "name": "Производство сухарей и печенья, мучных кондитерских изделий длительного хранения",
                "children": [],
                "path": "C/10/107/1072/"
              },
              {
                "code": "10720",
                "name": "Производство сухарей и печенья, мучных кондитерских изделий длительного хранения",
                "children": [],
                "path": "C/10/107/10720/"
              },
              {
                "code": "1073",
                "name": "Производство макаронных изделий",
                "children": [],
                "path": "C/10/107/1073/"
              },
              {
                "code": "10730",
                "name": "Производство макаронных изделий",
                "children": [],
                "path": "C/10/107/10730/"
              }
            ],
            "path": "C/10/107/"
          },
          {
            "code": "108",
            "name": "Производство прочих продуктов питания",
            "children": [
              {
                "code": "1081",
                "name": "Производство сахара",
                "children": [],
                "path": "C/10/108/1081/"
              },
              {
                "code": "10810",
                "name": "Производство сахара",
                "children": [],
                "path": "C/10/108/10810/"
              },
              {
                "code": "1082",
                "name": "Производство какао, шоколада и сахаристых кондитерских изделий",
                "children": [],
                "path": "C/10/108/1082/"
              },
              {
                "code": "10820",
                "name": "Производство какао, шоколада и сахаристых кондитерских изделий",
                "children": [],
                "path": "C/10/108/10820/"
              },
              {
                "code": "1083",
                "name": "Производство чая и кофе",
                "children": [],
                "path": "C/10/108/1083/"
              },
              {
                "code": "10830",
                "name": "Производство чая и кофе",
                "children": [],
                "path": "C/10/108/10830/"
              },
              {
                "code": "1084",
                "name": "Производство пряностей и приправ",
                "children": [],
                "path": "C/10/108/1084/"
              },
              {
                "code": "10840",
                "name": "Производство пряностей и приправ",
                "children": [],
                "path": "C/10/108/10840/"
              },
              {
                "code": "1085",
                "name": "Производство готовых пищевых продуктов",
                "children": [],
                "path": "C/10/108/1085/"
              },
              {
                "code": "10850",
                "name": "Производство готовых пищевых продуктов",
                "children": [],
                "path": "C/10/108/10850/"
              },
              {
                "code": "1086",
                "name": "Производство детского питания и диетических пищевых продуктов",
                "children": [],
                "path": "C/10/108/1086/"
              },
              {
                "code": "10860",
                "name": "Производство детского питания и диетических пищевых продуктов",
                "children": [],
                "path": "C/10/108/10860/"
              },
              {
                "code": "1089",
                "name": "Производство прочих продуктов питания, не включенных в другие группировки",
                "children": [
                  {
                    "code": "10891",
                    "name": "Производство супов, бульонов и яйцепродуктов",
                    "children": [],
                    "path": "C/10/108/1089/10891/"
                  },
                  {
                    "code": "10892",
                    "name": "Производство дрожжей",
                    "children": [],
                    "path": "C/10/108/1089/10892/"
                  },
                  {
                    "code": "10899",
                    "name": "Производство прочих пищевых продуктов, не включенных в другие группировки",
                    "children": [],
                    "path": "C/10/108/1089/10899/"
                  }
                ],
                "path": "C/10/108/1089/"
              }
            ],
            "path": "C/10/108/"
          },
          {
            "code": "109",
            "name": "Производство готовых кормов для животных",
            "children": [
              {
                "code": "1091",
                "name": "Производство готовых кормов для сельскохозяйственных животных",
                "children": [],
                "path": "C/10/109/1091/"
              },
              {
                "code": "10910",
                "name": "Производство готовых кормов для сельскохозяйственных животных",
                "children": [],
                "path": "C/10/109/10910/"
              },
              {
                "code": "1092",
                "name": "Производство готовых кормов для домашних животных",
                "children": [],
                "path": "C/10/109/1092/"
              },
              {
                "code": "10920",
                "name": "Производство готовых кормов для домашних животных",
                "children": [],
                "path": "C/10/109/10920/"
              }
            ],
            "path": "C/10/109/"
          },
          {
            "code": "11",
            "name": "Производство напитков",
            "children": [],
            "path": "C/10/11/"
          },
          {
            "code": "12",
            "name": "Производство табачных изделий",
            "children": [],
            "path": "C/10/12/"
          },
          {
            "code": "13",
            "name": "Производство текстильных изделий",
            "children": [
              {
                "code": "131",
                "name": "Подготовка и прядение текстильных волокон",
                "children": [],
                "path": "C/10/13/131/"
              },
              {
                "code": "1310",
                "name": "Подготовка и прядение текстильных волокон",
                "children": [
                  {
                    "code": "13101",
                    "name": "Подготовка хлопчатобумажного волокна, хлопка-волокна",
                    "children": [],
                    "path": "C/10/13/1310/13101/"
                  },
                  {
                    "code": "13102",
                    "name": "Прядение хлопчатобумажного волокна, хлопка-волокна",
                    "children": [],
                    "path": "C/10/13/1310/13102/"
                  },
                  {
                    "code": "13103",
                    "name": "Подготовка шерстяного волокна",
                    "children": [],
                    "path": "C/10/13/1310/13103/"
                  },
                  {
                    "code": "13104",
                    "name": "Прядение шерстяного волокна",
                    "children": [],
                    "path": "C/10/13/1310/13104/"
                  },
                  {
                    "code": "13105",
                    "name": "Подготовка льняного и прочих растительных волокон",
                    "children": [],
                    "path": "C/10/13/1310/13105/"
                  },
                  {
                    "code": "13106",
                    "name": "Прядение льняного и прочих растительных волокон",
                    "children": [],
                    "path": "C/10/13/1310/13106/"
                  },
                  {
                    "code": "13107",
                    "name": "Подготовка шелкового волокна",
                    "children": [],
                    "path": "C/10/13/1310/13107/"
                  },
                  {
                    "code": "13108",
                    "name": "Производство шелковой пряжи",
                    "children": [],
                    "path": "C/10/13/1310/13108/"
                  },
                  {
                    "code": "13109",
                    "name": "Производство швейных ниток",
                    "children": [],
                    "path": "C/10/13/1310/13109/"
                  }
                ],
                "path": "C/10/13/1310/"
              },
              {
                "code": "132",
                "name": "Ткацкое производство",
                "children": [],
                "path": "C/10/13/132/"
              },
              {
                "code": "1320",
                "name": "Ткацкое производство",
                "children": [
                  {
                    "code": "13201",
                    "name": "Производство хлопчатобумажных тканей",
                    "children": [],
                    "path": "C/10/13/1320/13201/"
                  },
                  {
                    "code": "13202",
                    "name": "Производство шерстяных тканей",
                    "children": [],
                    "path": "C/10/13/1320/13202/"
                  },
                  {
                    "code": "13203",
                    "name": "Производство шелковых тканей",
                    "children": [],
                    "path": "C/10/13/1320/13203/"
                  },
                  {
                    "code": "13204",
                    "name": "Производство льняных тканей",
                    "children": [],
                    "path": "C/10/13/1320/13204/"
                  },
                  {
                    "code": "13209",
                    "name": "Производство прочих тканей",
                    "children": [],
                    "path": "C/10/13/1320/13209/"
                  }
                ],
                "path": "C/10/13/1320/"
              },
              {
                "code": "133",
                "name": "Отделка тканей и текстильных изделий",
                "children": [],
                "path": "C/10/13/133/"
              },
              {
                "code": "1330",
                "name": "Отделка тканей и текстильных изделий",
                "children": [],
                "path": "C/10/13/1330/"
              },
              {
                "code": "13300",
                "name": "Отделка тканей и текстильных изделий",
                "children": [],
                "path": "C/10/13/13300/"
              },
              {
                "code": "139",
                "name": "Производство прочих текстильных изделий",
                "children": [
                  {
                    "code": "1391",
                    "name": "Производство вязаного и трикотажного полотна",
                    "children": [
                      {
                        "code": "13911",
                        "name": "Производство и обработка вязаного и трикотажного полотна",
                        "children": [],
                        "path": "C/10/13/139/1391/13911/"
                      },
                      {
                        "code": "13912",
                        "name": "Производство искусственного меха",
                        "children": [],
                        "path": "C/10/13/139/1391/13912/"
                      }
                    ],
                    "path": "C/10/13/139/1391/"
                  },
                  {
                    "code": "1392",
                    "name": "Производство готовых текстильных изделий, кроме одежды",
                    "children": [],
                    "path": "C/10/13/139/1392/"
                  },
                  {
                    "code": "13920",
                    "name": "Производство готовых текстильных изделий, кроме одежды",
                    "children": [],
                    "path": "C/10/13/139/13920/"
                  },
                  {
                    "code": "1393",
                    "name": "Производство ковров и ковровых изделий",
                    "children": [],
                    "path": "C/10/13/139/1393/"
                  },
                  {
                    "code": "13930",
                    "name": "Производство ковров и ковровых изделий",
                    "children": [],
                    "path": "C/10/13/139/13930/"
                  },
                  {
                    "code": "1394",
                    "name": "Производство веревок, канатов, бечевок, шпагата и сетей",
                    "children": [
                      {
                        "code": "13941",
                        "name": "Производство веревок, канатов, бечевок, шпагата",
                        "children": [],
                        "path": "C/10/13/139/1394/13941/"
                      },
                      {
                        "code": "13942",
                        "name": "Производство сетей и изделий из веревок",
                        "children": [],
                        "path": "C/10/13/139/1394/13942/"
                      }
                    ],
                    "path": "C/10/13/139/1394/"
                  },
                  {
                    "code": "1395",
                    "name": "Производство нетканых текстильных изделий, кроме одежды",
                    "children": [],
                    "path": "C/10/13/139/1395/"
                  },
                  {
                    "code": "13950",
                    "name": "Производство нетканых текстильных изделий, кроме одежды",
                    "children": [],
                    "path": "C/10/13/139/13950/"
                  },
                  {
                    "code": "1396",
                    "name": "Производство прочих текстильных изделий технического и производственного назначения",
                    "children": [],
                    "path": "C/10/13/139/1396/"
                  },
                  {
                    "code": "13960",
                    "name": "Производство прочих текстильных изделий технического и производственного назначения",
                    "children": [],
                    "path": "C/10/13/139/13960/"
                  },
                  {
                    "code": "1399",
                    "name": "Производство прочих текстильных изделий, не включенных в другие группировки",
                    "children": [
                      {
                        "code": "13991",
                        "name": "Производство текстильной галантереи",
                        "children": [],
                        "path": "C/10/13/139/1399/13991/"
                      },
                      {
                        "code": "13992",
                        "name": "Производство валяльно-войлочных изделий",
                        "children": [],
                        "path": "C/10/13/139/1399/13992/"
                      },
                      {
                        "code": "13999",
                        "name": "Производство других текстильных изделий, не включенных в другие группировки",
                        "children": [],
                        "path": "C/10/13/139/1399/13999/"
                      }
                    ],
                    "path": "C/10/13/139/1399/"
                  }
                ],
                "path": "C/10/13/139/"
              }
            ],
            "path": "C/10/13/"
          },
          {
            "code": "14",
            "name": "Производство одежды",
            "children": [
              {
                "code": "141",
                "name": "Производство одежды, кроме одежды из меха",
                "children": [
                  {
                    "code": "1411",
                    "name": "Производство одежды из кожи",
                    "children": [],
                    "path": "C/10/14/141/1411/"
                  },
                  {
                    "code": "14110",
                    "name": "Производство одежды из кожи",
                    "children": [],
                    "path": "C/10/14/141/14110/"
                  },
                  {
                    "code": "1412",
                    "name": "Производство спецодежды",
                    "children": [],
                    "path": "C/10/14/141/1412/"
                  },
                  {
                    "code": "14120",
                    "name": "Производство спецодежды",
                    "children": [],
                    "path": "C/10/14/141/14120/"
                  },
                  {
                    "code": "1413",
                    "name": "Производство прочей верхней одежды",
                    "children": [],
                    "path": "C/10/14/141/1413/"
                  },
                  {
                    "code": "14130",
                    "name": "Производство прочей верхней одежды",
                    "children": [],
                    "path": "C/10/14/141/14130/"
                  },
                  {
                    "code": "1414",
                    "name": "Производство нижнего белья",
                    "children": [],
                    "path": "C/10/14/141/1414/"
                  },
                  {
                    "code": "14140",
                    "name": "Производство нижнего белья",
                    "children": [],
                    "path": "C/10/14/141/14140/"
                  },
                  {
                    "code": "1419",
                    "name": "Производство прочих видов одежды и аксессуаров",
                    "children": [
                      {
                        "code": "14191",
                        "name": "Производство головных уборов",
                        "children": [],
                        "path": "C/10/14/141/1419/14191/"
                      },
                      {
                        "code": "14199",
                        "name": "Производство прочих видов одежды и аксессуаров, не включенных в другие группировки",
                        "children": [],
                        "path": "C/10/14/141/1419/14199/"
                      }
                    ],
                    "path": "C/10/14/141/1419/"
                  }
                ],
                "path": "C/10/14/141/"
              },
              {
                "code": "142",
                "name": "Производство меховых изделий",
                "children": [],
                "path": "C/10/14/142/"
              },
              {
                "code": "1420",
                "name": "Производство меховых изделий",
                "children": [],
                "path": "C/10/14/1420/"
              },
              {
                "code": "14200",
                "name": "Производство меховых изделий",
                "children": [],
                "path": "C/10/14/14200/"
              },
              {
                "code": "143",
                "name": "Производство вязаной и трикотажной одежды",
                "children": [
                  {
                    "code": "1431",
                    "name": "Производство вязаных и трикотажных чулочно-носочных изделий",
                    "children": [],
                    "path": "C/10/14/143/1431/"
                  },
                  {
                    "code": "14310",
                    "name": "Производство вязаных и трикотажных чулочно-носочных изделий",
                    "children": [],
                    "path": "C/10/14/143/14310/"
                  },
                  {
                    "code": "1439",
                    "name": "Производство прочей вязаной и трикотажной одежды",
                    "children": [],
                    "path": "C/10/14/143/1439/"
                  },
                  {
                    "code": "14390",
                    "name": "Производство прочей вязаной и трикотажной одежды",
                    "children": [],
                    "path": "C/10/14/143/14390/"
                  }
                ],
                "path": "C/10/14/143/"
              }
            ],
            "path": "C/10/14/"
          },
          {
            "code": "15",
            "name": "Производство кожаной и относящейся к ней продукции",
            "children": [
              {
                "code": "151",
                "name": "Дубление и выделка кожи; производство дорожных принадлежностей, шорно-седельных изделий; выделка и крашение меха",
                "children": [
                  {
                    "code": "1511",
                    "name": "Дубление и выделка кожи; выделка и крашение меха",
                    "children": [
                      {
                        "code": "15111",
                        "name": "Дубление и выделка кожи",
                        "children": [],
                        "path": "C/10/15/151/1511/15111/"
                      },
                      {
                        "code": "15112",
                        "name": "Производство искусственных кож и пленочных материалов",
                        "children": [],
                        "path": "C/10/15/151/1511/15112/"
                      },
                      {
                        "code": "15113",
                        "name": "Выделка и крашение меха",
                        "children": [],
                        "path": "C/10/15/151/1511/15113/"
                      }
                    ],
                    "path": "C/10/15/151/1511/"
                  },
                  {
                    "code": "1512",
                    "name": "Производство дорожных принадлежностей, шорно-седельных изделий",
                    "children": [
                      {
                        "code": "15121",
                        "name": "Производство дорожных принадлежностей и аналогичных изделий",
                        "children": [],
                        "path": "C/10/15/151/1512/15121/"
                      },
                      {
                        "code": "15122",
                        "name": "Производство шорно-седельных изделий",
                        "children": [],
                        "path": "C/10/15/151/1512/15122/"
                      }
                    ],
                    "path": "C/10/15/151/1512/"
                  }
                ],
                "path": "C/10/15/151/"
              },
              {
                "code": "152",
                "name": "Производство обуви",
                "children": [],
                "path": "C/10/15/152/"
              },
              {
                "code": "1520",
                "name": "Производство обуви",
                "children": [],
                "path": "C/10/15/1520/"
              },
              {
                "code": "15200",
                "name": "Производство обуви",
                "children": [],
                "path": "C/10/15/15200/"
              }
            ],
            "path": "C/10/15/"
          },
          {
            "code": "16",
            "name": "Производство деревянных и пробковых изделий, кроме мебели; производство изделий из соломки и материалов для плетения",
            "children": [
              {
                "code": "161",
                "name": "Лесопильное и строгальное производство",
                "children": [],
                "path": "C/10/16/161/"
              },
              {
                "code": "1610",
                "name": "Лесопильное и строгальное производство",
                "children": [
                  {
                    "code": "16101",
                    "name": "Распиловка и строгание древесины",
                    "children": [],
                    "path": "C/10/16/1610/16101/"
                  },
                  {
                    "code": "16102",
                    "name": "Антисептирование древесины",
                    "children": [],
                    "path": "C/10/16/1610/16102/"
                  },
                  {
                    "code": "16103",
                    "name": "Производство сборных деревянных покрытий",
                    "children": [],
                    "path": "C/10/16/1610/16103/"
                  }
                ],
                "path": "C/10/16/1610/"
              },
              {
                "code": "162",
                "name": "Производство изделий из древесины, пробки, соломки и материалов для плетения",
                "children": [
                  {
                    "code": "1621",
                    "name": "Производство шпона, фанеры, плит и панелей из древесины",
                    "children": [],
                    "path": "C/10/16/162/1621/"
                  },
                  {
                    "code": "16210",
                    "name": "Производство шпона, фанеры, плит и панелей из древесины",
                    "children": [],
                    "path": "C/10/16/162/16210/"
                  },
                  {
                    "code": "1622",
                    "name": "Производство сборных паркетных покрытий",
                    "children": [],
                    "path": "C/10/16/162/1622/"
                  },
                  {
                    "code": "16220",
                    "name": "Производство сборных паркетных покрытий",
                    "children": [],
                    "path": "C/10/16/162/16220/"
                  },
                  {
                    "code": "1623",
                    "name": "Производство прочих деревянных строительных конструкций и столярных изделий",
                    "children": [
                      {
                        "code": "16231",
                        "name": "Производство деревянных изделий для строительства",
                        "children": [],
                        "path": "C/10/16/162/1623/16231/"
                      },
                      {
                        "code": "16232",
                        "name": "Производство сборных домов, преимущественно из дерева",
                        "children": [],
                        "path": "C/10/16/162/1623/16232/"
                      },
                      {
                        "code": "16233",
                        "name": "Производство деревянных контейнерных, цельноперевозных и сборно-разборных зданий и помещений",
                        "children": [],
                        "path": "C/10/16/162/1623/16233/"
                      }
                    ],
                    "path": "C/10/16/162/1623/"
                  },
                  {
                    "code": "1624",
                    "name": "Производство деревянной тары",
                    "children": [],
                    "path": "C/10/16/162/1624/"
                  },
                  {
                    "code": "16240",
                    "name": "Производство деревянной тары",
                    "children": [],
                    "path": "C/10/16/162/16240/"
                  },
                  {
                    "code": "1629",
                    "name": "Производство прочих деревянных изделий; производство изделий из пробки, соломки и материалов для плетения",
                    "children": [
                      {
                        "code": "16291",
                        "name": "Производство разных деревянных изделий",
                        "children": [],
                        "path": "C/10/16/162/1629/16291/"
                      },
                      {
                        "code": "16292",
                        "name": "Производство декоративных изделий из дерева",
                        "children": [],
                        "path": "C/10/16/162/1629/16292/"
                      },
                      {
                        "code": "16293",
                        "name": "Производство изделий из пробки, соломки и материалов для плетения",
                        "children": [],
                        "path": "C/10/16/162/1629/16293/"
                      }
                    ],
                    "path": "C/10/16/162/1629/"
                  }
                ],
                "path": "C/10/16/162/"
              }
            ],
            "path": "C/10/16/"
          },
          {
            "code": "17",
            "name": "Производство бумаги и бумажной продукции",
            "children": [
              {
                "code": "171",
                "name": "Производство древесной массы и целлюлозы, бумаги и картона",
                "children": [
                  {
                    "code": "1711",
                    "name": "Производство древесной массы и целлюлозы",
                    "children": [],
                    "path": "C/10/17/171/1711/"
                  },
                  {
                    "code": "17110",
                    "name": "Производство древесной массы и целлюлозы",
                    "children": [],
                    "path": "C/10/17/171/17110/"
                  },
                  {
                    "code": "1712",
                    "name": "Производство бумаги и картона",
                    "children": [],
                    "path": "C/10/17/171/1712/"
                  },
                  {
                    "code": "17120",
                    "name": "Производство бумаги и картона",
                    "children": [],
                    "path": "C/10/17/171/17120/"
                  }
                ],
                "path": "C/10/17/171/"
              },
              {
                "code": "172",
                "name": "Производство изделий из бумаги и картона",
                "children": [
                  {
                    "code": "1721",
                    "name": "Производство гофрированной бумаги и картона, бумажной и картонной тары",
                    "children": [
                      {
                        "code": "17211",
                        "name": "Производство гофрированной бумаги и картона",
                        "children": [],
                        "path": "C/10/17/172/1721/17211/"
                      },
                      {
                        "code": "17212",
                        "name": "Производство бумажной и картонной тары",
                        "children": [],
                        "path": "C/10/17/172/1721/17212/"
                      }
                    ],
                    "path": "C/10/17/172/1721/"
                  },
                  {
                    "code": "1722",
                    "name": "Производство бумажных изделий хозяйственно-бытового и санитарно-гигиенического назначения",
                    "children": [],
                    "path": "C/10/17/172/1722/"
                  },
                  {
                    "code": "17220",
                    "name": "Производство бумажных изделий хозяйственно-бытового и санитарно-гигиенического назначения",
                    "children": [],
                    "path": "C/10/17/172/17220/"
                  },
                  {
                    "code": "1723",
                    "name": "Производство писчебумажных изделий",
                    "children": [],
                    "path": "C/10/17/172/1723/"
                  },
                  {
                    "code": "17230",
                    "name": "Производство писчебумажных изделий",
                    "children": [],
                    "path": "C/10/17/172/17230/"
                  },
                  {
                    "code": "1724",
                    "name": "Производство обоев",
                    "children": [],
                    "path": "C/10/17/172/1724/"
                  },
                  {
                    "code": "17240",
                    "name": "Производство обоев",
                    "children": [],
                    "path": "C/10/17/172/17240/"
                  },
                  {
                    "code": "1729",
                    "name": "Производство прочих изделий из бумаги и картона",
                    "children": [],
                    "path": "C/10/17/172/1729/"
                  },
                  {
                    "code": "17290",
                    "name": "Производство прочих изделий из бумаги и картона",
                    "children": [],
                    "path": "C/10/17/172/17290/"
                  }
                ],
                "path": "C/10/17/172/"
              }
            ],
            "path": "C/10/17/"
          },
          {
            "code": "18",
            "name": "Полиграфическая деятельность и воспроизведение записанных носителей информации",
            "children": [
              {
                "code": "181",
                "name": "Полиграфическая деятельность и предоставление услуг в этой области",
                "children": [
                  {
                    "code": "1811",
                    "name": "Печатание газет",
                    "children": [],
                    "path": "C/10/18/181/1811/"
                  },
                  {
                    "code": "18110",
                    "name": "Печатание газет",
                    "children": [],
                    "path": "C/10/18/181/18110/"
                  },
                  {
                    "code": "1812",
                    "name": "Прочие виды печатного производства",
                    "children": [],
                    "path": "C/10/18/181/1812/"
                  },
                  {
                    "code": "18120",
                    "name": "Прочие виды печатного производства",
                    "children": [],
                    "path": "C/10/18/181/18120/"
                  },
                  {
                    "code": "1813",
                    "name": "Деятельность по подготовке материалов к печати и рапространению",
                    "children": [],
                    "path": "C/10/18/181/1813/"
                  },
                  {
                    "code": "18130",
                    "name": "Деятельность по подготовке материалов к печати и рапространению",
                    "children": [],
                    "path": "C/10/18/181/18130/"
                  },
                  {
                    "code": "1814",
                    "name": "Брошюровочно-переплетная, отделочная деятельность и сопутствующие услуги",
                    "children": [],
                    "path": "C/10/18/181/1814/"
                  },
                  {
                    "code": "18140",
                    "name": "Брошюровочно-переплетная, отделочная деятельность и сопутствующие услуги",
                    "children": [],
                    "path": "C/10/18/181/18140/"
                  }
                ],
                "path": "C/10/18/181/"
              },
              {
                "code": "182",
                "name": "Воспроизведение записанных носителей информации",
                "children": [],
                "path": "C/10/18/182/"
              },
              {
                "code": "1820",
                "name": "Воспроизведение записанных носителей информации",
                "children": [
                  {
                    "code": "18201",
                    "name": "Воспроизведение звукозаписей",
                    "children": [],
                    "path": "C/10/18/1820/18201/"
                  },
                  {
                    "code": "18202",
                    "name": "Воспроизведение видеозаписей",
                    "children": [],
                    "path": "C/10/18/1820/18202/"
                  },
                  {
                    "code": "18203",
                    "name": "Воспроизведение программного обеспечения и баз данных",
                    "children": [],
                    "path": "C/10/18/1820/18203/"
                  }
                ],
                "path": "C/10/18/1820/"
              }
            ],
            "path": "C/10/18/"
          },
          {
            "code": "19",
            "name": "Производство кокса и продуктов нефтепереработки",
            "children": [
              {
                "code": "191",
                "name": "Производство продукции коксовых печей",
                "children": [],
                "path": "C/10/19/191/"
              },
              {
                "code": "1910",
                "name": "Производство продукции коксовых печей",
                "children": [],
                "path": "C/10/19/1910/"
              },
              {
                "code": "19100",
                "name": "Производство продукции коксовых печей",
                "children": [],
                "path": "C/10/19/19100/"
              },
              {
                "code": "192",
                "name": "Производство продуктов нефтепереработки,брикетов из торфа и угля",
                "children": [],
                "path": "C/10/19/192/"
              },
              {
                "code": "1920",
                "name": "Производство продуктов нефтепереработки,брикетов из торфа и угля",
                "children": [
                  {
                    "code": "19201",
                    "name": "Производство продуктов нефтепереработки",
                    "children": [],
                    "path": "C/10/19/1920/19201/"
                  },
                  {
                    "code": "19202",
                    "name": "Агломерация торфа и производство торфяных брикетов",
                    "children": [],
                    "path": "C/10/19/1920/19202/"
                  },
                  {
                    "code": "19203",
                    "name": "Агломерация и производство брикетов из каменного угля",
                    "children": [],
                    "path": "C/10/19/1920/19203/"
                  },
                  {
                    "code": "19204",
                    "name": "Агломерация и производство брикетов из лигнита",
                    "children": [],
                    "path": "C/10/19/1920/19204/"
                  }
                ],
                "path": "C/10/19/1920/"
              }
            ],
            "path": "C/10/19/"
          }
        ],
        "path": "C/10/"
      },
      {
        "code": "110",
        "name": "Производство напитков",
        "children": [
          {
            "code": "1101",
            "name": "Дистилляция, ректификация и смешивание спиртных напитков",
            "children": [],
            "path": "C/110/1101/"
          },
          {
            "code": "11010",
            "name": "Дистилляция, ректификация и смешивание спиртных напитков",
            "children": [],
            "path": "C/110/11010/"
          },
          {
            "code": "1102",
            "name": "Производство вина из винограда",
            "children": [
              {
                "code": "11021",
                "name": "Производство вина из винограда собственного производства",
                "children": [],
                "path": "C/110/1102/11021/"
              },
              {
                "code": "11022",
                "name": "Производство вина из винограда несобственного производства",
                "children": [],
                "path": "C/110/1102/11022/"
              }
            ],
            "path": "C/110/1102/"
          },
          {
            "code": "1103",
            "name": "Производство сидра и прочих плодовых вин",
            "children": [],
            "path": "C/110/1103/"
          },
          {
            "code": "11030",
            "name": "Производство сидра и прочих плодовых вин",
            "children": [],
            "path": "C/110/11030/"
          },
          {
            "code": "1104",
            "name": "Производство прочих недистиллированных напитков из сброженного материала",
            "children": [],
            "path": "C/110/1104/"
          },
          {
            "code": "11040",
            "name": "Производство прочих недистиллированных напитков из сброженного материала",
            "children": [],
            "path": "C/110/11040/"
          },
          {
            "code": "1105",
            "name": "Производство пива",
            "children": [],
            "path": "C/110/1105/"
          },
          {
            "code": "11050",
            "name": "Производство пива",
            "children": [],
            "path": "C/110/11050/"
          },
          {
            "code": "1106",
            "name": "Производство солода",
            "children": [],
            "path": "C/110/1106/"
          },
          {
            "code": "11060",
            "name": "Производство солода",
            "children": [],
            "path": "C/110/11060/"
          },
          {
            "code": "1107",
            "name": "Производство безалкогольных напитков, минеральных вод и других вод в бутылках",
            "children": [],
            "path": "C/110/1107/"
          },
          {
            "code": "11070",
            "name": "Производство безалкогольных напитков, минеральных вод и других вод в бутылках",
            "children": [],
            "path": "C/110/11070/"
          }
        ],
        "path": "C/110/"
      },
      {
        "code": "120",
        "name": "Производство табачных изделий",
        "children": [],
        "path": "C/120/"
      },
      {
        "code": "1200",
        "name": "Производство табачных изделий",
        "children": [
          {
            "code": "12001",
            "name": "Ферментация табака",
            "children": [],
            "path": "C/1200/12001/"
          },
          {
            "code": "12002",
            "name": "Производство изделий из табака",
            "children": [],
            "path": "C/1200/12002/"
          }
        ],
        "path": "C/1200/"
      },
      {
        "code": "20",
        "name": "Производство продуктов химической промышленности",
        "children": [
          {
            "code": "201",
            "name": "Производство основных химических веществ, удобрений и азотных соединений, пластмасс и синтетического каучука в первичных формах",
            "children": [
              {
                "code": "2011",
                "name": "Производство промышленных газов",
                "children": [],
                "path": "C/20/201/2011/"
              },
              {
                "code": "20110",
                "name": "Производство промышленных газов",
                "children": [],
                "path": "C/20/201/20110/"
              },
              {
                "code": "2012",
                "name": "Производство красителей и пигментов",
                "children": [],
                "path": "C/20/201/2012/"
              },
              {
                "code": "20120",
                "name": "Производство красителей и пигментов",
                "children": [],
                "path": "C/20/201/20120/"
              },
              {
                "code": "2013",
                "name": "Производство прочих основных неорганических химических веществ",
                "children": [],
                "path": "C/20/201/2013/"
              },
              {
                "code": "20130",
                "name": "Производство прочих основных неорганических химических веществ",
                "children": [],
                "path": "C/20/201/20130/"
              },
              {
                "code": "2014",
                "name": "Производство прочих основных органических химических веществ",
                "children": [
                  {
                    "code": "20141",
                    "name": "Производство дубильных веществ",
                    "children": [],
                    "path": "C/20/201/2014/20141/"
                  },
                  {
                    "code": "20142",
                    "name": "Производство биоэтанола",
                    "children": [],
                    "path": "C/20/201/2014/20142/"
                  },
                  {
                    "code": "20143",
                    "name": "Производство ациклических и циклических углеводородов из углеводородного сырья",
                    "children": [],
                    "path": "C/20/201/2014/20143/"
                  },
                  {
                    "code": "20144",
                    "name": "Производство простых эфиров из углеводородного сырья",
                    "children": [],
                    "path": "C/20/201/2014/20144/"
                  },
                  {
                    "code": "20149",
                    "name": "Производство прочих основных органических химических веществ, не включенных в другие группировки",
                    "children": [],
                    "path": "C/20/201/2014/20149/"
                  }
                ],
                "path": "C/20/201/2014/"
              },
              {
                "code": "2015",
                "name": "Производство удобрений и азотосодержащих соединений",
                "children": [
                  {
                    "code": "20151",
                    "name": "Производство удобрений",
                    "children": [],
                    "path": "C/20/201/2015/20151/"
                  },
                  {
                    "code": "20152",
                    "name": "Производство азотосодержащих соединений",
                    "children": [],
                    "path": "C/20/201/2015/20152/"
                  }
                ],
                "path": "C/20/201/2015/"
              },
              {
                "code": "2016",
                "name": "Производство пластмасс в первичных формах",
                "children": [
                  {
                    "code": "20161",
                    "name": "Производство пластмасс в первичных формах, кроме полимеров из углеводородного сырья",
                    "children": [],
                    "path": "C/20/201/2016/20161/"
                  },
                  {
                    "code": "20162",
                    "name": "Производство полимеров в первичных формах из углеводородного сырья",
                    "children": [],
                    "path": "C/20/201/2016/20162/"
                  }
                ],
                "path": "C/20/201/2016/"
              },
              {
                "code": "2017",
                "name": "Производство синтетического каучука в первичных формах",
                "children": [],
                "path": "C/20/201/2017/"
              },
              {
                "code": "20170",
                "name": "Производство синтетического каучука в первичных формах",
                "children": [],
                "path": "C/20/201/20170/"
              }
            ],
            "path": "C/20/201/"
          },
          {
            "code": "202",
            "name": "Производство пестицидов и прочей агрохимической продукции",
            "children": [],
            "path": "C/20/202/"
          },
          {
            "code": "2020",
            "name": "Производство пестицидов и прочей агрохимической продукции",
            "children": [],
            "path": "C/20/2020/"
          },
          {
            "code": "20200",
            "name": "Производство пестицидов и прочей агрохимической продукции",
            "children": [],
            "path": "C/20/20200/"
          },
          {
            "code": "203",
            "name": "Производство красок, лаков и аналогичных покрытий, типографской краски и мастик",
            "children": [],
            "path": "C/20/203/"
          },
          {
            "code": "2030",
            "name": "Производство красок, лаков и аналогичных покрытий, типографской краски и мастик",
            "children": [
              {
                "code": "20301",
                "name": "Производство красок, лаков, эмалей и минеральных пигментов для них",
                "children": [],
                "path": "C/20/2030/20301/"
              },
              {
                "code": "20302",
                "name": "Производство готовых растворителей и разбавителей красок и лаков",
                "children": [],
                "path": "C/20/2030/20302/"
              }
            ],
            "path": "C/20/2030/"
          },
          {
            "code": "204",
            "name": "Производство мыла, моющих, чистящих, полирующих, парфюмерных и косметических средств",
            "children": [
              {
                "code": "2041",
                "name": "Производство мыла и моющих, чистящих и полирующих средств",
                "children": [],
                "path": "C/20/204/2041/"
              },
              {
                "code": "20410",
                "name": "Производство мыла и моющих, чистящих и полирующих средств",
                "children": [],
                "path": "C/20/204/20410/"
              },
              {
                "code": "2042",
                "name": "Производство парфюмерных и косметических средств",
                "children": [],
                "path": "C/20/204/2042/"
              },
              {
                "code": "20420",
                "name": "Производство парфюмерных и косметических средств",
                "children": [],
                "path": "C/20/204/20420/"
              }
            ],
            "path": "C/20/204/"
          },
          {
            "code": "205",
            "name": "Производство прочих химических продуктов",
            "children": [
              {
                "code": "2051",
                "name": "Производство взрывчатых веществ",
                "children": [
                  {
                    "code": "20511",
                    "name": "Производство взрывчатых веществ и прочих пиротехнических изделий",
                    "children": [],
                    "path": "C/20/205/2051/20511/"
                  },
                  {
                    "code": "20512",
                    "name": "Производство спичек",
                    "children": [],
                    "path": "C/20/205/2051/20512/"
                  }
                ],
                "path": "C/20/205/2051/"
              },
              {
                "code": "2052",
                "name": "Производство клея",
                "children": [],
                "path": "C/20/205/2052/"
              },
              {
                "code": "20520",
                "name": "Производство клея",
                "children": [],
                "path": "C/20/205/20520/"
              },
              {
                "code": "2053",
                "name": "Производство эфирных масел",
                "children": [],
                "path": "C/20/205/2053/"
              },
              {
                "code": "20530",
                "name": "Производство эфирных масел",
                "children": [],
                "path": "C/20/205/20530/"
              },
              {
                "code": "2059",
                "name": "Производство прочих химических продуктов, не включенных в другие группировки",
                "children": [
                  {
                    "code": "20591",
                    "name": "Производство фотоматериалов",
                    "children": [],
                    "path": "C/20/205/2059/20591/"
                  },
                  {
                    "code": "20592",
                    "name": "Производство желатина",
                    "children": [],
                    "path": "C/20/205/2059/20592/"
                  },
                  {
                    "code": "20593",
                    "name": "Производство материалов, используемых в отделке текстильных изделий",
                    "children": [],
                    "path": "C/20/205/2059/20593/"
                  },
                  {
                    "code": "20594",
                    "name": "Производство технического углерода (сажи), углеродных нанотрубок, нановолокон и других углеродных наноматериалов",
                    "children": [],
                    "path": "C/20/205/2059/20594/"
                  },
                  {
                    "code": "20599",
                    "name": "Производство других химических продуктов",
                    "children": [],
                    "path": "C/20/205/2059/20599/"
                  }
                ],
                "path": "C/20/205/2059/"
              }
            ],
            "path": "C/20/205/"
          },
          {
            "code": "206",
            "name": "Производство искусственных и синтетических волокон",
            "children": [],
            "path": "C/20/206/"
          },
          {
            "code": "2060",
            "name": "Производство искусственных и синтетических волокон",
            "children": [],
            "path": "C/20/2060/"
          },
          {
            "code": "20600",
            "name": "Производство искусственных и синтетических волокон",
            "children": [],
            "path": "C/20/20600/"
          },
          {
            "code": "21",
            "name": "Производство основных фармацевтических продуктов и фармацевтических препаратов",
            "children": [
              {
                "code": "211",
                "name": "Производство основных фармацевтических продуктов",
                "children": [],
                "path": "C/20/21/211/"
              },
              {
                "code": "2110",
                "name": "Производство основных фармацевтических продуктов",
                "children": [],
                "path": "C/20/21/2110/"
              },
              {
                "code": "21100",
                "name": "Производство основных фармацевтических продуктов",
                "children": [],
                "path": "C/20/21/21100/"
              },
              {
                "code": "212",
                "name": "Производство фармацевтических препаратов и медицинских материалов",
                "children": [],
                "path": "C/20/21/212/"
              },
              {
                "code": "2120",
                "name": "Производство фармацевтических препаратов и медицинских материалов",
                "children": [
                  {
                    "code": "21201",
                    "name": "Производство фармацевтических препаратов",
                    "children": [],
                    "path": "C/20/21/2120/21201/"
                  },
                  {
                    "code": "21202",
                    "name": "Производство лекарственных препаратов для ветеринарии",
                    "children": [],
                    "path": "C/20/21/2120/21202/"
                  }
                ],
                "path": "C/20/21/2120/"
              }
            ],
            "path": "C/20/21/"
          },
          {
            "code": "22",
            "name": "Производство резиновых и пластмассовых изделий",
            "children": [
              {
                "code": "221",
                "name": "Производство резиновых изделий",
                "children": [
                  {
                    "code": "2211",
                    "name": "Производство резиновых шин, покрышек и камер; восстановление резиновых шин и покрышек",
                    "children": [
                      {
                        "code": "22111",
                        "name": "Производство резиновых шин, покрышек и камер",
                        "children": [],
                        "path": "C/20/22/221/2211/22111/"
                      },
                      {
                        "code": "22112",
                        "name": "Восстановление резиновых шин и покрышек",
                        "children": [],
                        "path": "C/20/22/221/2211/22112/"
                      }
                    ],
                    "path": "C/20/22/221/2211/"
                  },
                  {
                    "code": "2219",
                    "name": "Производство прочих резиновых изделий",
                    "children": [
                      {
                        "code": "22191",
                        "name": "Производство резинотехнических изделий",
                        "children": [],
                        "path": "C/20/22/221/2219/22191/"
                      },
                      {
                        "code": "22192",
                        "name": "Производство резиновых санитарно-гигиенических и медицинских изделий",
                        "children": [],
                        "path": "C/20/22/221/2219/22192/"
                      }
                    ],
                    "path": "C/20/22/221/2219/"
                  }
                ],
                "path": "C/20/22/221/"
              },
              {
                "code": "222",
                "name": "Производство пластмассовых изделий",
                "children": [
                  {
                    "code": "2221",
                    "name": "Производство пластмассовых плит, листов, труб и профилей",
                    "children": [],
                    "path": "C/20/22/222/2221/"
                  },
                  {
                    "code": "22210",
                    "name": "Производство пластмассовых плит, листов, труб и профилей",
                    "children": [],
                    "path": "C/20/22/222/22210/"
                  },
                  {
                    "code": "2222",
                    "name": "Производство пластмассовых упаковок для товаров",
                    "children": [],
                    "path": "C/20/22/222/2222/"
                  },
                  {
                    "code": "22220",
                    "name": "Производство пластмассовых упаковок для товаров",
                    "children": [],
                    "path": "C/20/22/222/22220/"
                  },
                  {
                    "code": "2223",
                    "name": "Производство строительных пластмассовых изделий",
                    "children": [
                      {
                        "code": "22231",
                        "name": "Производство пластмассовых изделий, используемых в строительстве",
                        "children": [],
                        "path": "C/20/22/222/2223/22231/"
                      },
                      {
                        "code": "22232",
                        "name": "Производство линолеума и прочих эластичных покрытий для пола",
                        "children": [],
                        "path": "C/20/22/222/2223/22232/"
                      }
                    ],
                    "path": "C/20/22/222/2223/"
                  },
                  {
                    "code": "2229",
                    "name": "Производство прочих пластмассовых изделий",
                    "children": [],
                    "path": "C/20/22/222/2229/"
                  },
                  {
                    "code": "22290",
                    "name": "Производство прочих пластмассовых изделий",
                    "children": [],
                    "path": "C/20/22/222/22290/"
                  }
                ],
                "path": "C/20/22/222/"
              }
            ],
            "path": "C/20/22/"
          },
          {
            "code": "23",
            "name": "Производство прочей не металлической минеральной продукции",
            "children": [
              {
                "code": "231",
                "name": "Производство стекла и изделий из стекла",
                "children": [
                  {
                    "code": "2311",
                    "name": "Производство листового стекла",
                    "children": [],
                    "path": "C/20/23/231/2311/"
                  },
                  {
                    "code": "23110",
                    "name": "Производство листового стекла",
                    "children": [],
                    "path": "C/20/23/231/23110/"
                  },
                  {
                    "code": "2312",
                    "name": "Формирование и обработка листового стекла",
                    "children": [],
                    "path": "C/20/23/231/2312/"
                  },
                  {
                    "code": "23120",
                    "name": "Формирование и обработка листового стекла",
                    "children": [],
                    "path": "C/20/23/231/23120/"
                  },
                  {
                    "code": "2313",
                    "name": "Производство полых стеклянных изделий",
                    "children": [
                      {
                        "code": "23131",
                        "name": "Производство стеклянной тары",
                        "children": [],
                        "path": "C/20/23/231/2313/23131/"
                      },
                      {
                        "code": "23132",
                        "name": "Производство хозяйственно-бытовых изделий из стекла и стеклянной посуды",
                        "children": [],
                        "path": "C/20/23/231/2313/23132/"
                      }
                    ],
                    "path": "C/20/23/231/2313/"
                  },
                  {
                    "code": "2314",
                    "name": "Производство стекловолокна",
                    "children": [],
                    "path": "C/20/23/231/2314/"
                  },
                  {
                    "code": "23140",
                    "name": "Производство стекловолокна",
                    "children": [],
                    "path": "C/20/23/231/23140/"
                  },
                  {
                    "code": "2319",
                    "name": "Производство и обработка прочих стеклянных изделий",
                    "children": [
                      {
                        "code": "23191",
                        "name": "Производство электротехнического и электровакуумного стекла",
                        "children": [],
                        "path": "C/20/23/231/2319/23191/"
                      },
                      {
                        "code": "23192",
                        "name": "Производство химико-лабораторной посуды из стекла",
                        "children": [],
                        "path": "C/20/23/231/2319/23192/"
                      },
                      {
                        "code": "23199",
                        "name": "Производство стеклянных изделий, не включенных в другие группировки",
                        "children": [],
                        "path": "C/20/23/231/2319/23199/"
                      }
                    ],
                    "path": "C/20/23/231/2319/"
                  }
                ],
                "path": "C/20/23/231/"
              },
              {
                "code": "232",
                "name": "Производство огнеупорных изделий",
                "children": [],
                "path": "C/20/23/232/"
              },
              {
                "code": "2320",
                "name": "Производство огнеупорных изделий",
                "children": [],
                "path": "C/20/23/2320/"
              },
              {
                "code": "23200",
                "name": "Производство огнеупорных изделий",
                "children": [],
                "path": "C/20/23/23200/"
              },
              {
                "code": "233",
                "name": "Производство строительных материалов из глины",
                "children": [
                  {
                    "code": "2331",
                    "name": "Производство керамических покрытий и плит",
                    "children": [],
                    "path": "C/20/23/233/2331/"
                  },
                  {
                    "code": "23310",
                    "name": "Производство керамических покрытий и плит",
                    "children": [],
                    "path": "C/20/23/233/23310/"
                  },
                  {
                    "code": "2332",
                    "name": "Производство кирпича, черепицы и прочих строительных изделий из обожженной глины",
                    "children": [],
                    "path": "C/20/23/233/2332/"
                  },
                  {
                    "code": "23320",
                    "name": "Производство кирпича, черепицы и прочих строительных изделий из обожженной глины",
                    "children": [],
                    "path": "C/20/23/233/23320/"
                  }
                ],
                "path": "C/20/23/233/"
              },
              {
                "code": "234",
                "name": "Производство прочих фарфоровых и керамических изделий",
                "children": [
                  {
                    "code": "2341",
                    "name": "Производство керамических хозяйственных и декоративных изделий",
                    "children": [
                      {
                        "code": "23411",
                        "name": "Производство хозяйственно-бытовых изделий из фарфора и фаянса",
                        "children": [],
                        "path": "C/20/23/234/2341/23411/"
                      },
                      {
                        "code": "23412",
                        "name": "Производство хозяйственно-бытовых гончарных изделий",
                        "children": [],
                        "path": "C/20/23/234/2341/23412/"
                      }
                    ],
                    "path": "C/20/23/234/2341/"
                  },
                  {
                    "code": "2342",
                    "name": "Производство керамических санитарно-технических изделий",
                    "children": [],
                    "path": "C/20/23/234/2342/"
                  },
                  {
                    "code": "23420",
                    "name": "Производство керамических санитарно-технических изделий",
                    "children": [],
                    "path": "C/20/23/234/23420/"
                  },
                  {
                    "code": "2343",
                    "name": "Производство керамических электрических изоляторов и изолирующей арматуры",
                    "children": [],
                    "path": "C/20/23/234/2343/"
                  },
                  {
                    "code": "23430",
                    "name": "Производство керамических электрических изоляторов и изолирующей арматуры",
                    "children": [],
                    "path": "C/20/23/234/23430/"
                  },
                  {
                    "code": "2344",
                    "name": "Производство прочих технических керамических изделий",
                    "children": [],
                    "path": "C/20/23/234/2344/"
                  },
                  {
                    "code": "23440",
                    "name": "Производство прочих технических керамических изделий",
                    "children": [],
                    "path": "C/20/23/234/23440/"
                  },
                  {
                    "code": "2349",
                    "name": "Производство прочих керамических изделий",
                    "children": [],
                    "path": "C/20/23/234/2349/"
                  },
                  {
                    "code": "23490",
                    "name": "Производство прочих керамических изделий",
                    "children": [],
                    "path": "C/20/23/234/23490/"
                  }
                ],
                "path": "C/20/23/234/"
              },
              {
                "code": "235",
                "name": "Производство цемента, извести и строительного гипса",
                "children": [
                  {
                    "code": "2351",
                    "name": "Производство цемента",
                    "children": [],
                    "path": "C/20/23/235/2351/"
                  },
                  {
                    "code": "23510",
                    "name": "Производство цемента",
                    "children": [],
                    "path": "C/20/23/235/23510/"
                  },
                  {
                    "code": "2352",
                    "name": "Производство извести и строительного гипса",
                    "children": [
                      {
                        "code": "23521",
                        "name": "Производство извести",
                        "children": [],
                        "path": "C/20/23/235/2352/23521/"
                      },
                      {
                        "code": "23522",
                        "name": "Производство известняковой и доломитовой муки",
                        "children": [],
                        "path": "C/20/23/235/2352/23522/"
                      },
                      {
                        "code": "23523",
                        "name": "Производство строительного гипса",
                        "children": [],
                        "path": "C/20/23/235/2352/23523/"
                      }
                    ],
                    "path": "C/20/23/235/2352/"
                  }
                ],
                "path": "C/20/23/235/"
              },
              {
                "code": "236",
                "name": "Производство изделий из бетона, цемента и строительного гипса",
                "children": [
                  {
                    "code": "2361",
                    "name": "Производство строительных изделий из бетона",
                    "children": [
                      {
                        "code": "23611",
                        "name": "Производство сборных железобетонных и бетонных конструкций и изделий",
                        "children": [],
                        "path": "C/20/23/236/2361/23611/"
                      },
                      {
                        "code": "23612",
                        "name": "Производство стеновых блоков",
                        "children": [],
                        "path": "C/20/23/236/2361/23612/"
                      },
                      {
                        "code": "23613",
                        "name": "Производство силикатного кирпича",
                        "children": [],
                        "path": "C/20/23/236/2361/23613/"
                      }
                    ],
                    "path": "C/20/23/236/2361/"
                  },
                  {
                    "code": "2362",
                    "name": "Производство изделий из гипса для строительных целей",
                    "children": [],
                    "path": "C/20/23/236/2362/"
                  },
                  {
                    "code": "23620",
                    "name": "Производство изделий из гипса для строительных целей",
                    "children": [],
                    "path": "C/20/23/236/23620/"
                  },
                  {
                    "code": "2363",
                    "name": "Производство товарного бетона",
                    "children": [],
                    "path": "C/20/23/236/2363/"
                  },
                  {
                    "code": "23630",
                    "name": "Производство товарного бетона",
                    "children": [],
                    "path": "C/20/23/236/23630/"
                  },
                  {
                    "code": "2364",
                    "name": "Производство строительных растворов",
                    "children": [],
                    "path": "C/20/23/236/2364/"
                  },
                  {
                    "code": "23640",
                    "name": "Производство строительных растворов",
                    "children": [],
                    "path": "C/20/23/236/23640/"
                  },
                  {
                    "code": "2365",
                    "name": "Производство изделий из асбестоцемента и волокнистого цемента",
                    "children": [],
                    "path": "C/20/23/236/2365/"
                  },
                  {
                    "code": "23650",
                    "name": "Производство изделий из асбестоцемента и волокнистого цемента",
                    "children": [],
                    "path": "C/20/23/236/23650/"
                  },
                  {
                    "code": "2369",
                    "name": "Производство прочих изделий из бетона, строительного гипса и цемента",
                    "children": [],
                    "path": "C/20/23/236/2369/"
                  },
                  {
                    "code": "23690",
                    "name": "Производство прочих изделий из бетона, строительного гипса и цемента",
                    "children": [],
                    "path": "C/20/23/236/23690/"
                  }
                ],
                "path": "C/20/23/236/"
              },
              {
                "code": "237",
                "name": "Резка, обработка и отделка камня",
                "children": [],
                "path": "C/20/23/237/"
              },
              {
                "code": "2370",
                "name": "Резка, обработка и отделка камня",
                "children": [],
                "path": "C/20/23/2370/"
              },
              {
                "code": "23700",
                "name": "Резка, обработка и отделка камня",
                "children": [],
                "path": "C/20/23/23700/"
              },
              {
                "code": "239",
                "name": "Производство абразивных изделий и прочей неметаллической минеральной продукции",
                "children": [
                  {
                    "code": "2391",
                    "name": "Производство абразивных изделий",
                    "children": [],
                    "path": "C/20/23/239/2391/"
                  },
                  {
                    "code": "23910",
                    "name": "Производство абразивных изделий",
                    "children": [],
                    "path": "C/20/23/239/23910/"
                  },
                  {
                    "code": "2399",
                    "name": "Производство прочей неметаллической минеральной продукции, не включенной в другие группировки",
                    "children": [
                      {
                        "code": "23991",
                        "name": "Производство асбестотехнических изделий",
                        "children": [],
                        "path": "C/20/23/239/2399/23991/"
                      },
                      {
                        "code": "23992",
                        "name": "Производство минеральных изоляционных материалов",
                        "children": [],
                        "path": "C/20/23/239/2399/23992/"
                      },
                      {
                        "code": "23993",
                        "name": "Производство мягких кровельных и гидроизоляционных материалов",
                        "children": [],
                        "path": "C/20/23/239/2399/23993/"
                      },
                      {
                        "code": "23994",
                        "name": "Производство искусственных и переработка естественных пористых заполнителей",
                        "children": [],
                        "path": "C/20/23/239/2399/23994/"
                      },
                      {
                        "code": "23995",
                        "name": "Производство изделий из битума и аналогичных материалов",
                        "children": [],
                        "path": "C/20/23/239/2399/23995/"
                      },
                      {
                        "code": "23996",
                        "name": "Производство изделий из неметаллических руд",
                        "children": [],
                        "path": "C/20/23/239/2399/23996/"
                      }
                    ],
                    "path": "C/20/23/239/2399/"
                  }
                ],
                "path": "C/20/23/239/"
              }
            ],
            "path": "C/20/23/"
          },
          {
            "code": "24",
            "name": "Металлургическое производство",
            "children": [
              {
                "code": "241",
                "name": "Производство чугуна, стали и ферросплавов",
                "children": [],
                "path": "C/20/24/241/"
              },
              {
                "code": "2410",
                "name": "Производство чугуна, стали и ферросплавов",
                "children": [],
                "path": "C/20/24/2410/"
              },
              {
                "code": "24100",
                "name": "Производство чугуна, стали и ферросплавов",
                "children": [],
                "path": "C/20/24/24100/"
              },
              {
                "code": "242",
                "name": "Производство труб, трубок, полых профилей, фитингов из стали",
                "children": [],
                "path": "C/20/24/242/"
              },
              {
                "code": "2420",
                "name": "Производство труб, трубок, полых профилей, фитингов из стали",
                "children": [],
                "path": "C/20/24/2420/"
              },
              {
                "code": "24200",
                "name": "Производство труб, трубок, полых профилей, фитингов из стали",
                "children": [],
                "path": "C/20/24/24200/"
              },
              {
                "code": "243",
                "name": "Производство прочих стальных изделий путем первичной обработки",
                "children": [
                  {
                    "code": "2431",
                    "name": "Холодное волочение",
                    "children": [],
                    "path": "C/20/24/243/2431/"
                  },
                  {
                    "code": "24310",
                    "name": "Холодное волочение",
                    "children": [],
                    "path": "C/20/24/243/24310/"
                  },
                  {
                    "code": "2432",
                    "name": "Холодная прокатка лент и узких полос",
                    "children": [],
                    "path": "C/20/24/243/2432/"
                  },
                  {
                    "code": "24320",
                    "name": "Холодная прокатка лент и узких полос",
                    "children": [],
                    "path": "C/20/24/243/24320/"
                  },
                  {
                    "code": "2433",
                    "name": "Холодная штамповка или гибка",
                    "children": [],
                    "path": "C/20/24/243/2433/"
                  },
                  {
                    "code": "24330",
                    "name": "Холодная штамповка или гибка",
                    "children": [],
                    "path": "C/20/24/243/24330/"
                  },
                  {
                    "code": "2434",
                    "name": "Производство проволоки путем холодного волочения",
                    "children": [],
                    "path": "C/20/24/243/2434/"
                  },
                  {
                    "code": "24340",
                    "name": "Производство проволоки путем холодного волочения",
                    "children": [],
                    "path": "C/20/24/243/24340/"
                  }
                ],
                "path": "C/20/24/243/"
              },
              {
                "code": "244",
                "name": "Производство основных благородных и цветных металлов",
                "children": [
                  {
                    "code": "2441",
                    "name": "Производство благородных (драгоценных) металлов",
                    "children": [],
                    "path": "C/20/24/244/2441/"
                  },
                  {
                    "code": "24410",
                    "name": "Производство благородных (драгоценных) металлов",
                    "children": [],
                    "path": "C/20/24/244/24410/"
                  },
                  {
                    "code": "2442",
                    "name": "Производство алюминия",
                    "children": [],
                    "path": "C/20/24/244/2442/"
                  },
                  {
                    "code": "24420",
                    "name": "Производство алюминия",
                    "children": [],
                    "path": "C/20/24/244/24420/"
                  },
                  {
                    "code": "2443",
                    "name": "Производство свинца, цинка и олова",
                    "children": [],
                    "path": "C/20/24/244/2443/"
                  },
                  {
                    "code": "24430",
                    "name": "Производство свинца, цинка и олова",
                    "children": [],
                    "path": "C/20/24/244/24430/"
                  },
                  {
                    "code": "2444",
                    "name": "Производство меди",
                    "children": [],
                    "path": "C/20/24/244/2444/"
                  },
                  {
                    "code": "24440",
                    "name": "Производство меди",
                    "children": [],
                    "path": "C/20/24/244/24440/"
                  },
                  {
                    "code": "2445",
                    "name": "Производство прочих цветных металлов",
                    "children": [
                      {
                        "code": "24451",
                        "name": "Производство никеля и кобальта",
                        "children": [],
                        "path": "C/20/24/244/2445/24451/"
                      },
                      {
                        "code": "24452",
                        "name": "Производство титана, порошка из титана, магния, вольфрама и молибдена",
                        "children": [],
                        "path": "C/20/24/244/2445/24452/"
                      },
                      {
                        "code": "24453",
                        "name": "Производство сурьмы и ртути",
                        "children": [],
                        "path": "C/20/24/244/2445/24453/"
                      },
                      {
                        "code": "24454",
                        "name": "Обработка цветных металлов и сплавов",
                        "children": [],
                        "path": "C/20/24/244/2445/24454/"
                      },
                      {
                        "code": "24455",
                        "name": "Производство редких, редкоземельных металлов и полупроводниковых материалов",
                        "children": [],
                        "path": "C/20/24/244/2445/24455/"
                      }
                    ],
                    "path": "C/20/24/244/2445/"
                  },
                  {
                    "code": "2446",
                    "name": "Переработка ядерного топлива",
                    "children": [],
                    "path": "C/20/24/244/2446/"
                  },
                  {
                    "code": "24460",
                    "name": "Переработка ядерного топлива",
                    "children": [],
                    "path": "C/20/24/244/24460/"
                  }
                ],
                "path": "C/20/24/244/"
              },
              {
                "code": "245",
                "name": "Литье металлов",
                "children": [
                  {
                    "code": "2451",
                    "name": "Литье чугуна",
                    "children": [
                      {
                        "code": "24511",
                        "name": "Литье чугуна, кроме производства труб",
                        "children": [],
                        "path": "C/20/24/245/2451/24511/"
                      },
                      {
                        "code": "24512",
                        "name": "Производство труб из чугуна",
                        "children": [],
                        "path": "C/20/24/245/2451/24512/"
                      }
                    ],
                    "path": "C/20/24/245/2451/"
                  },
                  {
                    "code": "2452",
                    "name": "Литье стали",
                    "children": [],
                    "path": "C/20/24/245/2452/"
                  },
                  {
                    "code": "24520",
                    "name": "Литье стали",
                    "children": [],
                    "path": "C/20/24/245/24520/"
                  },
                  {
                    "code": "2453",
                    "name": "Литье легких металлов",
                    "children": [],
                    "path": "C/20/24/245/2453/"
                  },
                  {
                    "code": "24530",
                    "name": "Литье легких металлов",
                    "children": [],
                    "path": "C/20/24/245/24530/"
                  },
                  {
                    "code": "2454",
                    "name": "Литье прочих цветных металлов",
                    "children": [],
                    "path": "C/20/24/245/2454/"
                  },
                  {
                    "code": "24540",
                    "name": "Литье прочих цветных металлов",
                    "children": [],
                    "path": "C/20/24/245/24540/"
                  }
                ],
                "path": "C/20/24/245/"
              }
            ],
            "path": "C/20/24/"
          },
          {
            "code": "25",
            "name": "Производство готовых металлических изделий, кроме машин и оборудования",
            "children": [
              {
                "code": "251",
                "name": "Производство строительных металлических конструкций и изделий",
                "children": [
                  {
                    "code": "2511",
                    "name": "Производство строительных металлических конструкций и их частей",
                    "children": [
                      {
                        "code": "25111",
                        "name": "Производство строительных стальных конструкций",
                        "children": [],
                        "path": "C/20/25/251/2511/25111/"
                      },
                      {
                        "code": "25112",
                        "name": "Производство легких металлических конструкций",
                        "children": [],
                        "path": "C/20/25/251/2511/25112/"
                      },
                      {
                        "code": "25113",
                        "name": "Производство строительных конструкций и изделий из алюминия и алюминиевых сплавов",
                        "children": [],
                        "path": "C/20/25/251/2511/25113/"
                      },
                      {
                        "code": "25114",
                        "name": "Производство контейнерных и сборно-разборных зданий и помещений",
                        "children": [],
                        "path": "C/20/25/251/2511/25114/"
                      }
                    ],
                    "path": "C/20/25/251/2511/"
                  },
                  {
                    "code": "2512",
                    "name": "Производство металлических дверей и окон",
                    "children": [],
                    "path": "C/20/25/251/2512/"
                  },
                  {
                    "code": "25120",
                    "name": "Производство металлических дверей и окон",
                    "children": [],
                    "path": "C/20/25/251/25120/"
                  }
                ],
                "path": "C/20/25/251/"
              },
              {
                "code": "252",
                "name": "Производство металлических цистерн, резервуаров и контейнеров",
                "children": [
                  {
                    "code": "2521",
                    "name": "Производство радиаторов и котлов центрального отопления",
                    "children": [],
                    "path": "C/20/25/252/2521/"
                  },
                  {
                    "code": "25210",
                    "name": "Производство радиаторов и котлов центрального отопления",
                    "children": [],
                    "path": "C/20/25/252/25210/"
                  },
                  {
                    "code": "2529",
                    "name": "Производство прочих металлических цистерн, резервуаров и контейнеров",
                    "children": [],
                    "path": "C/20/25/252/2529/"
                  },
                  {
                    "code": "25290",
                    "name": "Производство прочих металлических цистерн, резервуаров и контейнеров",
                    "children": [],
                    "path": "C/20/25/252/25290/"
                  }
                ],
                "path": "C/20/25/252/"
              },
              {
                "code": "253",
                "name": "Производство паровых котлов, кроме котлов центрального отопления",
                "children": [],
                "path": "C/20/25/253/"
              },
              {
                "code": "2530",
                "name": "Производство паровых котлов, кроме котлов центрального отопления",
                "children": [],
                "path": "C/20/25/2530/"
              },
              {
                "code": "25300",
                "name": "Производство паровых котлов, кроме котлов центрального отопления",
                "children": [],
                "path": "C/20/25/25300/"
              },
              {
                "code": "254",
                "name": "Производство оружия и боеприпасов",
                "children": [],
                "path": "C/20/25/254/"
              },
              {
                "code": "2540",
                "name": "Производство оружия и боеприпасов",
                "children": [],
                "path": "C/20/25/2540/"
              },
              {
                "code": "25400",
                "name": "Производство оружия и боеприпасов",
                "children": [],
                "path": "C/20/25/25400/"
              },
              {
                "code": "255",
                "name": "Ковка, прессование, штамповка, профилирование металла; порошковая металлургия",
                "children": [],
                "path": "C/20/25/255/"
              },
              {
                "code": "2550",
                "name": "Ковка, прессование, штамповка, профилирование металла; порошковая металлургия",
                "children": [
                  {
                    "code": "25501",
                    "name": "Производство готовых металлических изделий или полуфабрикатов путем ковки, прессования, штамповки и профилирования",
                    "children": [],
                    "path": "C/20/25/2550/25501/"
                  },
                  {
                    "code": "25502",
                    "name": "Производство металлических изделий методом порошковой металлургии",
                    "children": [],
                    "path": "C/20/25/2550/25502/"
                  }
                ],
                "path": "C/20/25/2550/"
              },
              {
                "code": "256",
                "name": "Обработка металлов и нанесение покрытий на металлы; основные технологические процессы машиностроения",
                "children": [
                  {
                    "code": "2561",
                    "name": "Обработка металлов и нанесение покрытий на металлы",
                    "children": [],
                    "path": "C/20/25/256/2561/"
                  },
                  {
                    "code": "25610",
                    "name": "Обработка металлов и нанесение покрытий на металлы",
                    "children": [],
                    "path": "C/20/25/256/25610/"
                  },
                  {
                    "code": "2562",
                    "name": "Основные технологические процессы машиностроения",
                    "children": [],
                    "path": "C/20/25/256/2562/"
                  },
                  {
                    "code": "25620",
                    "name": "Основные технологические процессы машиностроения",
                    "children": [],
                    "path": "C/20/25/256/25620/"
                  }
                ],
                "path": "C/20/25/256/"
              },
              {
                "code": "257",
                "name": "Производство ножевых изделий, инструментов и скобяных изделий",
                "children": [
                  {
                    "code": "2571",
                    "name": "Производство ножевых изделий",
                    "children": [],
                    "path": "C/20/25/257/2571/"
                  },
                  {
                    "code": "25710",
                    "name": "Производство ножевых изделий",
                    "children": [],
                    "path": "C/20/25/257/25710/"
                  },
                  {
                    "code": "2572",
                    "name": "Производство замков, петель и шарниров",
                    "children": [],
                    "path": "C/20/25/257/2572/"
                  },
                  {
                    "code": "25720",
                    "name": "Производство замков, петель и шарниров",
                    "children": [],
                    "path": "C/20/25/257/25720/"
                  },
                  {
                    "code": "2573",
                    "name": "Производство инструментов",
                    "children": [
                      {
                        "code": "25731",
                        "name": "Производство металло- и деревообрабатывающего инструмента",
                        "children": [],
                        "path": "C/20/25/257/2573/25731/"
                      },
                      {
                        "code": "25732",
                        "name": "Производство сельскохозяйственного и садово-огородного инвентаря",
                        "children": [],
                        "path": "C/20/25/257/2573/25732/"
                      },
                      {
                        "code": "25739",
                        "name": "Производство инструментов, не включенных в другие группировки",
                        "children": [],
                        "path": "C/20/25/257/2573/25739/"
                      }
                    ],
                    "path": "C/20/25/257/2573/"
                  }
                ],
                "path": "C/20/25/257/"
              },
              {
                "code": "259",
                "name": "Производство прочих готовых металлических изделий",
                "children": [
                  {
                    "code": "2591",
                    "name": "Производство металлических бочек и аналогичных емкостей",
                    "children": [],
                    "path": "C/20/25/259/2591/"
                  },
                  {
                    "code": "25910",
                    "name": "Производство металлических бочек и аналогичных емкостей",
                    "children": [],
                    "path": "C/20/25/259/25910/"
                  },
                  {
                    "code": "2592",
                    "name": "Производство упаковки из легких металлов",
                    "children": [],
                    "path": "C/20/25/259/2592/"
                  },
                  {
                    "code": "25920",
                    "name": "Производство упаковки из легких металлов",
                    "children": [],
                    "path": "C/20/25/259/25920/"
                  },
                  {
                    "code": "2593",
                    "name": "Производство изделий из проволоки, цепей и пружин",
                    "children": [
                      {
                        "code": "25931",
                        "name": "Производство изделий из проволоки",
                        "children": [],
                        "path": "C/20/25/259/2593/25931/"
                      },
                      {
                        "code": "25932",
                        "name": "Производство цепей и пружин",
                        "children": [],
                        "path": "C/20/25/259/2593/25932/"
                      }
                    ],
                    "path": "C/20/25/259/2593/"
                  },
                  {
                    "code": "2594",
                    "name": "Производство крепежных и резьбовых изделий",
                    "children": [],
                    "path": "C/20/25/259/2594/"
                  },
                  {
                    "code": "25940",
                    "name": "Производство крепежных и резьбовых изделий",
                    "children": [],
                    "path": "C/20/25/259/25940/"
                  },
                  {
                    "code": "2599",
                    "name": "Производство прочих готовых металлических изделий, не включенных в другие группировки",
                    "children": [
                      {
                        "code": "25991",
                        "name": "Производство металлического санитарно-технического оборудования",
                        "children": [],
                        "path": "C/20/25/259/2599/25991/"
                      },
                      {
                        "code": "25992",
                        "name": "Производство хозяйственной посуды и кухонного инвентаря из металла",
                        "children": [],
                        "path": "C/20/25/259/2599/25992/"
                      },
                      {
                        "code": "25999",
                        "name": "Производство прочих готовых металлических изделий",
                        "children": [],
                        "path": "C/20/25/259/2599/25999/"
                      }
                    ],
                    "path": "C/20/25/259/2599/"
                  }
                ],
                "path": "C/20/25/259/"
              }
            ],
            "path": "C/20/25/"
          },
          {
            "code": "26",
            "name": "Производство компьютеров, электронного и оптического оборудования",
            "children": [
              {
                "code": "261",
                "name": "Производство электронных элементов и плат",
                "children": [
                  {
                    "code": "2611",
                    "name": "Производство электронных элементов",
                    "children": [],
                    "path": "C/20/26/261/2611/"
                  },
                  {
                    "code": "26110",
                    "name": "Производство электронных элементов",
                    "children": [],
                    "path": "C/20/26/261/26110/"
                  },
                  {
                    "code": "2612",
                    "name": "Производство электронных плат",
                    "children": [],
                    "path": "C/20/26/261/2612/"
                  },
                  {
                    "code": "26120",
                    "name": "Производство электронных плат",
                    "children": [],
                    "path": "C/20/26/261/26120/"
                  }
                ],
                "path": "C/20/26/261/"
              },
              {
                "code": "262",
                "name": "Производство компьютеров и периферийного оборудования",
                "children": [],
                "path": "C/20/26/262/"
              },
              {
                "code": "2620",
                "name": "Производство компьютеров и периферийного оборудования",
                "children": [],
                "path": "C/20/26/2620/"
              },
              {
                "code": "26200",
                "name": "Производство компьютеров и периферийного оборудования",
                "children": [],
                "path": "C/20/26/26200/"
              },
              {
                "code": "263",
                "name": "Производство коммуникационного оборудования",
                "children": [],
                "path": "C/20/26/263/"
              },
              {
                "code": "2630",
                "name": "Производство коммуникационного оборудования",
                "children": [
                  {
                    "code": "26301",
                    "name": "Производство теле- и радиоаппаратуры производственного назначения",
                    "children": [],
                    "path": "C/20/26/2630/26301/"
                  },
                  {
                    "code": "26302",
                    "name": "Производство аппаратуры для кабельной телефонной и телеграфной связи",
                    "children": [],
                    "path": "C/20/26/2630/26302/"
                  }
                ],
                "path": "C/20/26/2630/"
              },
              {
                "code": "264",
                "name": "Производство электронной бытовой техники",
                "children": [],
                "path": "C/20/26/264/"
              },
              {
                "code": "2640",
                "name": "Производство электронной бытовой техники",
                "children": [],
                "path": "C/20/26/2640/"
              },
              {
                "code": "26400",
                "name": "Производство электронной бытовой техники",
                "children": [],
                "path": "C/20/26/26400/"
              },
              {
                "code": "265",
                "name": "Производство инструментов и приборов для измерения, тестирования и навигации; производство часов",
                "children": [
                  {
                    "code": "2651",
                    "name": "Производство инструментов и приборов для измерения, тестирования и навигации",
                    "children": [
                      {
                        "code": "26511",
                        "name": "Производство приборов для измерения механических величин",
                        "children": [],
                        "path": "C/20/26/265/2651/26511/"
                      },
                      {
                        "code": "26512",
                        "name": "Производство электроизмерительных приборов",
                        "children": [],
                        "path": "C/20/26/265/2651/26512/"
                      },
                      {
                        "code": "26513",
                        "name": "Производство радиоизмерительных приборов",
                        "children": [],
                        "path": "C/20/26/265/2651/26513/"
                      },
                      {
                        "code": "26514",
                        "name": "Производство оптических и оптико-механических приборов и оборудования",
                        "children": [],
                        "path": "C/20/26/265/2651/26514/"
                      },
                      {
                        "code": "26515",
                        "name": "Производство приборов для физических исследований",
                        "children": [],
                        "path": "C/20/26/265/2651/26515/"
                      },
                      {
                        "code": "26516",
                        "name": "Производство медико-хирургических инструментов",
                        "children": [],
                        "path": "C/20/26/265/2651/26516/"
                      },
                      {
                        "code": "26517",
                        "name": "Производство оборудования для систем позиционирования и мониторинга ответственных сооружений",
                        "children": [],
                        "path": "C/20/26/265/2651/26517/"
                      }
                    ],
                    "path": "C/20/26/265/2651/"
                  },
                  {
                    "code": "2652",
                    "name": "Производство часов",
                    "children": [
                      {
                        "code": "26521",
                        "name": "Производство часов всех видов",
                        "children": [],
                        "path": "C/20/26/265/2652/26521/"
                      },
                      {
                        "code": "26522",
                        "name": "Производство приборов для регистрации времени",
                        "children": [],
                        "path": "C/20/26/265/2652/26522/"
                      },
                      {
                        "code": "26523",
                        "name": "Производство деталей и принадлежностей для часов",
                        "children": [],
                        "path": "C/20/26/265/2652/26523/"
                      }
                    ],
                    "path": "C/20/26/265/2652/"
                  }
                ],
                "path": "C/20/26/265/"
              },
              {
                "code": "266",
                "name": "Производство облучающего, электромедицинского и электротерапевтического оборудования",
                "children": [],
                "path": "C/20/26/266/"
              },
              {
                "code": "2660",
                "name": "Производство облучающего, электромедицинского и электротерапевтического оборудования",
                "children": [],
                "path": "C/20/26/2660/"
              },
              {
                "code": "26600",
                "name": "Производство облучающего, электромедицинского и электротерапевтического оборудования",
                "children": [],
                "path": "C/20/26/26600/"
              },
              {
                "code": "267",
                "name": "Производство оптических приборов, фото- и кинооборудования",
                "children": [],
                "path": "C/20/26/267/"
              },
              {
                "code": "2670",
                "name": "Производство оптических приборов, фото- и кинооборудования",
                "children": [
                  {
                    "code": "26701",
                    "name": "Производство оптических приборов",
                    "children": [],
                    "path": "C/20/26/2670/26701/"
                  },
                  {
                    "code": "26702",
                    "name": "Производство фото- и кинооборудования",
                    "children": [],
                    "path": "C/20/26/2670/26702/"
                  }
                ],
                "path": "C/20/26/2670/"
              },
              {
                "code": "268",
                "name": "Производство магнитных и оптических носителей информации",
                "children": [],
                "path": "C/20/26/268/"
              },
              {
                "code": "2680",
                "name": "Производство магнитных и оптических носителей информации",
                "children": [],
                "path": "C/20/26/2680/"
              },
              {
                "code": "26800",
                "name": "Производство магнитных и оптических носителей информации",
                "children": [],
                "path": "C/20/26/26800/"
              }
            ],
            "path": "C/20/26/"
          },
          {
            "code": "27",
            "name": "Производство электрического оборудования",
            "children": [
              {
                "code": "271",
                "name": "Производство электродвигателей, генераторов, трансформаторов и электрораспределительной и регулирующей аппаратуры",
                "children": [
                  {
                    "code": "2711",
                    "name": "Производство электродвигателей, генераторов и трансформаторов",
                    "children": [],
                    "path": "C/20/27/271/2711/"
                  },
                  {
                    "code": "27110",
                    "name": "Производство электродвигателей, генераторов и трансформаторов",
                    "children": [],
                    "path": "C/20/27/271/27110/"
                  },
                  {
                    "code": "2712",
                    "name": "Производство электрораспределительной и регулирующей аппаратуры",
                    "children": [],
                    "path": "C/20/27/271/2712/"
                  },
                  {
                    "code": "27120",
                    "name": "Производство электрораспределительной и регулирующей аппаратуры",
                    "children": [],
                    "path": "C/20/27/271/27120/"
                  }
                ],
                "path": "C/20/27/271/"
              },
              {
                "code": "272",
                "name": "Производство батарей и аккумуляторов",
                "children": [],
                "path": "C/20/27/272/"
              },
              {
                "code": "2720",
                "name": "Производство батарей и аккумуляторов",
                "children": [],
                "path": "C/20/27/2720/"
              },
              {
                "code": "27200",
                "name": "Производство батарей и аккумуляторов",
                "children": [],
                "path": "C/20/27/27200/"
              },
              {
                "code": "273",
                "name": "Производство электропроводки и электромонтажных устройств",
                "children": [
                  {
                    "code": "2731",
                    "name": "Производство волоконно-оптических кабелей",
                    "children": [],
                    "path": "C/20/27/273/2731/"
                  },
                  {
                    "code": "27310",
                    "name": "Производство волоконно-оптических кабелей",
                    "children": [],
                    "path": "C/20/27/273/27310/"
                  },
                  {
                    "code": "2732",
                    "name": "Производство прочих электрических проводов и кабелей",
                    "children": [],
                    "path": "C/20/27/273/2732/"
                  },
                  {
                    "code": "27320",
                    "name": "Производство прочих электрических проводов и кабелей",
                    "children": [],
                    "path": "C/20/27/273/27320/"
                  },
                  {
                    "code": "2733",
                    "name": "Производство электромонтажных устройств",
                    "children": [],
                    "path": "C/20/27/273/2733/"
                  },
                  {
                    "code": "27330",
                    "name": "Производство электромонтажных устройств",
                    "children": [],
                    "path": "C/20/27/273/27330/"
                  }
                ],
                "path": "C/20/27/273/"
              },
              {
                "code": "274",
                "name": "Производство электроосветительного оборудования",
                "children": [],
                "path": "C/20/27/274/"
              },
              {
                "code": "2740",
                "name": "Производство электроосветительного оборудования",
                "children": [
                  {
                    "code": "27401",
                    "name": "Производство электроламп",
                    "children": [],
                    "path": "C/20/27/2740/27401/"
                  },
                  {
                    "code": "27402",
                    "name": "Производство осветительных приборов",
                    "children": [],
                    "path": "C/20/27/2740/27402/"
                  }
                ],
                "path": "C/20/27/2740/"
              },
              {
                "code": "275",
                "name": "Производство бытовых приборов",
                "children": [
                  {
                    "code": "2751",
                    "name": "Производство электрических бытовых приборов",
                    "children": [
                      {
                        "code": "27511",
                        "name": "Производство электрических бытовых приборов, кроме холодильников и морозильников",
                        "children": [],
                        "path": "C/20/27/275/2751/27511/"
                      },
                      {
                        "code": "27512",
                        "name": "Производство бытовых холодильников и морозильников",
                        "children": [],
                        "path": "C/20/27/275/2751/27512/"
                      }
                    ],
                    "path": "C/20/27/275/2751/"
                  },
                  {
                    "code": "2752",
                    "name": "Производство неэлектрических бытовых приборов",
                    "children": [],
                    "path": "C/20/27/275/2752/"
                  },
                  {
                    "code": "27520",
                    "name": "Производство неэлектрических бытовых приборов",
                    "children": [],
                    "path": "C/20/27/275/27520/"
                  }
                ],
                "path": "C/20/27/275/"
              },
              {
                "code": "279",
                "name": "Производство прочего электрического оборудования",
                "children": [],
                "path": "C/20/27/279/"
              },
              {
                "code": "2790",
                "name": "Производство прочего электрического оборудования",
                "children": [
                  {
                    "code": "27901",
                    "name": "Производство электродной продукции",
                    "children": [],
                    "path": "C/20/27/2790/27901/"
                  },
                  {
                    "code": "27902",
                    "name": "Производство электроизоляционных изделий",
                    "children": [],
                    "path": "C/20/27/2790/27902/"
                  },
                  {
                    "code": "27903",
                    "name": "Производство электрического сигнального оборудования",
                    "children": [],
                    "path": "C/20/27/2790/27903/"
                  },
                  {
                    "code": "27909",
                    "name": "Производство прочего электрического оборудования, не включенного в другие группировки",
                    "children": [],
                    "path": "C/20/27/2790/27909/"
                  }
                ],
                "path": "C/20/27/2790/"
              }
            ],
            "path": "C/20/27/"
          },
          {
            "code": "28",
            "name": "Производство машин и оборудования, не включенных в другие группировки",
            "children": [
              {
                "code": "281",
                "name": "Производство оборудования общего назначения",
                "children": [
                  {
                    "code": "2811",
                    "name": "Производство двигателей и турбин, кроме авиационных, автомобильных и мотоциклетных двигателей",
                    "children": [
                      {
                        "code": "28111",
                        "name": "Производство двигателей",
                        "children": [],
                        "path": "C/20/28/281/2811/28111/"
                      },
                      {
                        "code": "28112",
                        "name": "Производство турбин",
                        "children": [],
                        "path": "C/20/28/281/2811/28112/"
                      }
                    ],
                    "path": "C/20/28/281/2811/"
                  },
                  {
                    "code": "2812",
                    "name": "Производство гидравлического и пневматического оборудования",
                    "children": [],
                    "path": "C/20/28/281/2812/"
                  },
                  {
                    "code": "28120",
                    "name": "Производство гидравлического и пневматического оборудования",
                    "children": [],
                    "path": "C/20/28/281/28120/"
                  },
                  {
                    "code": "2813",
                    "name": "Производство прочих насосов и компрессоров",
                    "children": [
                      {
                        "code": "28131",
                        "name": "Производство вакуумных и воздушных насосов",
                        "children": [],
                        "path": "C/20/28/281/2813/28131/"
                      },
                      {
                        "code": "28132",
                        "name": "Производство компрессоров",
                        "children": [],
                        "path": "C/20/28/281/2813/28132/"
                      },
                      {
                        "code": "28139",
                        "name": "Производство прочих насосов, не включенных в другие группировки",
                        "children": [],
                        "path": "C/20/28/281/2813/28139/"
                      }
                    ],
                    "path": "C/20/28/281/2813/"
                  },
                  {
                    "code": "2814",
                    "name": "Производство прочих кранов, клапанов и вентилей",
                    "children": [],
                    "path": "C/20/28/281/2814/"
                  },
                  {
                    "code": "28140",
                    "name": "Производство прочих кранов, клапанов и вентилей",
                    "children": [],
                    "path": "C/20/28/281/28140/"
                  },
                  {
                    "code": "2815",
                    "name": "Производство подшипников, зубчатых передач, элементов зубчатых передач и приводов",
                    "children": [
                      {
                        "code": "28151",
                        "name": "Производство подшипников",
                        "children": [],
                        "path": "C/20/28/281/2815/28151/"
                      },
                      {
                        "code": "28152",
                        "name": "Производство зубчатых передач, элементов зубчатых передач и приводов",
                        "children": [],
                        "path": "C/20/28/281/2815/28152/"
                      }
                    ],
                    "path": "C/20/28/281/2815/"
                  }
                ],
                "path": "C/20/28/281/"
              },
              {
                "code": "282",
                "name": "Производство прочих машин и оборудования общего назначения",
                "children": [
                  {
                    "code": "2821",
                    "name": "Производство плит, печей и печных горелок",
                    "children": [
                      {
                        "code": "28211",
                        "name": "Производство неэлектрических печей, горелок и устройств для печей",
                        "children": [],
                        "path": "C/20/28/282/2821/28211/"
                      },
                      {
                        "code": "28212",
                        "name": "Производство электрических печей",
                        "children": [],
                        "path": "C/20/28/282/2821/28212/"
                      }
                    ],
                    "path": "C/20/28/282/2821/"
                  },
                  {
                    "code": "2822",
                    "name": "Производство подъемно-транспортного оборудования",
                    "children": [
                      {
                        "code": "28221",
                        "name": "Производство кранов (без строительных)",
                        "children": [],
                        "path": "C/20/28/282/2822/28221/"
                      },
                      {
                        "code": "28222",
                        "name": "Производство кранов для строительства",
                        "children": [],
                        "path": "C/20/28/282/2822/28222/"
                      },
                      {
                        "code": "28223",
                        "name": "Производство оборудования непрерывного транспорта",
                        "children": [],
                        "path": "C/20/28/282/2822/28223/"
                      },
                      {
                        "code": "28224",
                        "name": "Производство лифтов",
                        "children": [],
                        "path": "C/20/28/282/2822/28224/"
                      },
                      {
                        "code": "28225",
                        "name": "Производство авто- и электропогрузчиков",
                        "children": [],
                        "path": "C/20/28/282/2822/28225/"
                      },
                      {
                        "code": "28229",
                        "name": "Производство прочего подъемно-транспортного оборудования",
                        "children": [],
                        "path": "C/20/28/282/2822/28229/"
                      }
                    ],
                    "path": "C/20/28/282/2822/"
                  },
                  {
                    "code": "2823",
                    "name": "Производство офисной техники и оборудования (за исключением компьютеров и периферийного оборудования)",
                    "children": [],
                    "path": "C/20/28/282/2823/"
                  },
                  {
                    "code": "28230",
                    "name": "Производство офисной техники и оборудования (за исключением компьютеров и периферийного оборудования)",
                    "children": [],
                    "path": "C/20/28/282/28230/"
                  },
                  {
                    "code": "2824",
                    "name": "Производство ручных механизированных инструментов",
                    "children": [],
                    "path": "C/20/28/282/2824/"
                  },
                  {
                    "code": "28240",
                    "name": "Производство ручных механизированных инструментов",
                    "children": [],
                    "path": "C/20/28/282/28240/"
                  },
                  {
                    "code": "2825",
                    "name": "Производство промышленного холодильного и вентиляционного оборудования",
                    "children": [
                      {
                        "code": "28251",
                        "name": "Производство холодильного или морозильного оборудования",
                        "children": [],
                        "path": "C/20/28/282/2825/28251/"
                      },
                      {
                        "code": "28252",
                        "name": "Производство кондиционеров воздуха, вентиляторов",
                        "children": [],
                        "path": "C/20/28/282/2825/28252/"
                      }
                    ],
                    "path": "C/20/28/282/2825/"
                  },
                  {
                    "code": "2829",
                    "name": "Производство прочих машин и оборудования общего назначения, не включенных в другие группировки",
                    "children": [
                      {
                        "code": "28291",
                        "name": "Производство весоизмерительного оборудования (кроме высокоточного лабораторного оборудования)",
                        "children": [],
                        "path": "C/20/28/282/2829/28291/"
                      },
                      {
                        "code": "28292",
                        "name": "Производство оборудования для фильтрования и очистки",
                        "children": [],
                        "path": "C/20/28/282/2829/28292/"
                      },
                      {
                        "code": "28293",
                        "name": "Производство оборудования для распыления и разбрызгивания жидкостей или порошков",
                        "children": [],
                        "path": "C/20/28/282/2829/28293/"
                      },
                      {
                        "code": "28294",
                        "name": "Производство упаковочных и оберточных машин",
                        "children": [],
                        "path": "C/20/28/282/2829/28294/"
                      },
                      {
                        "code": "28295",
                        "name": "Производство оборудования и аппаратуры для химических процессов",
                        "children": [],
                        "path": "C/20/28/282/2829/28295/"
                      },
                      {
                        "code": "28296",
                        "name": "Производство чертежных, разметочных и измерительных инструментов",
                        "children": [],
                        "path": "C/20/28/282/2829/28296/"
                      },
                      {
                        "code": "28299",
                        "name": "Производство прочих машин и оборудования, деталей и узлов",
                        "children": [],
                        "path": "C/20/28/282/2829/28299/"
                      }
                    ],
                    "path": "C/20/28/282/2829/"
                  }
                ],
                "path": "C/20/28/282/"
              },
              {
                "code": "283",
                "name": "Производство сельскохозяйственной и лесохозяйственной техники",
                "children": [],
                "path": "C/20/28/283/"
              },
              {
                "code": "2830",
                "name": "Производство сельскохозяйственной и лесохозяйственной техники",
                "children": [
                  {
                    "code": "28301",
                    "name": "Производство сельскохозяйственных и лесохозяйственных тракторов",
                    "children": [],
                    "path": "C/20/28/2830/28301/"
                  },
                  {
                    "code": "28302",
                    "name": "Производство сельскохозяйственных машин",
                    "children": [],
                    "path": "C/20/28/2830/28302/"
                  },
                  {
                    "code": "28303",
                    "name": "Производство оборудования для животноводства и кормопроизводства",
                    "children": [],
                    "path": "C/20/28/2830/28303/"
                  },
                  {
                    "code": "28304",
                    "name": "Производство лесозаготовительного и мелиоративного оборудования",
                    "children": [],
                    "path": "C/20/28/2830/28304/"
                  }
                ],
                "path": "C/20/28/2830/"
              },
              {
                "code": "284",
                "name": "Производство станков для обработки металлов и прочих станков",
                "children": [
                  {
                    "code": "2841",
                    "name": "Производство станков для обработки металлов",
                    "children": [
                      {
                        "code": "28411",
                        "name": "Производство станков для обработки металлов лазером и станков аналогичных",
                        "children": [],
                        "path": "C/20/28/284/2841/28411/"
                      },
                      {
                        "code": "28412",
                        "name": "Производство токарных, расточных, сверлильных и фрезерных станков",
                        "children": [],
                        "path": "C/20/28/284/2841/28412/"
                      },
                      {
                        "code": "28413",
                        "name": "Производство прочих металлорежущих станков",
                        "children": [],
                        "path": "C/20/28/284/2841/28413/"
                      },
                      {
                        "code": "28414",
                        "name": "Производство частей и приспособлений к металлообрабатывающим станкам",
                        "children": [],
                        "path": "C/20/28/284/2841/28414/"
                      }
                    ],
                    "path": "C/20/28/284/2841/"
                  },
                  {
                    "code": "2849",
                    "name": "Производство прочих станков",
                    "children": [
                      {
                        "code": "28491",
                        "name": "Производство станков для обработки камня, дерева и материалов твердых аналогичных",
                        "children": [],
                        "path": "C/20/28/284/2849/28491/"
                      },
                      {
                        "code": "28498",
                        "name": "Производство частей и приспособлений прочих станков",
                        "children": [],
                        "path": "C/20/28/284/2849/28498/"
                      },
                      {
                        "code": "28499",
                        "name": "Производство прочих станков, не включенных в другие группировки",
                        "children": [],
                        "path": "C/20/28/284/2849/28499/"
                      }
                    ],
                    "path": "C/20/28/284/2849/"
                  }
                ],
                "path": "C/20/28/284/"
              },
              {
                "code": "289",
                "name": "Производство прочих машин и оборудования специального назначения",
                "children": [
                  {
                    "code": "2891",
                    "name": "Производство машин и оборудования для металлургии",
                    "children": [],
                    "path": "C/20/28/289/2891/"
                  },
                  {
                    "code": "28910",
                    "name": "Производство машин и оборудования для металлургии",
                    "children": [],
                    "path": "C/20/28/289/28910/"
                  },
                  {
                    "code": "2892",
                    "name": "Производство машин и оборудования для горнодобывающей промышленности, подземной разработки и строительства",
                    "children": [
                      {
                        "code": "28921",
                        "name": "Производство горношахтного и горнорудного оборудования",
                        "children": [],
                        "path": "C/20/28/289/2892/28921/"
                      },
                      {
                        "code": "28922",
                        "name": "Производство дорожных и землеройных машин",
                        "children": [],
                        "path": "C/20/28/289/2892/28922/"
                      },
                      {
                        "code": "28923",
                        "name": "Производство строительных машин",
                        "children": [],
                        "path": "C/20/28/289/2892/28923/"
                      },
                      {
                        "code": "28924",
                        "name": "Производство оборудования для обработки строительных материалов",
                        "children": [],
                        "path": "C/20/28/289/2892/28924/"
                      },
                      {
                        "code": "28925",
                        "name": "Производство оборудования для торфяной промышленности",
                        "children": [],
                        "path": "C/20/28/289/2892/28925/"
                      }
                    ],
                    "path": "C/20/28/289/2892/"
                  },
                  {
                    "code": "2893",
                    "name": "Производство машин и оборудования для производства и переработки продуктов питания, напитков и табачных изделий",
                    "children": [],
                    "path": "C/20/28/289/2893/"
                  },
                  {
                    "code": "28930",
                    "name": "Производство машин и оборудования для производства и переработки продуктов питания, напитков и табачных изделий",
                    "children": [],
                    "path": "C/20/28/289/28930/"
                  },
                  {
                    "code": "2894",
                    "name": "Производство машин и оборудования для изготовления текстильных, швейных, меховых и кожаных изделий",
                    "children": [
                      {
                        "code": "28941",
                        "name": "Производство машин и оборудования для текстильной промышленности",
                        "children": [],
                        "path": "C/20/28/289/2894/28941/"
                      },
                      {
                        "code": "28942",
                        "name": "Производство машин и оборудования для швейной и трикотажной промышленности",
                        "children": [],
                        "path": "C/20/28/289/2894/28942/"
                      },
                      {
                        "code": "28943",
                        "name": "Производство швейных машин",
                        "children": [],
                        "path": "C/20/28/289/2894/28943/"
                      },
                      {
                        "code": "28944",
                        "name": "Производство машин и оборудования для обувной, меховой, кожевенной и кожгалантерейной промышленности",
                        "children": [],
                        "path": "C/20/28/289/2894/28944/"
                      },
                      {
                        "code": "28945",
                        "name": "Производство специального оборудования для предприятий бытового обслуживания",
                        "children": [],
                        "path": "C/20/28/289/2894/28945/"
                      },
                      {
                        "code": "28946",
                        "name": "Производство оборудования для получения химического волокна",
                        "children": [],
                        "path": "C/20/28/289/2894/28946/"
                      }
                    ],
                    "path": "C/20/28/289/2894/"
                  },
                  {
                    "code": "2895",
                    "name": "Производство машин и оборудования для изготовления бумаги и картона",
                    "children": [],
                    "path": "C/20/28/289/2895/"
                  },
                  {
                    "code": "28950",
                    "name": "Производство машин и оборудования для изготовления бумаги и картона",
                    "children": [],
                    "path": "C/20/28/289/28950/"
                  },
                  {
                    "code": "2896",
                    "name": "Производство машин и оборудования для обработки пластмасс и резины",
                    "children": [],
                    "path": "C/20/28/289/2896/"
                  },
                  {
                    "code": "28960",
                    "name": "Производство машин и оборудования для обработки пластмасс и резины",
                    "children": [],
                    "path": "C/20/28/289/28960/"
                  },
                  {
                    "code": "2899",
                    "name": "Производство прочих машин и оборудования специального назначения, не включенных в другие группировки",
                    "children": [
                      {
                        "code": "28991",
                        "name": "Производство нефтепромыслового и бурового геологоразведочного оборудования",
                        "children": [],
                        "path": "C/20/28/289/2899/28991/"
                      },
                      {
                        "code": "28992",
                        "name": "Производство нефтегазоперерабатывающего оборудования",
                        "children": [],
                        "path": "C/20/28/289/2899/28992/"
                      },
                      {
                        "code": "28993",
                        "name": "Производство специального технологического оборудования для электронной промышленности",
                        "children": [],
                        "path": "C/20/28/289/2899/28993/"
                      },
                      {
                        "code": "28994",
                        "name": "Производство технологического оборудования для стекольной промышленности",
                        "children": [],
                        "path": "C/20/28/289/2899/28994/"
                      },
                      {
                        "code": "28995",
                        "name": "Производство технологического оборудования для полиграфической промышленности",
                        "children": [],
                        "path": "C/20/28/289/2899/28995/"
                      },
                      {
                        "code": "28996",
                        "name": "Производство каруселей, качелей, тиров и других аттракционов",
                        "children": [],
                        "path": "C/20/28/289/2899/28996/"
                      },
                      {
                        "code": "28999",
                        "name": "Производство других машин специального назначения",
                        "children": [],
                        "path": "C/20/28/289/2899/28999/"
                      }
                    ],
                    "path": "C/20/28/289/2899/"
                  }
                ],
                "path": "C/20/28/289/"
              }
            ],
            "path": "C/20/28/"
          },
          {
            "code": "29",
            "name": "Производство автомобилей, прицепов и полуприцепов",
            "children": [
              {
                "code": "291",
                "name": "Производство автомобилей",
                "children": [],
                "path": "C/20/29/291/"
              },
              {
                "code": "2910",
                "name": "Производство автомобилей",
                "children": [
                  {
                    "code": "29101",
                    "name": "Производство автомобилей, кроме двигателей для автомобилей",
                    "children": [],
                    "path": "C/20/29/2910/29101/"
                  },
                  {
                    "code": "29102",
                    "name": "Производство двигателей",
                    "children": [],
                    "path": "C/20/29/2910/29102/"
                  }
                ],
                "path": "C/20/29/2910/"
              },
              {
                "code": "292",
                "name": "Производство кузовов для автомобилей; производство прицепов и полуприцепов",
                "children": [],
                "path": "C/20/29/292/"
              },
              {
                "code": "2920",
                "name": "Производство кузовов для автомобилей; производство прицепов и полуприцепов",
                "children": [
                  {
                    "code": "29201",
                    "name": "Производство кузовов для автомобилей",
                    "children": [],
                    "path": "C/20/29/2920/29201/"
                  },
                  {
                    "code": "29202",
                    "name": "Производство прицепов и полуприцепов",
                    "children": [],
                    "path": "C/20/29/2920/29202/"
                  }
                ],
                "path": "C/20/29/2920/"
              },
              {
                "code": "293",
                "name": "Производство частей и принадлежностей автомобилей",
                "children": [
                  {
                    "code": "2931",
                    "name": "Производство электрического и электронного оборудования для автомобилей",
                    "children": [],
                    "path": "C/20/29/293/2931/"
                  },
                  {
                    "code": "29310",
                    "name": "Производство электрического и электронного оборудования для автомобилей",
                    "children": [],
                    "path": "C/20/29/293/29310/"
                  },
                  {
                    "code": "2932",
                    "name": "Производство прочих частей и принадлежностей автомобилей",
                    "children": [],
                    "path": "C/20/29/293/2932/"
                  },
                  {
                    "code": "29320",
                    "name": "Производство прочих частей и принадлежностей автомобилей",
                    "children": [],
                    "path": "C/20/29/293/29320/"
                  }
                ],
                "path": "C/20/29/293/"
              }
            ],
            "path": "C/20/29/"
          }
        ],
        "path": "C/20/"
      },
      {
        "code": "30",
        "name": "Производство прочих транспортных средств",
        "children": [
          {
            "code": "301",
            "name": "Строительство судов и лодок",
            "children": [
              {
                "code": "3011",
                "name": "Строительство судов и плавучих средств",
                "children": [],
                "path": "C/30/301/3011/"
              },
              {
                "code": "30110",
                "name": "Строительство судов и плавучих средств",
                "children": [],
                "path": "C/30/301/30110/"
              },
              {
                "code": "3012",
                "name": "Строительство прогулочных и спортивных лодок",
                "children": [],
                "path": "C/30/301/3012/"
              },
              {
                "code": "30120",
                "name": "Строительство прогулочных и спортивных лодок",
                "children": [],
                "path": "C/30/301/30120/"
              }
            ],
            "path": "C/30/301/"
          },
          {
            "code": "302",
            "name": "Производство железнодорожных локомотивов и подвижного состава",
            "children": [],
            "path": "C/30/302/"
          },
          {
            "code": "3020",
            "name": "Производство железнодорожных локомотивов и подвижного состава",
            "children": [],
            "path": "C/30/3020/"
          },
          {
            "code": "30200",
            "name": "Производство железнодорожных локомотивов и подвижного состава",
            "children": [],
            "path": "C/30/30200/"
          },
          {
            "code": "303",
            "name": "Производство воздушных и космических летательных аппаратов и связанного с ними оборудования",
            "children": [],
            "path": "C/30/303/"
          },
          {
            "code": "3030",
            "name": "Производство воздушных и космических летательных аппаратов и связанного с ними оборудования",
            "children": [
              {
                "code": "30301",
                "name": "Производство воздушных летательных аппаратов",
                "children": [],
                "path": "C/30/3030/30301/"
              },
              {
                "code": "30302",
                "name": "Производство космических летательных аппаратов",
                "children": [],
                "path": "C/30/3030/30302/"
              }
            ],
            "path": "C/30/3030/"
          },
          {
            "code": "304",
            "name": "Производство военных боевых транспортных средств",
            "children": [],
            "path": "C/30/304/"
          },
          {
            "code": "3040",
            "name": "Производство военных боевых транспортных средств",
            "children": [],
            "path": "C/30/3040/"
          },
          {
            "code": "30400",
            "name": "Производство военных боевых транспортных средств",
            "children": [],
            "path": "C/30/30400/"
          },
          {
            "code": "309",
            "name": "Производство транспортных средств, не включенных в другие группировки",
            "children": [
              {
                "code": "3091",
                "name": "Производство мотоциклов",
                "children": [],
                "path": "C/30/309/3091/"
              },
              {
                "code": "30910",
                "name": "Производство мотоциклов",
                "children": [],
                "path": "C/30/309/30910/"
              },
              {
                "code": "3092",
                "name": "Производство велосипедов, детских колясок и кресло-колясок для лиц с инвалидностью",
                "children": [
                  {
                    "code": "30921",
                    "name": "Производство велосипедов",
                    "children": [],
                    "path": "C/30/309/3092/30921/"
                  },
                  {
                    "code": "30922",
                    "name": "Производство кресло-колясок для лиц с инвалидностью",
                    "children": [],
                    "path": "C/30/309/3092/30922/"
                  },
                  {
                    "code": "30923",
                    "name": "Производство детских колясок",
                    "children": [],
                    "path": "C/30/309/3092/30923/"
                  }
                ],
                "path": "C/30/309/3092/"
              },
              {
                "code": "3099",
                "name": "Производство прочих транспортных средств и оборудования, не включенных в другие группировки",
                "children": [],
                "path": "C/30/309/3099/"
              },
              {
                "code": "30990",
                "name": "Производство прочих транспортных средств и оборудования, не включенных в другие группировки",
                "children": [],
                "path": "C/30/309/30990/"
              }
            ],
            "path": "C/30/309/"
          },
          {
            "code": "31",
            "name": "Производство мебели",
            "children": [],
            "path": "C/30/31/"
          },
          {
            "code": "32",
            "name": "Производство прочих готовых изделий",
            "children": [
              {
                "code": "321",
                "name": "Производство ювелирных изделий, бижутерии и аналогичных изделий",
                "children": [
                  {
                    "code": "3211",
                    "name": "Чеканка/выпуск монет и медалей",
                    "children": [],
                    "path": "C/30/32/321/3211/"
                  },
                  {
                    "code": "32110",
                    "name": "Чеканка/выпуск монет и медалей",
                    "children": [],
                    "path": "C/30/32/321/32110/"
                  },
                  {
                    "code": "3212",
                    "name": "Производство ювелирных и аналогичных изделий",
                    "children": [],
                    "path": "C/30/32/321/3212/"
                  },
                  {
                    "code": "32120",
                    "name": "Производство ювелирных и аналогичных изделий",
                    "children": [],
                    "path": "C/30/32/321/32120/"
                  },
                  {
                    "code": "3213",
                    "name": "Производство бижутерии и аналогичных изделий",
                    "children": [],
                    "path": "C/30/32/321/3213/"
                  },
                  {
                    "code": "32130",
                    "name": "Производство бижутерии и аналогичных изделий",
                    "children": [],
                    "path": "C/30/32/321/32130/"
                  }
                ],
                "path": "C/30/32/321/"
              },
              {
                "code": "322",
                "name": "Производство музыкальных инструментов",
                "children": [],
                "path": "C/30/32/322/"
              },
              {
                "code": "3220",
                "name": "Производство музыкальных инструментов",
                "children": [],
                "path": "C/30/32/3220/"
              },
              {
                "code": "32200",
                "name": "Производство музыкальных инструментов",
                "children": [],
                "path": "C/30/32/32200/"
              },
              {
                "code": "323",
                "name": "Производство спортивных товаров",
                "children": [],
                "path": "C/30/32/323/"
              },
              {
                "code": "3230",
                "name": "Производство спортивных товаров",
                "children": [],
                "path": "C/30/32/3230/"
              },
              {
                "code": "32300",
                "name": "Производство спортивных товаров",
                "children": [],
                "path": "C/30/32/32300/"
              },
              {
                "code": "324",
                "name": "Производство игр и игрушек",
                "children": [],
                "path": "C/30/32/324/"
              },
              {
                "code": "3240",
                "name": "Производство игр и игрушек",
                "children": [],
                "path": "C/30/32/3240/"
              },
              {
                "code": "32400",
                "name": "Производство игр и игрушек",
                "children": [],
                "path": "C/30/32/32400/"
              },
              {
                "code": "325",
                "name": "Производство медицинских и стоматологических инструментов и принадлежностей",
                "children": [],
                "path": "C/30/32/325/"
              },
              {
                "code": "3250",
                "name": "Производство медицинских и стоматологических инструментов и принадлежностей",
                "children": [
                  {
                    "code": "32501",
                    "name": "Производство цементов, используемых в медицине",
                    "children": [],
                    "path": "C/30/32/3250/32501/"
                  },
                  {
                    "code": "32502",
                    "name": "Производство медицинских и ветеринарных инструментов, аппаратов и оборудования",
                    "children": [],
                    "path": "C/30/32/3250/32502/"
                  },
                  {
                    "code": "32503",
                    "name": "Производство хирургических и ортопедических приспособлений",
                    "children": [],
                    "path": "C/30/32/3250/32503/"
                  },
                  {
                    "code": "32504",
                    "name": "Производство медицинской, хирургической, стоматологической и ветеринарной мебели",
                    "children": [],
                    "path": "C/30/32/3250/32504/"
                  }
                ],
                "path": "C/30/32/3250/"
              },
              {
                "code": "329",
                "name": "Производство прочих готовых изделий, не включенных в другие группировки",
                "children": [
                  {
                    "code": "3291",
                    "name": "Производство метел и щеток",
                    "children": [],
                    "path": "C/30/32/329/3291/"
                  },
                  {
                    "code": "32910",
                    "name": "Производство метел и щеток",
                    "children": [],
                    "path": "C/30/32/329/32910/"
                  },
                  {
                    "code": "3299",
                    "name": "Производство прочей продукции, не включенной в другие группировки",
                    "children": [
                      {
                        "code": "32991",
                        "name": "Производство канцелярских изделий",
                        "children": [],
                        "path": "C/30/32/329/3299/32991/"
                      },
                      {
                        "code": "32992",
                        "name": "Производство изделий металлической галантереи",
                        "children": [],
                        "path": "C/30/32/329/3299/32992/"
                      },
                      {
                        "code": "32993",
                        "name": "Производство сувенирных изделий",
                        "children": [],
                        "path": "C/30/32/329/3299/32993/"
                      },
                      {
                        "code": "32999",
                        "name": "Производство прочих изделий",
                        "children": [],
                        "path": "C/30/32/329/3299/32999/"
                      }
                    ],
                    "path": "C/30/32/329/3299/"
                  }
                ],
                "path": "C/30/32/329/"
              }
            ],
            "path": "C/30/32/"
          },
          {
            "code": "33",
            "name": "Ремонт и установка машин и оборудования",
            "children": [
              {
                "code": "331",
                "name": "Ремонт готовых металлических изделий, машин и оборудования",
                "children": [
                  {
                    "code": "3311",
                    "name": "Ремонт готовых металлических изделий",
                    "children": [
                      {
                        "code": "33111",
                        "name": "Ремонт металлических цистерн, резервуаров и контейнеров",
                        "children": [],
                        "path": "C/30/33/331/3311/33111/"
                      },
                      {
                        "code": "33112",
                        "name": "Ремонт радиаторов и котлов центрального отопления",
                        "children": [],
                        "path": "C/30/33/331/3311/33112/"
                      },
                      {
                        "code": "33113",
                        "name": "Ремонт паровых котлов, кроме котлов центрального отопления",
                        "children": [],
                        "path": "C/30/33/331/3311/33113/"
                      },
                      {
                        "code": "33114",
                        "name": "Ремонт огнестрельного оружия и артиллерийских орудий",
                        "children": [],
                        "path": "C/30/33/331/3311/33114/"
                      },
                      {
                        "code": "33119",
                        "name": "Ремонт прочих металлических изделий",
                        "children": [],
                        "path": "C/30/33/331/3311/33119/"
                      }
                    ],
                    "path": "C/30/33/331/3311/"
                  },
                  {
                    "code": "3312",
                    "name": "Ремонт машин и оборудования",
                    "children": [
                      {
                        "code": "33121",
                        "name": "Ремонт и техническое обслуживание механического оборудования",
                        "children": [],
                        "path": "C/30/33/331/3312/33121/"
                      },
                      {
                        "code": "33122",
                        "name": "Ремонт и техническое обслуживание прочего оборудования общего назначения",
                        "children": [],
                        "path": "C/30/33/331/3312/33122/"
                      },
                      {
                        "code": "33123",
                        "name": "Ремонт и техническое обслуживание машин и оборудования для сельского и лесного хозяйства",
                        "children": [],
                        "path": "C/30/33/331/3312/33123/"
                      },
                      {
                        "code": "33124",
                        "name": "Ремонт и техническое обслуживание станков",
                        "children": [],
                        "path": "C/30/33/331/3312/33124/"
                      },
                      {
                        "code": "33125",
                        "name": "Ремонт и техническое обслуживание прочих машин и оборудования специального назначения",
                        "children": [],
                        "path": "C/30/33/331/3312/33125/"
                      },
                      {
                        "code": "33126",
                        "name": "Ремонт и техническое обслуживание офисных машин и вычислительной техники",
                        "children": [],
                        "path": "C/30/33/331/3312/33126/"
                      }
                    ],
                    "path": "C/30/33/331/3312/"
                  },
                  {
                    "code": "3313",
                    "name": "Ремонт электронного и оптического оборудования",
                    "children": [
                      {
                        "code": "33131",
                        "name": "Ремонт и техническое обслуживание инструментов и приборов для измерения, тестирования и навигации",
                        "children": [],
                        "path": "C/30/33/331/3313/33131/"
                      },
                      {
                        "code": "33132",
                        "name": "Ремонт контрольного оборудования",
                        "children": [],
                        "path": "C/30/33/331/3313/33132/"
                      },
                      {
                        "code": "33133",
                        "name": "Ремонт и техническое обслуживание облучающего, электромедицинского и электротерапевтического оборудования",
                        "children": [],
                        "path": "C/30/33/331/3313/33133/"
                      },
                      {
                        "code": "33134",
                        "name": "Ремонт и техническое обслуживание оптических приборов и фотографического оборудования",
                        "children": [],
                        "path": "C/30/33/331/3313/33134/"
                      }
                    ],
                    "path": "C/30/33/331/3313/"
                  },
                  {
                    "code": "3314",
                    "name": "Ремонт электрического оборудования",
                    "children": [
                      {
                        "code": "33141",
                        "name": "Ремонт и техническое обслуживание электродвигателей, генераторов и трансформаторов",
                        "children": [],
                        "path": "C/30/33/331/3314/33141/"
                      },
                      {
                        "code": "33142",
                        "name": "Ремонт и техническое обслуживание электрораспределительной и регулирующей аппаратуры",
                        "children": [],
                        "path": "C/30/33/331/3314/33142/"
                      },
                      {
                        "code": "33143",
                        "name": "Ремонт и техническое обслуживание электроосветительного оборудования",
                        "children": [],
                        "path": "C/30/33/331/3314/33143/"
                      },
                      {
                        "code": "33149",
                        "name": "Ремонт и техническое обслуживание прочего электрооборудования, не включенного в другие группировки",
                        "children": [],
                        "path": "C/30/33/331/3314/33149/"
                      }
                    ],
                    "path": "C/30/33/331/3314/"
                  },
                  {
                    "code": "3315",
                    "name": "Ремонт и техническое обслуживание судов и лодок",
                    "children": [
                      {
                        "code": "33151",
                        "name": "Ремонт и техническое обслуживание судов",
                        "children": [],
                        "path": "C/30/33/331/3315/33151/"
                      },
                      {
                        "code": "33152",
                        "name": "Ремонт и техническое обслуживание спортивных и прогулочных лодок",
                        "children": [],
                        "path": "C/30/33/331/3315/33152/"
                      }
                    ],
                    "path": "C/30/33/331/3315/"
                  },
                  {
                    "code": "3316",
                    "name": "Ремонт и техническое обслуживание воздушных и космических летательных аппаратов",
                    "children": [],
                    "path": "C/30/33/331/3316/"
                  },
                  {
                    "code": "33160",
                    "name": "Ремонт и техническое обслуживание воздушных и космических летательных аппаратов",
                    "children": [],
                    "path": "C/30/33/331/33160/"
                  },
                  {
                    "code": "3317",
                    "name": "Ремонт и техническое обслуживание прочих транспортных средств и оборудования",
                    "children": [
                      {
                        "code": "33171",
                        "name": "Ремонт подвижного состава железных дорог",
                        "children": [],
                        "path": "C/30/33/331/3317/33171/"
                      },
                      {
                        "code": "33172",
                        "name": "Ремонт трамваев, вагонов метро и троллейбусов",
                        "children": [],
                        "path": "C/30/33/331/3317/33172/"
                      },
                      {
                        "code": "33179",
                        "name": "Ремонт прочих транспортных средств и оборудования, не включенных в другие группировки",
                        "children": [],
                        "path": "C/30/33/331/3317/33179/"
                      }
                    ],
                    "path": "C/30/33/331/3317/"
                  },
                  {
                    "code": "3319",
                    "name": "Ремонт прочего оборудования",
                    "children": [],
                    "path": "C/30/33/331/3319/"
                  },
                  {
                    "code": "33190",
                    "name": "Ремонт прочего оборудования",
                    "children": [],
                    "path": "C/30/33/331/33190/"
                  }
                ],
                "path": "C/30/33/331/"
              },
              {
                "code": "332",
                "name": "Монтаж, установка промышленных машин и оборудования",
                "children": [],
                "path": "C/30/33/332/"
              },
              {
                "code": "3320",
                "name": "Монтаж, установка промышленных машин и оборудования",
                "children": [],
                "path": "C/30/33/3320/"
              },
              {
                "code": "33200",
                "name": "Монтаж, установка промышленных машин и оборудования",
                "children": [],
                "path": "C/30/33/33200/"
              }
            ],
            "path": "C/30/33/"
          }
        ],
        "path": "C/30/"
      },
      {
        "code": "310",
        "name": "Производство мебели",
        "children": [
          {
            "code": "3101",
            "name": "Производство мебели для офисов и предприятий торговли",
            "children": [
              {
                "code": "31011",
                "name": "Производство стульев и другой мебели для сидения",
                "children": [],
                "path": "C/310/3101/31011/"
              },
              {
                "code": "31012",
                "name": "Производство мебели для офисов и предприятий торговли, кроме стульев и другой мебели для сидения",
                "children": [],
                "path": "C/310/3101/31012/"
              }
            ],
            "path": "C/310/3101/"
          },
          {
            "code": "3102",
            "name": "Производство кухонной мебели",
            "children": [],
            "path": "C/310/3102/"
          },
          {
            "code": "31020",
            "name": "Производство кухонной мебели",
            "children": [],
            "path": "C/310/31020/"
          },
          {
            "code": "3103",
            "name": "Производство матрасов",
            "children": [],
            "path": "C/310/3103/"
          },
          {
            "code": "31030",
            "name": "Производство матрасов",
            "children": [],
            "path": "C/310/31030/"
          },
          {
            "code": "3109",
            "name": "Производство прочей мебели",
            "children": [],
            "path": "C/310/3109/"
          },
          {
            "code": "31090",
            "name": "Производство прочей мебели",
            "children": [],
            "path": "C/310/31090/"
          }
        ],
        "path": "C/310/"
      }
    ],
    "path": "C/"
  },
  {
    "code": "D",
    "name": "Снабжение электроэнергией, газом, паром, горячей водой и кондиционированным воздухом",
    "children": [
      {
        "code": "35",
        "name": "Снабжение электроэнергией, газом, паром, горячей водой и кондиционированным воздухом",
        "children": [
          {
            "code": "351",
            "name": "Производство, передача и распределение электроэнергии",
            "children": [
              {
                "code": "3511",
                "name": "Производство электроэнергии",
                "children": [
                  {
                    "code": "35111",
                    "name": "Производство электроэнергии тепловыми электростанциями",
                    "children": [],
                    "path": "D/35/351/3511/35111/"
                  },
                  {
                    "code": "35112",
                    "name": "Производство электроэнергии гидроэлектростанциями",
                    "children": [],
                    "path": "D/35/351/3511/35112/"
                  },
                  {
                    "code": "35113",
                    "name": "Производство электроэнергии ядерными (атомными) электростанциями",
                    "children": [],
                    "path": "D/35/351/3511/35113/"
                  },
                  {
                    "code": "35114",
                    "name": "Производство электроэнергии ветровыми электростанциями",
                    "children": [],
                    "path": "D/35/351/3511/35114/"
                  },
                  {
                    "code": "35115",
                    "name": "Производство электроэнергии солнечными электростанциями",
                    "children": [],
                    "path": "D/35/351/3511/35115/"
                  },
                  {
                    "code": "35119",
                    "name": "Производство электроэнергии прочими электростанциями",
                    "children": [],
                    "path": "D/35/351/3511/35119/"
                  }
                ],
                "path": "D/35/351/3511/"
              },
              {
                "code": "3512",
                "name": "Передача электроэнергии",
                "children": [
                  {
                    "code": "35121",
                    "name": "Передача электроэнергии",
                    "children": [],
                    "path": "D/35/351/3512/35121/"
                  },
                  {
                    "code": "35122",
                    "name": "Техническая диспетчеризация отпуска в сеть и потребления электрической энергии, организация балансирования производства-потребления электрической энергии",
                    "children": [],
                    "path": "D/35/351/3512/35122/"
                  },
                  {
                    "code": "35123",
                    "name": "Эксплуатационное обслуживание оборудования Национальной электрической сети",
                    "children": [],
                    "path": "D/35/351/3512/35123/"
                  },
                  {
                    "code": "35124",
                    "name": "Обеспечение готовности электрической мощности к несению нагрузки, регулирование и резервирование электрической мощности",
                    "children": [],
                    "path": "D/35/351/3512/35124/"
                  }
                ],
                "path": "D/35/351/3512/"
              },
              {
                "code": "3513",
                "name": "Распределение электроэнергии",
                "children": [],
                "path": "D/35/351/3513/"
              },
              {
                "code": "35130",
                "name": "Распределение электроэнергии",
                "children": [],
                "path": "D/35/351/35130/"
              },
              {
                "code": "3514",
                "name": "Продажа электроэнергии",
                "children": [],
                "path": "D/35/351/3514/"
              },
              {
                "code": "35140",
                "name": "Продажа электроэнергии",
                "children": [],
                "path": "D/35/351/35140/"
              }
            ],
            "path": "D/35/351/"
          },
          {
            "code": "352",
            "name": "Производство и распределение газообразного топлива по трубопроводам",
            "children": [
              {
                "code": "3521",
                "name": "Производство газообразного топлива",
                "children": [],
                "path": "D/35/352/3521/"
              },
              {
                "code": "35210",
                "name": "Производство газообразного топлива",
                "children": [],
                "path": "D/35/352/35210/"
              },
              {
                "code": "3522",
                "name": "Распределение газообразного топлива по трубопроводам",
                "children": [],
                "path": "D/35/352/3522/"
              },
              {
                "code": "35220",
                "name": "Распределение газообразного топлива по трубопроводам",
                "children": [],
                "path": "D/35/352/35220/"
              },
              {
                "code": "3523",
                "name": "Продажа газообразного топлива по трубопроводам",
                "children": [],
                "path": "D/35/352/3523/"
              },
              {
                "code": "35230",
                "name": "Продажа газообразного топлива по трубопроводам",
                "children": [],
                "path": "D/35/352/35230/"
              }
            ],
            "path": "D/35/352/"
          },
          {
            "code": "353",
            "name": "Снабжение паром, горячей водой и кондиционированным воздухом",
            "children": [],
            "path": "D/35/353/"
          },
          {
            "code": "3530",
            "name": "Снабжение паром, горячей водой и кондиционированным воздухом",
            "children": [
              {
                "code": "35302",
                "name": "Производство тепловой энергии самостоятельными котельными",
                "children": [],
                "path": "D/35/3530/35302/"
              },
              {
                "code": "35303",
                "name": "Передача и распределение тепловой энергии",
                "children": [],
                "path": "D/35/3530/35303/"
              },
              {
                "code": "35304",
                "name": "Кондиционирование воздуха",
                "children": [],
                "path": "D/35/3530/35304/"
              },
              {
                "code": "35305",
                "name": "Производство тепловой энергии тепловыми электростанциями (включая ТЭЦ)",
                "children": [],
                "path": "D/35/3530/35305/"
              },
              {
                "code": "35307",
                "name": "Продажа тепловой энергии",
                "children": [],
                "path": "D/35/3530/35307/"
              },
              {
                "code": "35308",
                "name": "Производство тепловой энергии возобновляемыми и альтернативными источниками энергии",
                "children": [],
                "path": "D/35/3530/35308/"
              }
            ],
            "path": "D/35/3530/"
          }
        ],
        "path": "D/35/"
      }
    ],
    "path": "D/"
  },
  {
    "code": "E",
    "name": "Водоснабжение; водоотведение; сбор, обработка и удаление отходов, деятельность по ликвидации загрязнений",
    "children": [
      {
        "code": "36",
        "name": "Забор, обработка и распределение воды",
        "children": [],
        "path": "E/36/"
      },
      {
        "code": "360",
        "name": "Забор, обработка и распределение воды",
        "children": [],
        "path": "E/360/"
      },
      {
        "code": "3600",
        "name": "Забор, обработка и распределение воды",
        "children": [],
        "path": "E/3600/"
      },
      {
        "code": "36000",
        "name": "Забор, обработка и распределение воды",
        "children": [],
        "path": "E/36000/"
      },
      {
        "code": "37",
        "name": "Сбор и обработка сточных вод",
        "children": [],
        "path": "E/37/"
      },
      {
        "code": "370",
        "name": "Сбор и обработка сточных вод",
        "children": [],
        "path": "E/370/"
      },
      {
        "code": "3700",
        "name": "Сбор и обработка сточных вод",
        "children": [
          {
            "code": "37001",
            "name": "Эксплуатация сетей и сооружений систем водоотведения (канализации)",
            "children": [],
            "path": "E/3700/37001/"
          },
          {
            "code": "37002",
            "name": "Ассенизаторская деятельность",
            "children": [],
            "path": "E/3700/37002/"
          }
        ],
        "path": "E/3700/"
      },
      {
        "code": "38",
        "name": "Сбор, обработка и удаление отходов; утилизация (восстановление) материалов",
        "children": [
          {
            "code": "381",
            "name": "Сбор отходов",
            "children": [
              {
                "code": "3811",
                "name": "Сбор неопасных отходов",
                "children": [],
                "path": "E/38/381/3811/"
              },
              {
                "code": "38110",
                "name": "Сбор неопасных отходов",
                "children": [],
                "path": "E/38/381/38110/"
              },
              {
                "code": "3812",
                "name": "Сбор опасных отходов",
                "children": [],
                "path": "E/38/381/3812/"
              },
              {
                "code": "38120",
                "name": "Сбор опасных отходов",
                "children": [],
                "path": "E/38/381/38120/"
              }
            ],
            "path": "E/38/381/"
          },
          {
            "code": "382",
            "name": "Обработка и удаление отходов",
            "children": [
              {
                "code": "3821",
                "name": "Обработка и удаление неопасных отходов",
                "children": [],
                "path": "E/38/382/3821/"
              },
              {
                "code": "38210",
                "name": "Обработка и удаление неопасных отходов",
                "children": [],
                "path": "E/38/382/38210/"
              },
              {
                "code": "3822",
                "name": "Обработка и удаление опасных отходов",
                "children": [],
                "path": "E/38/382/3822/"
              },
              {
                "code": "38220",
                "name": "Обработка и удаление опасных отходов",
                "children": [],
                "path": "E/38/382/38220/"
              }
            ],
            "path": "E/38/382/"
          },
          {
            "code": "383",
            "name": "Утилизация (восстановление) материалов",
            "children": [
              {
                "code": "3831",
                "name": "Разборка машин и оборудования, не подлежащих восстановлению",
                "children": [],
                "path": "E/38/383/3831/"
              },
              {
                "code": "38310",
                "name": "Разборка машин и оборудования, не подлежащих восстановлению",
                "children": [],
                "path": "E/38/383/38310/"
              },
              {
                "code": "3832",
                "name": "Переработка отсортированных материалов",
                "children": [
                  {
                    "code": "38321",
                    "name": "Переработка отходов и лома черных металлов",
                    "children": [],
                    "path": "E/38/383/3832/38321/"
                  },
                  {
                    "code": "38322",
                    "name": "Переработка отходов и лома цветных металлов",
                    "children": [],
                    "path": "E/38/383/3832/38322/"
                  },
                  {
                    "code": "38323",
                    "name": "Переработка неметаллических отходов",
                    "children": [],
                    "path": "E/38/383/3832/38323/"
                  }
                ],
                "path": "E/38/383/3832/"
              }
            ],
            "path": "E/38/383/"
          }
        ],
        "path": "E/38/"
      },
      {
        "code": "39",
        "name": "Деятельность по ликвидации загрязнений и прочие услуги в области удаления отходов",
        "children": [],
        "path": "E/39/"
      },
      {
        "code": "390",
        "name": "Деятельность по ликвидации загрязнений и прочие услуги в области удаления отходов",
        "children": [],
        "path": "E/390/"
      },
      {
        "code": "3900",
        "name": "Деятельность по ликвидации загрязнений и прочие услуги в области удаления отходов",
        "children": [],
        "path": "E/3900/"
      },
      {
        "code": "39000",
        "name": "Деятельность по ликвидации загрязнений и прочие услуги в области удаления отходов",
        "children": [],
        "path": "E/39000/"
      }
    ],
    "path": "E/"
  },
  {
    "code": "F",
    "name": "Строительство",
    "children": [
      {
        "code": "41",
        "name": "Строительство зданий",
        "children": [
          {
            "code": "411",
            "name": "Разработка строительных проектов",
            "children": [],
            "path": "F/41/411/"
          },
          {
            "code": "4110",
            "name": "Разработка строительных проектов",
            "children": [],
            "path": "F/41/4110/"
          },
          {
            "code": "41100",
            "name": "Разработка строительных проектов",
            "children": [],
            "path": "F/41/41100/"
          },
          {
            "code": "412",
            "name": "Строительство жилых и нежилых зданий",
            "children": [],
            "path": "F/41/412/"
          },
          {
            "code": "4120",
            "name": "Строительство жилых и нежилых зданий",
            "children": [
              {
                "code": "41201",
                "name": "Строительство жилых зданий",
                "children": [],
                "path": "F/41/4120/41201/"
              },
              {
                "code": "41202",
                "name": "Строительство нежилых зданий, за исключением стационарных торговых объектов категорий 1, 2",
                "children": [],
                "path": "F/41/4120/41202/"
              },
              {
                "code": "41203",
                "name": "Строительство стационарных торговых объектов категории 1",
                "children": [],
                "path": "F/41/4120/41203/"
              },
              {
                "code": "41204",
                "name": "Строительство стационарных торговых объектов категории 2",
                "children": [],
                "path": "F/41/4120/41204/"
              }
            ],
            "path": "F/41/4120/"
          }
        ],
        "path": "F/41/"
      },
      {
        "code": "42",
        "name": "Гражданское строительство",
        "children": [
          {
            "code": "421",
            "name": "Строительство автомобильных и железных дорог",
            "children": [
              {
                "code": "4211",
                "name": "Строительство автомобильных дорог",
                "children": [
                  {
                    "code": "42111",
                    "name": "Строительство дорог и автомагистралей",
                    "children": [],
                    "path": "F/42/421/4211/42111/"
                  },
                  {
                    "code": "42112",
                    "name": "Деятельность по организации строительства, реконструкции, ремонта, платного движения и содержания автомобильных дорог (участков) общего пользования международного и республиканского значения",
                    "children": [],
                    "path": "F/42/421/4211/42112/"
                  }
                ],
                "path": "F/42/421/4211/"
              },
              {
                "code": "4212",
                "name": "Строительство железных дорог и метро",
                "children": [],
                "path": "F/42/421/4212/"
              },
              {
                "code": "42120",
                "name": "Строительство железных дорог и метро",
                "children": [],
                "path": "F/42/421/42120/"
              },
              {
                "code": "4213",
                "name": "Строительство мостов и туннелей",
                "children": [],
                "path": "F/42/421/4213/"
              },
              {
                "code": "42130",
                "name": "Строительство мостов и туннелей",
                "children": [],
                "path": "F/42/421/42130/"
              }
            ],
            "path": "F/42/421/"
          },
          {
            "code": "422",
            "name": "Строительство распределительных инженерных сооружений",
            "children": [
              {
                "code": "4221",
                "name": "Строительство трубопроводов",
                "children": [
                  {
                    "code": "42211",
                    "name": "Строительство нефтяных и газовых магистральных трубопроводов",
                    "children": [],
                    "path": "F/42/422/4221/42211/"
                  },
                  {
                    "code": "42212",
                    "name": "Строительство трубопроводов для систем водоснабжения и канализации",
                    "children": [],
                    "path": "F/42/422/4221/42212/"
                  },
                  {
                    "code": "42219",
                    "name": "Строительство прочих трубопроводов",
                    "children": [],
                    "path": "F/42/422/4221/42219/"
                  }
                ],
                "path": "F/42/422/4221/"
              },
              {
                "code": "4222",
                "name": "Строительство линий электропередач и телекоммуникаций",
                "children": [],
                "path": "F/42/422/4222/"
              },
              {
                "code": "42220",
                "name": "Строительство линий электропередач и телекоммуникаций",
                "children": [],
                "path": "F/42/422/42220/"
              }
            ],
            "path": "F/42/422/"
          },
          {
            "code": "429",
            "name": "Строительство прочих инженерных сооружений",
            "children": [
              {
                "code": "4291",
                "name": "Строительство водных сооружений",
                "children": [],
                "path": "F/42/429/4291/"
              },
              {
                "code": "42910",
                "name": "Строительство водных сооружений",
                "children": [],
                "path": "F/42/429/42910/"
              },
              {
                "code": "4299",
                "name": "Строительство прочих инженерных сооружений, не включенных в другие группировки",
                "children": [],
                "path": "F/42/429/4299/"
              },
              {
                "code": "42990",
                "name": "Строительство прочих инженерных сооружений, не включенных в другие группировки",
                "children": [],
                "path": "F/42/429/42990/"
              }
            ],
            "path": "F/42/429/"
          }
        ],
        "path": "F/42/"
      },
      {
        "code": "43",
        "name": "Специализированные строительные работы",
        "children": [
          {
            "code": "431",
            "name": "Снос зданий и сооружений, подготовка строительного участка",
            "children": [
              {
                "code": "4311",
                "name": "Разборка и снос зданий и сооружений",
                "children": [],
                "path": "F/43/431/4311/"
              },
              {
                "code": "43110",
                "name": "Разборка и снос зданий и сооружений",
                "children": [],
                "path": "F/43/431/43110/"
              },
              {
                "code": "4312",
                "name": "Подготовка строительного участка",
                "children": [
                  {
                    "code": "43121",
                    "name": "Земляные работы",
                    "children": [],
                    "path": "F/43/431/4312/43121/"
                  },
                  {
                    "code": "43122",
                    "name": "Взрывные работы",
                    "children": [],
                    "path": "F/43/431/4312/43122/"
                  },
                  {
                    "code": "43123",
                    "name": "Специальные работы в грунтах",
                    "children": [],
                    "path": "F/43/431/4312/43123/"
                  }
                ],
                "path": "F/43/431/4312/"
              },
              {
                "code": "4313",
                "name": "Разведочное бурение",
                "children": [],
                "path": "F/43/431/4313/"
              },
              {
                "code": "43130",
                "name": "Разведочное бурение",
                "children": [],
                "path": "F/43/431/43130/"
              }
            ],
            "path": "F/43/431/"
          },
          {
            "code": "432",
            "name": "Монтаж и установка электрического, водопроводного и прочего оборудования",
            "children": [
              {
                "code": "4321",
                "name": "Электромонтажные работы",
                "children": [
                  {
                    "code": "43211",
                    "name": "Электромонтажные работы по прокладке телекоммуникационных, компьютерных и телевизионных сетей",
                    "children": [],
                    "path": "F/43/432/4321/43211/"
                  },
                  {
                    "code": "43219",
                    "name": "Прочие электромонтажные работы",
                    "children": [],
                    "path": "F/43/432/4321/43219/"
                  }
                ],
                "path": "F/43/432/4321/"
              },
              {
                "code": "4322",
                "name": "Монтаж систем водоснабжения, отопления и кондиционирования воздуха",
                "children": [],
                "path": "F/43/432/4322/"
              },
              {
                "code": "43220",
                "name": "Монтаж систем водоснабжения, отопления и кондиционирования воздуха",
                "children": [],
                "path": "F/43/432/43220/"
              },
              {
                "code": "4329",
                "name": "Прочие строительно-монтажные работы",
                "children": [
                  {
                    "code": "43291",
                    "name": "Изоляционные работы",
                    "children": [],
                    "path": "F/43/432/4329/43291/"
                  },
                  {
                    "code": "43298",
                    "name": "Прочие строительно-монтажные работы, не включенные в другие группировки",
                    "children": [],
                    "path": "F/43/432/4329/43298/"
                  },
                  {
                    "code": "43299",
                    "name": "Пуск и наладка смонтированного оборудования",
                    "children": [],
                    "path": "F/43/432/4329/43299/"
                  }
                ],
                "path": "F/43/432/4329/"
              }
            ],
            "path": "F/43/432/"
          },
          {
            "code": "433",
            "name": "Отделочные работы",
            "children": [
              {
                "code": "4331",
                "name": "Штукатурные работы",
                "children": [],
                "path": "F/43/433/4331/"
              },
              {
                "code": "43310",
                "name": "Штукатурные работы",
                "children": [],
                "path": "F/43/433/43310/"
              },
              {
                "code": "4332",
                "name": "Столярные и плотницкие работы",
                "children": [],
                "path": "F/43/433/4332/"
              },
              {
                "code": "43320",
                "name": "Столярные и плотницкие работы",
                "children": [],
                "path": "F/43/433/43320/"
              },
              {
                "code": "4333",
                "name": "Покрытие полов и облицовка стен",
                "children": [],
                "path": "F/43/433/4333/"
              },
              {
                "code": "43330",
                "name": "Покрытие полов и облицовка стен",
                "children": [],
                "path": "F/43/433/43330/"
              },
              {
                "code": "4334",
                "name": "Малярные и стекольные работы",
                "children": [],
                "path": "F/43/433/4334/"
              },
              {
                "code": "43340",
                "name": "Малярные и стекольные работы",
                "children": [],
                "path": "F/43/433/43340/"
              },
              {
                "code": "4339",
                "name": "Прочие отделочные работы",
                "children": [],
                "path": "F/43/433/4339/"
              },
              {
                "code": "43390",
                "name": "Прочие отделочные работы",
                "children": [],
                "path": "F/43/433/43390/"
              }
            ],
            "path": "F/43/433/"
          },
          {
            "code": "439",
            "name": "Прочие специализированные строительные работы",
            "children": [
              {
                "code": "4391",
                "name": "Кровельные работы",
                "children": [],
                "path": "F/43/439/4391/"
              },
              {
                "code": "43910",
                "name": "Кровельные работы",
                "children": [],
                "path": "F/43/439/43910/"
              },
              {
                "code": "4399",
                "name": "Прочие специализированные строительные работы, не включенные в другие группировки",
                "children": [
                  {
                    "code": "43991",
                    "name": "Строительство шахт",
                    "children": [],
                    "path": "F/43/439/4399/43991/"
                  },
                  {
                    "code": "43992",
                    "name": "Гидроизоляционные работы",
                    "children": [],
                    "path": "F/43/439/4399/43992/"
                  },
                  {
                    "code": "43993",
                    "name": "Аренда строительного оборудования с оператором",
                    "children": [],
                    "path": "F/43/439/4399/43993/"
                  },
                  {
                    "code": "43999",
                    "name": "Прочие строительные работы, требующие специальной квалификации",
                    "children": [],
                    "path": "F/43/439/4399/43999/"
                  }
                ],
                "path": "F/43/439/4399/"
              }
            ],
            "path": "F/43/439/"
          }
        ],
        "path": "F/43/"
      }
    ],
    "path": "F/"
  },
  {
    "code": "G",
    "name": "Оптовая и розничная торговля; ремонт автомобилей и мотоциклов",
    "children": [
      {
        "code": "45",
        "name": "Оптовая и розничная торговля автомобилями и мотоциклами и их ремонт",
        "children": [
          {
            "code": "451",
            "name": "Торговля автомобилями",
            "children": [
              {
                "code": "4511",
                "name": "Торговля автомобилями и легкими автотранспортными средствами",
                "children": [
                  {
                    "code": "45111",
                    "name": "Оптовая торговля автомобилями и легкими автотранспортными средствами",
                    "children": [],
                    "path": "G/45/451/4511/45111/"
                  },
                  {
                    "code": "45112",
                    "name": "Розничная торговля автомобилями и легкими автотранспортными средствами в торговых объектах с торговой площадью менее 2000 кв.м",
                    "children": [],
                    "path": "G/45/451/4511/45112/"
                  },
                  {
                    "code": "45113",
                    "name": "Розничная торговля автомобилями и легкими автотранспортными средствами в торговых объектах с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": [],
                    "path": "G/45/451/4511/45113/"
                  }
                ],
                "path": "G/45/451/4511/"
              },
              {
                "code": "4519",
                "name": "Торговля прочими автотранспортными средствами",
                "children": [
                  {
                    "code": "45191",
                    "name": "Оптовая торговля прочими автотранспортными средствами",
                    "children": [],
                    "path": "G/45/451/4519/45191/"
                  },
                  {
                    "code": "45192",
                    "name": "Розничная торговля прочими автотранспортными средствами в торговых объектах с торговой площадью менее 2000 кв.м",
                    "children": [],
                    "path": "G/45/451/4519/45192/"
                  },
                  {
                    "code": "45193",
                    "name": "Розничная торговля прочими автотранспортными средствами в торговых объектах с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": [],
                    "path": "G/45/451/4519/45193/"
                  }
                ],
                "path": "G/45/451/4519/"
              }
            ],
            "path": "G/45/451/"
          },
          {
            "code": "452",
            "name": "Техническое обслуживание и ремонт автомобилей",
            "children": [],
            "path": "G/45/452/"
          },
          {
            "code": "4520",
            "name": "Техническое обслуживание и ремонт автомобилей",
            "children": [
              {
                "code": "45201",
                "name": "Техническое обслуживание и ремонт автомобилей, за исключением произведенных станциями технического обслуживания, находящимися на придорожной полосе",
                "children": [],
                "path": "G/45/4520/45201/"
              },
              {
                "code": "45202",
                "name": "Техническое обслуживание и ремонт автомобилей станциями технического обслуживания, находящимися на придорожной полосе",
                "children": [],
                "path": "G/45/4520/45202/"
              },
              {
                "code": "45203",
                "name": "Деятельность по зарядке аккумуляторных батарей транспортных средств с электродвигателями",
                "children": [],
                "path": "G/45/4520/45203/"
              }
            ],
            "path": "G/45/4520/"
          },
          {
            "code": "453",
            "name": "Торговля автомобильными деталями, узлами и принадлежностями",
            "children": [
              {
                "code": "4531",
                "name": "Оптовая торговля автомобильными деталями, узлами и принадлежностями",
                "children": [],
                "path": "G/45/453/4531/"
              },
              {
                "code": "45310",
                "name": "Оптовая торговля автомобильными деталями, узлами и принадлежностями",
                "children": [],
                "path": "G/45/453/45310/"
              },
              {
                "code": "4532",
                "name": "Розничная торговля автомобильными деталями, узлами и принадлежностями",
                "children": [
                  {
                    "code": "45321",
                    "name": "Розничная торговля автомобильными деталями, узлами и принадлежностями в торговых объектах с торговой площадью менее 2000 кв.м",
                    "children": [],
                    "path": "G/45/453/4532/45321/"
                  },
                  {
                    "code": "45322",
                    "name": "Розничная торговля автомобильными деталями, узлами и принадлежностями в торговых объектах с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": [],
                    "path": "G/45/453/4532/45322/"
                  }
                ],
                "path": "G/45/453/4532/"
              }
            ],
            "path": "G/45/453/"
          },
          {
            "code": "454",
            "name": "Торговля мотоциклами, их деталями, узлами и принадлежностями; техническое обслуживание и ремонт мотоциклов",
            "children": [],
            "path": "G/45/454/"
          },
          {
            "code": "4540",
            "name": "Торговля мотоциклами, их деталями, узлами и принадлежностями; техническое обслуживание и ремонт мотоциклов",
            "children": [
              {
                "code": "45401",
                "name": "Оптовая торговля мотоциклами, мотороллерами, деталями и принадлежностями к ним",
                "children": [],
                "path": "G/45/4540/45401/"
              },
              {
                "code": "45402",
                "name": "Розничная торговля мотоциклами, мотороллерами, деталями и принадлежностями к ним",
                "children": [],
                "path": "G/45/4540/45402/"
              },
              {
                "code": "45403",
                "name": "Техническое обслуживание и ремонт мотоциклов и мотороллеров",
                "children": [],
                "path": "G/45/4540/45403/"
              }
            ],
            "path": "G/45/4540/"
          }
        ],
        "path": "G/45/"
      },
      {
        "code": "46",
        "name": "Оптовая торговля, за исключением торговли автомобилями и мотоциклами",
        "children": [
          {
            "code": "461",
            "name": "Оптовая торговля за вознаграждение или на договорной основе",
            "children": [
              {
                "code": "4611",
                "name": "Деятельность агентов по оптовой торговле сельскохозяйственным сырьем, живыми животными, текстильным сырьем и полуфабрикатами",
                "children": [],
                "path": "G/46/461/4611/"
              },
              {
                "code": "46110",
                "name": "Деятельность агентов по оптовой торговле сельскохозяйственным сырьем, живыми животными, текстильным сырьем и полуфабрикатами",
                "children": [],
                "path": "G/46/461/46110/"
              },
              {
                "code": "4612",
                "name": "Деятельность агентов по оптовой торговле топливом, рудами, металлами и химическими веществами",
                "children": [],
                "path": "G/46/461/4612/"
              },
              {
                "code": "46120",
                "name": "Деятельность агентов по оптовой торговле топливом, рудами, металлами и химическими веществами",
                "children": [],
                "path": "G/46/461/46120/"
              },
              {
                "code": "4613",
                "name": "Деятельность агентов по оптовой торговле древесиной и строительными материалами",
                "children": [],
                "path": "G/46/461/4613/"
              },
              {
                "code": "46130",
                "name": "Деятельность агентов по оптовой торговле древесиной и строительными материалами",
                "children": [],
                "path": "G/46/461/46130/"
              },
              {
                "code": "4614",
                "name": "Деятельность агентов по оптовой торговле машинами, оборудованием, судами и летательными аппаратами",
                "children": [],
                "path": "G/46/461/4614/"
              },
              {
                "code": "46140",
                "name": "Деятельность агентов по оптовой торговле машинами, оборудованием, судами и летательными аппаратами",
                "children": [],
                "path": "G/46/461/46140/"
              },
              {
                "code": "4615",
                "name": "Деятельность агентов по оптовой торговле мебелью, бытовыми товарами, скобяными и прочими металлическими изделиями",
                "children": [],
                "path": "G/46/461/4615/"
              },
              {
                "code": "46150",
                "name": "Деятельность агентов по оптовой торговле мебелью, бытовыми товарами, скобяными и прочими металлическими изделиями",
                "children": [],
                "path": "G/46/461/46150/"
              },
              {
                "code": "4616",
                "name": "Деятельность агентов по оптовой торговле текстильными изделиями, одеждой, обувью, изделиями из кожи и меха",
                "children": [],
                "path": "G/46/461/4616/"
              },
              {
                "code": "46160",
                "name": "Деятельность агентов по оптовой торговле текстильными изделиями, одеждой, обувью, изделиями из кожи и меха",
                "children": [],
                "path": "G/46/461/46160/"
              },
              {
                "code": "4617",
                "name": "Деятельность агентов по оптовой торговле пищевыми продуктами, напитками и табачными изделиями",
                "children": [],
                "path": "G/46/461/4617/"
              },
              {
                "code": "46170",
                "name": "Деятельность агентов по оптовой торговле пищевыми продуктами, напитками и табачными изделиями",
                "children": [],
                "path": "G/46/461/46170/"
              },
              {
                "code": "4618",
                "name": "Деятельность агентов, специализирующихся на оптовой торговле отдельными видами товаров или группами товаров, не включенными в другие группировки",
                "children": [],
                "path": "G/46/461/4618/"
              },
              {
                "code": "46180",
                "name": "Деятельность агентов, специализирующихся на оптовой торговле отдельными видами товаров или группами товаров, не включенными в другие группировки",
                "children": [],
                "path": "G/46/461/46180/"
              },
              {
                "code": "4619",
                "name": "Деятельность агентов по оптовой торговле товарами широкого ассортимента",
                "children": [],
                "path": "G/46/461/4619/"
              },
              {
                "code": "46190",
                "name": "Деятельность агентов по оптовой торговле товарами широкого ассортимента",
                "children": [],
                "path": "G/46/461/46190/"
              }
            ],
            "path": "G/46/461/"
          },
          {
            "code": "462",
            "name": "Оптовая торговля сельскохозяйственным сырьем и живыми животными",
            "children": [
              {
                "code": "4621",
                "name": "Оптовая торговля зерном, необработанным табаком, семенами и кормами для животных",
                "children": [
                  {
                    "code": "46211",
                    "name": "Оптовая торговля зерном, семенами и кормами для животных",
                    "children": [],
                    "path": "G/46/462/4621/46211/"
                  },
                  {
                    "code": "46212",
                    "name": "Оптовая торговля необработанным табаком",
                    "children": [],
                    "path": "G/46/462/4621/46212/"
                  },
                  {
                    "code": "46213",
                    "name": "Оптовая торговля масличными культурами",
                    "children": [],
                    "path": "G/46/462/4621/46213/"
                  }
                ],
                "path": "G/46/462/4621/"
              },
              {
                "code": "4622",
                "name": "Оптовая торговля цветами и другими растениями",
                "children": [],
                "path": "G/46/462/4622/"
              },
              {
                "code": "46220",
                "name": "Оптовая торговля цветами и другими растениями",
                "children": [],
                "path": "G/46/462/46220/"
              },
              {
                "code": "4623",
                "name": "Оптовая торговля живыми животными",
                "children": [],
                "path": "G/46/462/4623/"
              },
              {
                "code": "46230",
                "name": "Оптовая торговля живыми животными",
                "children": [],
                "path": "G/46/462/46230/"
              },
              {
                "code": "4624",
                "name": "Оптовая торговля шкурами и кожей",
                "children": [],
                "path": "G/46/462/4624/"
              },
              {
                "code": "46240",
                "name": "Оптовая торговля шкурами и кожей",
                "children": [],
                "path": "G/46/462/46240/"
              }
            ],
            "path": "G/46/462/"
          },
          {
            "code": "463",
            "name": "Оптовая торговля продуктами питания, напитками и табачными изделиями",
            "children": [
              {
                "code": "4631",
                "name": "Оптовая торговля фруктами и овощами",
                "children": [],
                "path": "G/46/463/4631/"
              },
              {
                "code": "46310",
                "name": "Оптовая торговля фруктами и овощами",
                "children": [],
                "path": "G/46/463/46310/"
              },
              {
                "code": "4632",
                "name": "Оптовая торговля мясом и мясными продуктами",
                "children": [],
                "path": "G/46/463/4632/"
              },
              {
                "code": "46320",
                "name": "Оптовая торговля мясом и мясными продуктами",
                "children": [],
                "path": "G/46/463/46320/"
              },
              {
                "code": "4633",
                "name": "Оптовая торговля молочными продуктами, яйцами и пищевыми маслами и жирами",
                "children": [],
                "path": "G/46/463/4633/"
              },
              {
                "code": "46330",
                "name": "Оптовая торговля молочными продуктами, яйцами и пищевыми маслами и жирами",
                "children": [],
                "path": "G/46/463/46330/"
              },
              {
                "code": "4634",
                "name": "Оптовая торговля напитками",
                "children": [
                  {
                    "code": "46341",
                    "name": "Оптовая торговля напитками в магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": [],
                    "path": "G/46/463/4634/46341/"
                  },
                  {
                    "code": "46342",
                    "name": "Оптовая торговля напитками в магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше), включая оптово-продовольственные распределительные центры",
                    "children": [],
                    "path": "G/46/463/4634/46342/"
                  }
                ],
                "path": "G/46/463/4634/"
              },
              {
                "code": "4635",
                "name": "Оптовая торговля табачными изделиями",
                "children": [],
                "path": "G/46/463/4635/"
              },
              {
                "code": "46350",
                "name": "Оптовая торговля табачными изделиями",
                "children": [],
                "path": "G/46/463/46350/"
              },
              {
                "code": "4636",
                "name": "Оптовая торговля сахаром, шоколадом и сахаристыми кондитерскими изделиями",
                "children": [],
                "path": "G/46/463/4636/"
              },
              {
                "code": "46360",
                "name": "Оптовая торговля сахаром, шоколадом и сахаристыми кондитерскими изделиями",
                "children": [],
                "path": "G/46/463/46360/"
              },
              {
                "code": "4637",
                "name": "Оптовая торговля кофе, чаем, какао и специями",
                "children": [],
                "path": "G/46/463/4637/"
              },
              {
                "code": "46370",
                "name": "Оптовая торговля кофе, чаем, какао и специями",
                "children": [],
                "path": "G/46/463/46370/"
              },
              {
                "code": "4638",
                "name": "Оптовая торговля прочими продуктами питания, включая рыбу, ракообразных и моллюсков",
                "children": [
                  {
                    "code": "46381",
                    "name": "Оптовая торговля рыбой и рыбными продуктами",
                    "children": [],
                    "path": "G/46/463/4638/46381/"
                  },
                  {
                    "code": "46389",
                    "name": "Оптовая торговля прочими продуктами питания",
                    "children": [],
                    "path": "G/46/463/4638/46389/"
                  }
                ],
                "path": "G/46/463/4638/"
              },
              {
                "code": "4639",
                "name": "Неспециализированная оптовая торговля продуктами питания, напитками и табачными изделиями",
                "children": [],
                "path": "G/46/463/4639/"
              },
              {
                "code": "46390",
                "name": "Неспециализированная оптовая торговля продуктами питания, напитками и табачными изделиями",
                "children": [],
                "path": "G/46/463/46390/"
              }
            ],
            "path": "G/46/463/"
          },
          {
            "code": "464",
            "name": "Оптовая торговля непродовольственными товарами потребительского назначения",
            "children": [
              {
                "code": "4641",
                "name": "Оптовая торговля текстильными изделиями",
                "children": [],
                "path": "G/46/464/4641/"
              },
              {
                "code": "46410",
                "name": "Оптовая торговля текстильными изделиями",
                "children": [],
                "path": "G/46/464/46410/"
              },
              {
                "code": "4642",
                "name": "Оптовая торговля одеждой и обувью",
                "children": [
                  {
                    "code": "46421",
                    "name": "Оптовая торговля трикотажными и чулочно-носочными изделиями",
                    "children": [],
                    "path": "G/46/464/4642/46421/"
                  },
                  {
                    "code": "46422",
                    "name": "Оптовая торговля одеждой, кроме трикотажных и чулочно-носочных изделий",
                    "children": [],
                    "path": "G/46/464/4642/46422/"
                  },
                  {
                    "code": "46423",
                    "name": "Оптовая торговля обувью",
                    "children": [],
                    "path": "G/46/464/4642/46423/"
                  }
                ],
                "path": "G/46/464/4642/"
              },
              {
                "code": "4643",
                "name": "Оптовая торговля бытовыми электротоварами, радио- и телевизионным оборудованием",
                "children": [
                  {
                    "code": "46431",
                    "name": "Оптовая торговля бытовыми электротоварами",
                    "children": [],
                    "path": "G/46/464/4643/46431/"
                  },
                  {
                    "code": "46432",
                    "name": "Оптовая торговля радио- и телевизионным оборудованием",
                    "children": [],
                    "path": "G/46/464/4643/46432/"
                  }
                ],
                "path": "G/46/464/4643/"
              },
              {
                "code": "4644",
                "name": "Оптовая торговля изделиями из керамики и стекла, чистящими средствами",
                "children": [],
                "path": "G/46/464/4644/"
              },
              {
                "code": "46440",
                "name": "Оптовая торговля изделиями из керамики и стекла, чистящими средствами",
                "children": [],
                "path": "G/46/464/46440/"
              },
              {
                "code": "4645",
                "name": "Оптовая торговля парфюмерными и косметическими средствами",
                "children": [],
                "path": "G/46/464/4645/"
              },
              {
                "code": "46450",
                "name": "Оптовая торговля парфюмерными и косметическими средствами",
                "children": [],
                "path": "G/46/464/46450/"
              },
              {
                "code": "4646",
                "name": "Оптовая торговля фармацевтическими товарами",
                "children": [
                  {
                    "code": "46461",
                    "name": "Оптовая торговля фармацевтическими товарами, кроме торговли медицинской техникой и ортопедическими изделиями",
                    "children": [],
                    "path": "G/46/464/4646/46461/"
                  },
                  {
                    "code": "46462",
                    "name": "Оптовая реализация фармацевтических и медицинских товаров в рамках гарантированного объема бесплатной медицинской помощи",
                    "children": [],
                    "path": "G/46/464/4646/46462/"
                  },
                  {
                    "code": "46463",
                    "name": "Оптовая торговля медицинской техникой и ортопедическими изделиями",
                    "children": [],
                    "path": "G/46/464/4646/46463/"
                  }
                ],
                "path": "G/46/464/4646/"
              },
              {
                "code": "4647",
                "name": "Оптовая торговля мебелью, коврами и осветительным оборудованием",
                "children": [],
                "path": "G/46/464/4647/"
              },
              {
                "code": "46470",
                "name": "Оптовая торговля мебелью, коврами и осветительным оборудованием",
                "children": [],
                "path": "G/46/464/46470/"
              },
              {
                "code": "4648",
                "name": "Оптовая торговля часами и ювелирными изделиями",
                "children": [],
                "path": "G/46/464/4648/"
              },
              {
                "code": "46480",
                "name": "Оптовая торговля часами и ювелирными изделиями",
                "children": [],
                "path": "G/46/464/46480/"
              },
              {
                "code": "4649",
                "name": "Оптовая торговля прочими непродовольственными товарами потребительского назначения",
                "children": [
                  {
                    "code": "46491",
                    "name": "Оптовая торговля канцелярскими принадлежностями",
                    "children": [],
                    "path": "G/46/464/4649/46491/"
                  },
                  {
                    "code": "46492",
                    "name": "Оптовая торговля музыкальными инструментами",
                    "children": [],
                    "path": "G/46/464/4649/46492/"
                  },
                  {
                    "code": "46499",
                    "name": "Оптовая торговля прочими непродовольственными товарами потребительского назначения, не включенными в другие группировки",
                    "children": [],
                    "path": "G/46/464/4649/46499/"
                  }
                ],
                "path": "G/46/464/4649/"
              }
            ],
            "path": "G/46/464/"
          },
          {
            "code": "465",
            "name": "Оптовая торговля компьютерами и коммуникационным оборудованием",
            "children": [
              {
                "code": "4651",
                "name": "Оптовая торговля компьютерами, периферийным компьютерным оборудованием и программным обеспечением",
                "children": [],
                "path": "G/46/465/4651/"
              },
              {
                "code": "46510",
                "name": "Оптовая торговля компьютерами, периферийным компьютерным оборудованием и программным обеспечением",
                "children": [],
                "path": "G/46/465/46510/"
              },
              {
                "code": "4652",
                "name": "Оптовая торговля электронным и телекоммуникационным оборудованием и их частями",
                "children": [],
                "path": "G/46/465/4652/"
              },
              {
                "code": "46520",
                "name": "Оптовая торговля электронным и телекоммуникационным оборудованием и их частями",
                "children": [],
                "path": "G/46/465/46520/"
              }
            ],
            "path": "G/46/465/"
          },
          {
            "code": "466",
            "name": "Оптовая торговля прочими машинами, оборудованием и деталями и принадлежностями к ним",
            "children": [
              {
                "code": "4661",
                "name": "Оптовая торговля сельскохозяйственной техникой, оборудованием, деталями и принадлежностями к ним",
                "children": [],
                "path": "G/46/466/4661/"
              },
              {
                "code": "46610",
                "name": "Оптовая торговля сельскохозяйственной техникой, оборудованием, деталями и принадлежностями к ним",
                "children": [],
                "path": "G/46/466/46610/"
              },
              {
                "code": "4662",
                "name": "Оптовая торговля станками",
                "children": [],
                "path": "G/46/466/4662/"
              },
              {
                "code": "46620",
                "name": "Оптовая торговля станками",
                "children": [],
                "path": "G/46/466/46620/"
              },
              {
                "code": "4663",
                "name": "Оптовая торговля машинами и оборудованием для горнодобывающей промышленности и строительства",
                "children": [],
                "path": "G/46/466/4663/"
              },
              {
                "code": "46630",
                "name": "Оптовая торговля машинами и оборудованием для горнодобывающей промышленности и строительства",
                "children": [],
                "path": "G/46/466/46630/"
              },
              {
                "code": "4664",
                "name": "Оптовая торговля машинами и оборудованием для текстильной промышленности и швейными и вязальными машинами",
                "children": [],
                "path": "G/46/466/4664/"
              },
              {
                "code": "46640",
                "name": "Оптовая торговля машинами и оборудованием для текстильной промышленности и швейными и вязальными машинами",
                "children": [],
                "path": "G/46/466/46640/"
              },
              {
                "code": "4665",
                "name": "Оптовая торговля офисной мебелью",
                "children": [],
                "path": "G/46/466/4665/"
              },
              {
                "code": "46650",
                "name": "Оптовая торговля офисной мебелью",
                "children": [],
                "path": "G/46/466/46650/"
              },
              {
                "code": "4666",
                "name": "Оптовая торговля прочими офисными машинами и оборудованием",
                "children": [],
                "path": "G/46/466/4666/"
              },
              {
                "code": "46660",
                "name": "Оптовая торговля прочими офисными машинами и оборудованием",
                "children": [],
                "path": "G/46/466/46660/"
              },
              {
                "code": "4669",
                "name": "Оптовая торговля прочими машинами и оборудованием",
                "children": [],
                "path": "G/46/466/4669/"
              },
              {
                "code": "46690",
                "name": "Оптовая торговля прочими машинами и оборудованием",
                "children": [],
                "path": "G/46/466/46690/"
              }
            ],
            "path": "G/46/466/"
          },
          {
            "code": "467",
            "name": "Прочая специализированная оптовая торговля",
            "children": [
              {
                "code": "4671",
                "name": "Оптовая торговля твердым, жидким и газообразным топливом и подобными продуктами",
                "children": [
                  {
                    "code": "46711",
                    "name": "Оптовая торговля сырой нефтью и попутным газом",
                    "children": [],
                    "path": "G/46/467/4671/46711/"
                  },
                  {
                    "code": "46712",
                    "name": "Оптовая торговля природным (горючим) газом",
                    "children": [],
                    "path": "G/46/467/4671/46712/"
                  },
                  {
                    "code": "46713",
                    "name": "Оптовая торговля каменным углем",
                    "children": [],
                    "path": "G/46/467/4671/46713/"
                  },
                  {
                    "code": "46714",
                    "name": "Оптовая торговля лигнитом (бурым углем)",
                    "children": [],
                    "path": "G/46/467/4671/46714/"
                  },
                  {
                    "code": "46715",
                    "name": "Оптовая торговля авиационным бензином и керосином",
                    "children": [],
                    "path": "G/46/467/4671/46715/"
                  },
                  {
                    "code": "46716",
                    "name": "Оптовая торговля автомобильным бензином",
                    "children": [],
                    "path": "G/46/467/4671/46716/"
                  },
                  {
                    "code": "46717",
                    "name": "Оптовая торговля дизельным топливом",
                    "children": [],
                    "path": "G/46/467/4671/46717/"
                  },
                  {
                    "code": "46718",
                    "name": "Оптовая торговля мазутом топочным",
                    "children": [],
                    "path": "G/46/467/4671/46718/"
                  },
                  {
                    "code": "46719",
                    "name": "Оптовая торговля прочим топливом",
                    "children": [],
                    "path": "G/46/467/4671/46719/"
                  }
                ],
                "path": "G/46/467/4671/"
              },
              {
                "code": "4672",
                "name": "Оптовая торговля металлами и металлическими рудами",
                "children": [
                  {
                    "code": "46721",
                    "name": "Оптовая торговля рудами черных и цветных металлов",
                    "children": [],
                    "path": "G/46/467/4672/46721/"
                  },
                  {
                    "code": "46722",
                    "name": "Оптовая торговля чугуном, сталью и их литьем",
                    "children": [],
                    "path": "G/46/467/4672/46722/"
                  },
                  {
                    "code": "46723",
                    "name": "Оптовая торговля редкими, редкоземельными и цветными металлами и их литьем",
                    "children": [],
                    "path": "G/46/467/4672/46723/"
                  },
                  {
                    "code": "46724",
                    "name": "Оптовая торговля драгоценными металлами",
                    "children": [],
                    "path": "G/46/467/4672/46724/"
                  }
                ],
                "path": "G/46/467/4672/"
              },
              {
                "code": "4673",
                "name": "Оптовая торговля лесоматериалами, строительными материалами и санитарно-техническим оборудованием",
                "children": [
                  {
                    "code": "46731",
                    "name": "Оптовая торговля листовым стеклом",
                    "children": [],
                    "path": "G/46/467/4673/46731/"
                  },
                  {
                    "code": "46732",
                    "name": "Оптовая торговля цементом, песком и гравием",
                    "children": [],
                    "path": "G/46/467/4673/46732/"
                  },
                  {
                    "code": "46733",
                    "name": "Оптовая торговля изделиями из бетона, цемента, гипса и аналогичных материалов",
                    "children": [],
                    "path": "G/46/467/4673/46733/"
                  },
                  {
                    "code": "46734",
                    "name": "Оптовая торговля лакокрасочной продукцией, обоями и напольными покрытиями",
                    "children": [],
                    "path": "G/46/467/4673/46734/"
                  },
                  {
                    "code": "46735",
                    "name": "Оптовая торговля древесиной и продукцией обработки древесины",
                    "children": [],
                    "path": "G/46/467/4673/46735/"
                  },
                  {
                    "code": "46736",
                    "name": "Оптовая торговля строительными металлическими конструкциями",
                    "children": [],
                    "path": "G/46/467/4673/46736/"
                  },
                  {
                    "code": "46737",
                    "name": "Оптовая торговля санитарно-техническим оборудованием",
                    "children": [],
                    "path": "G/46/467/4673/46737/"
                  },
                  {
                    "code": "46738",
                    "name": "Оптовая торговля стеновыми блоками",
                    "children": [],
                    "path": "G/46/467/4673/46738/"
                  }
                ],
                "path": "G/46/467/4673/"
              },
              {
                "code": "4674",
                "name": "Оптовая торговля скобяными изделиями, водопроводным и отопительным оборудованием и инвентарем",
                "children": [],
                "path": "G/46/467/4674/"
              },
              {
                "code": "46740",
                "name": "Оптовая торговля скобяными изделиями, водопроводным и отопительным оборудованием и инвентарем",
                "children": [],
                "path": "G/46/467/46740/"
              },
              {
                "code": "4675",
                "name": "Оптовая торговля химической продукцией",
                "children": [
                  {
                    "code": "46751",
                    "name": "Оптовая торговля химическими веществами и химическими продуктами",
                    "children": [],
                    "path": "G/46/467/4675/46751/"
                  },
                  {
                    "code": "46752",
                    "name": "Оптовая торговля резинотехническими изделиями",
                    "children": [],
                    "path": "G/46/467/4675/46752/"
                  },
                  {
                    "code": "46753",
                    "name": "Оптовая торговля минеральными удобрениями",
                    "children": [],
                    "path": "G/46/467/4675/46753/"
                  },
                  {
                    "code": "46754",
                    "name": "Оптовая торговля пестицидами и прочими агрохимическими продуктами",
                    "children": [],
                    "path": "G/46/467/4675/46754/"
                  }
                ],
                "path": "G/46/467/4675/"
              },
              {
                "code": "4676",
                "name": "Оптовая торговля прочими промежуточными продуктами",
                "children": [
                  {
                    "code": "46761",
                    "name": "Оптовая торговля пластмассами в первичных формах и синтетическим каучуком",
                    "children": [],
                    "path": "G/46/467/4676/46761/"
                  },
                  {
                    "code": "46762",
                    "name": "Оптовая торговля прочими промежуточными продуктами",
                    "children": [],
                    "path": "G/46/467/4676/46762/"
                  },
                  {
                    "code": "46763",
                    "name": "Оптовая торговля драгоценными камнями",
                    "children": [],
                    "path": "G/46/467/4676/46763/"
                  }
                ],
                "path": "G/46/467/4676/"
              },
              {
                "code": "4677",
                "name": "Оптовая торговля отходами и ломом",
                "children": [
                  {
                    "code": "46771",
                    "name": "Оптовая торговля ломом и отходами черных и цветных металлов",
                    "children": [],
                    "path": "G/46/467/4677/46771/"
                  },
                  {
                    "code": "46772",
                    "name": "Оптовая торговля ломом драгоценных металлов и драгоценных камней",
                    "children": [],
                    "path": "G/46/467/4677/46772/"
                  },
                  {
                    "code": "46779",
                    "name": "Оптовая торговля прочими неметаллическими отходами и неметаллическим ломом",
                    "children": [],
                    "path": "G/46/467/4677/46779/"
                  }
                ],
                "path": "G/46/467/4677/"
              }
            ],
            "path": "G/46/467/"
          },
          {
            "code": "469",
            "name": "Неспециализированная оптовая торговля",
            "children": [],
            "path": "G/46/469/"
          },
          {
            "code": "4690",
            "name": "Неспециализированная оптовая торговля",
            "children": [
              {
                "code": "46901",
                "name": "Оптовая торговля полудрагоценными камнями",
                "children": [],
                "path": "G/46/4690/46901/"
              },
              {
                "code": "46902",
                "name": "Оптовая торговля мореным дубом",
                "children": [],
                "path": "G/46/4690/46902/"
              },
              {
                "code": "46903",
                "name": "Оптовая торговля широким ассортиментом товаров без какой-либо конкретизации в торговых объектах с торговой площадью более 2000 кв.м (2000 кв.м и выше), включая оптово-продовольственные распределительные центры",
                "children": [],
                "path": "G/46/4690/46903/"
              },
              {
                "code": "46904",
                "name": "Оптовая торговля оборудованием и материалами, бывшими в употреблении",
                "children": [],
                "path": "G/46/4690/46904/"
              },
              {
                "code": "46905",
                "name": "Оптовая торговля углеродными единицами",
                "children": [],
                "path": "G/46/4690/46905/"
              },
              {
                "code": "46908",
                "name": "Специализированная оптовая торговля товарами, не включенными в другие группировки",
                "children": [],
                "path": "G/46/4690/46908/"
              },
              {
                "code": "46909",
                "name": "Оптовая торговля широким ассортиментом товаров без какой-либо конкретизации",
                "children": [],
                "path": "G/46/4690/46909/"
              }
            ],
            "path": "G/46/4690/"
          }
        ],
        "path": "G/46/"
      },
      {
        "code": "47",
        "name": "Розничная торговля, кроме торговли автомобилями и мотоциклами",
        "children": [
          {
            "code": "471",
            "name": "Розничная торговля в неспециализированных магазинах",
            "children": [
              {
                "code": "4711",
                "name": "Розничная торговля в неспециализированных магазинах преимущественно продуктами питания, напитками и табачными изделиями",
                "children": [
                  {
                    "code": "47111",
                    "name": "Розничная торговля преимущественно продуктами питания, напитками и табачными изделиями в неспециализированных магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": [],
                    "path": "G/47/471/4711/47111/"
                  },
                  {
                    "code": "47112",
                    "name": "Розничная торговля преимущественно продуктами питания, напитками и табачными изделиями, в неспециализированных магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": [],
                    "path": "G/47/471/4711/47112/"
                  }
                ],
                "path": "G/47/471/4711/"
              },
              {
                "code": "4719",
                "name": "Прочая розничная торговля в неспециализированных магазинах",
                "children": [
                  {
                    "code": "47191",
                    "name": "Прочая розничная торговля в неспециализированных магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": [],
                    "path": "G/47/471/4719/47191/"
                  },
                  {
                    "code": "47192",
                    "name": "Прочая розничная торговля в неспециализированных магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": [],
                    "path": "G/47/471/4719/47192/"
                  }
                ],
                "path": "G/47/471/4719/"
              }
            ],
            "path": "G/47/471/"
          },
          {
            "code": "472",
            "name": "Розничная торговля продуктами питания, напитками и табачными изделиями в специализированных магазинах",
            "children": [
              {
                "code": "4721",
                "name": "Розничная торговля фруктами и овощами в специализированных магазинах",
                "children": [
                  {
                    "code": "47211",
                    "name": "Розничная торговля фруктами и овощами в специализированных магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": [],
                    "path": "G/47/472/4721/47211/"
                  },
                  {
                    "code": "47212",
                    "name": "Розничная торговля фруктами и овощами в специализированных магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": [],
                    "path": "G/47/472/4721/47212/"
                  }
                ],
                "path": "G/47/472/4721/"
              },
              {
                "code": "4722",
                "name": "Розничная торговля мясом и мясными продуктами в специализированных магазинах",
                "children": [
                  {
                    "code": "47221",
                    "name": "Розничная торговля домашней птицей, дичью и изделиями из них в специализированных магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": [],
                    "path": "G/47/472/4722/47221/"
                  },
                  {
                    "code": "47222",
                    "name": "Розничная торговля домашней птицей, дичью и изделиями из них в специализированных магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": [],
                    "path": "G/47/472/4722/47222/"
                  },
                  {
                    "code": "47223",
                    "name": "Прочая розничная торговля мясом и мясными продуктами в специализированных магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": [],
                    "path": "G/47/472/4722/47223/"
                  },
                  {
                    "code": "47224",
                    "name": "Прочая розничная торговля мясом и мясными продуктами в специализированных магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": [],
                    "path": "G/47/472/4722/47224/"
                  }
                ],
                "path": "G/47/472/4722/"
              },
              {
                "code": "4723",
                "name": "Розничная торговля рыбой, ракообразными и моллюсками в специализированных магазинах",
                "children": [
                  {
                    "code": "47231",
                    "name": "Розничная торговля рыбой, ракообразными и моллюсками в специализированных магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": [],
                    "path": "G/47/472/4723/47231/"
                  },
                  {
                    "code": "47232",
                    "name": "Розничная торговля рыбой, ракообразными и моллюсками в специализированных магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": [],
                    "path": "G/47/472/4723/47232/"
                  }
                ],
                "path": "G/47/472/4723/"
              },
              {
                "code": "4724",
                "name": "Розничная торговля хлебобулочными, мучными и сахаристыми кондитерскими изделиями в специализированных магазинах",
                "children": [
                  {
                    "code": "47241",
                    "name": "Розничная торговля хлебобулочными, мучными и сахаристыми кондитерскими изделиями в специализированных магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": [],
                    "path": "G/47/472/4724/47241/"
                  },
                  {
                    "code": "47242",
                    "name": "Розничная торговля хлебобулочными, мучными и сахаристыми кондитерскими изделиями в специализированных магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": [],
                    "path": "G/47/472/4724/47242/"
                  }
                ],
                "path": "G/47/472/4724/"
              },
              {
                "code": "4725",
                "name": "Розничная торговля напитками в специализированных магазинах",
                "children": [
                  {
                    "code": "47251",
                    "name": "Розничная торговля напитками в специализированных магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": [],
                    "path": "G/47/472/4725/47251/"
                  },
                  {
                    "code": "47252",
                    "name": "Розничная торговля напитками в специализированных магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": [],
                    "path": "G/47/472/4725/47252/"
                  }
                ],
                "path": "G/47/472/4725/"
              },
              {
                "code": "4726",
                "name": "Розничная торговля табачными изделиями в специализированных магазинах",
                "children": [
                  {
                    "code": "47261",
                    "name": "Розничная торговля табачными изделиями в специализированных магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": [],
                    "path": "G/47/472/4726/47261/"
                  },
                  {
                    "code": "47262",
                    "name": "Розничная торговля табачными изделиями в специализированных магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": [],
                    "path": "G/47/472/4726/47262/"
                  }
                ],
                "path": "G/47/472/4726/"
              },
              {
                "code": "4729",
                "name": "Прочая розничная торговля продуктами питания в специализированных магазинах",
                "children": [
                  {
                    "code": "47291",
                    "name": "Прочая розничная торговля продуктами питания в специализированных магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": [],
                    "path": "G/47/472/4729/47291/"
                  },
                  {
                    "code": "47292",
                    "name": "Прочая розничная торговля продуктами питания в специализированных магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": [],
                    "path": "G/47/472/4729/47292/"
                  }
                ],
                "path": "G/47/472/4729/"
              }
            ],
            "path": "G/47/472/"
          },
          {
            "code": "473",
            "name": "Розничная торговля топливом в специализированных магазинах",
            "children": [],
            "path": "G/47/473/"
          },
          {
            "code": "4730",
            "name": "Розничная торговля топливом в специализированных магазинах",
            "children": [
              {
                "code": "47301",
                "name": "Розничная торговля моторным топливом в специализированных магазинах, за исключением находящихся на придорожной полосе",
                "children": [],
                "path": "G/47/4730/47301/"
              },
              {
                "code": "47302",
                "name": "Розничная торговля смазочными материалами в специализированных магазинах",
                "children": [],
                "path": "G/47/4730/47302/"
              },
              {
                "code": "47303",
                "name": "Розничная торговля моторным топливом в специализированных магазинах, находящихся на придорожной полосе",
                "children": [],
                "path": "G/47/4730/47303/"
              }
            ],
            "path": "G/47/4730/"
          },
          {
            "code": "474",
            "name": "Розничная торговля компьютерами и коммуникационным оборудованием в специализированных магазинах",
            "children": [
              {
                "code": "4741",
                "name": "Розничная торговля компьютерами, периферийным оборудованием и программным обеспечением в специализированных магазинах",
                "children": [
                  {
                    "code": "47411",
                    "name": "Розничная торговля компьютерами, периферийным оборудованием и программным обеспечением в специализированных магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": [],
                    "path": "G/47/474/4741/47411/"
                  },
                  {
                    "code": "47412",
                    "name": "Розничная торговля компьютерами, периферийным оборудованием и программным обеспечением в специализированных магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": [],
                    "path": "G/47/474/4741/47412/"
                  }
                ],
                "path": "G/47/474/4741/"
              },
              {
                "code": "4742",
                "name": "Розничная торговля телекоммуникационным оборудованием в специализированных магазинах",
                "children": [
                  {
                    "code": "47421",
                    "name": "Розничная торговля телекоммуникационным оборудованием в специализированных магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": [],
                    "path": "G/47/474/4742/47421/"
                  },
                  {
                    "code": "47422",
                    "name": "Розничная торговля телекоммуникационным оборудованием в специализированных магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": [],
                    "path": "G/47/474/4742/47422/"
                  }
                ],
                "path": "G/47/474/4742/"
              },
              {
                "code": "4743",
                "name": "Розничная торговля аудио- и видеоаппаратурой в специализированных магазинах",
                "children": [
                  {
                    "code": "47431",
                    "name": "Розничная торговля аудио- и видеоаппаратурой в специализированных магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": [],
                    "path": "G/47/474/4743/47431/"
                  },
                  {
                    "code": "47432",
                    "name": "Розничная торговля аудио- и видеоаппаратурой в специализированных магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": [],
                    "path": "G/47/474/4743/47432/"
                  }
                ],
                "path": "G/47/474/4743/"
              }
            ],
            "path": "G/47/474/"
          },
          {
            "code": "475",
            "name": "Розничная торговля прочими бытовыми товарами в специализированных магазинах",
            "children": [
              {
                "code": "4751",
                "name": "Розничная торговля текстильными изделиями в специализированных магазинах",
                "children": [
                  {
                    "code": "47511",
                    "name": "Розничная торговля текстильными изделиями в специализированных магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": [],
                    "path": "G/47/475/4751/47511/"
                  },
                  {
                    "code": "47512",
                    "name": "Розничная торговля текстильными изделиями в специализированных магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": [],
                    "path": "G/47/475/4751/47512/"
                  }
                ],
                "path": "G/47/475/4751/"
              },
              {
                "code": "4752",
                "name": "Розничная торговля скобяными изделиями, лакокрасочными материалами и стеклом в специализированных магазинах",
                "children": [
                  {
                    "code": "47521",
                    "name": "Розничная торговля скобяными изделиями, лакокрасочными материалами и стеклом в специализированных магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": [],
                    "path": "G/47/475/4752/47521/"
                  },
                  {
                    "code": "47522",
                    "name": "Розничная торговля скобяными изделиями, лакокрасочными материалами и стеклом в специализированных магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": [],
                    "path": "G/47/475/4752/47522/"
                  }
                ],
                "path": "G/47/475/4752/"
              },
              {
                "code": "4753",
                "name": "Розничная торговля коврами, ковровыми изделиями, настенными и напольными покрытиями в специализированных магазинах",
                "children": [
                  {
                    "code": "47531",
                    "name": "Розничная торговля коврами, ковровыми изделиями, настенными и напольными покрытиями в специализированных магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": [],
                    "path": "G/47/475/4753/47531/"
                  },
                  {
                    "code": "47532",
                    "name": "Розничная торговля коврами, ковровыми изделиями, настенными и напольными покрытиями в специализированных магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": [],
                    "path": "G/47/475/4753/47532/"
                  }
                ],
                "path": "G/47/475/4753/"
              },
              {
                "code": "4754",
                "name": "Розничная торговля электрическими бытовыми приборами в специализированных магазинах",
                "children": [
                  {
                    "code": "47541",
                    "name": "Розничная торговля электрическими бытовыми приборами в специализированных магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": [],
                    "path": "G/47/475/4754/47541/"
                  },
                  {
                    "code": "47542",
                    "name": "Розничная торговля электрическими бытовыми приборами в специализированных магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": [],
                    "path": "G/47/475/4754/47542/"
                  }
                ],
                "path": "G/47/475/4754/"
              },
              {
                "code": "4759",
                "name": "Розничная торговля мебелью, осветительным оборудованием и прочими бытовыми товарами в специализированных магазинах",
                "children": [
                  {
                    "code": "47591",
                    "name": "Розничная торговля мебелью в специализированных магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": [],
                    "path": "G/47/475/4759/47591/"
                  },
                  {
                    "code": "47592",
                    "name": "Розничная торговля музыкальными инструментами и партитурами в специализированных магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": [],
                    "path": "G/47/475/4759/47592/"
                  },
                  {
                    "code": "47593",
                    "name": "Розничная торговля мебелью в специализированных магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": [],
                    "path": "G/47/475/4759/47593/"
                  },
                  {
                    "code": "47594",
                    "name": "Розничная торговля музыкальными инструментами и партитурами в специализированных магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": [],
                    "path": "G/47/475/4759/47594/"
                  },
                  {
                    "code": "47595",
                    "name": "Розничная торговля осветительными приборами и бытовыми товарами, не включенными в другие группировки, в специализированных магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": [],
                    "path": "G/47/475/4759/47595/"
                  },
                  {
                    "code": "47599",
                    "name": "Розничная торговля осветительными приборами и бытовыми товарами, не включенными в другие группировки, в специализированных магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": [],
                    "path": "G/47/475/4759/47599/"
                  }
                ],
                "path": "G/47/475/4759/"
              }
            ],
            "path": "G/47/475/"
          },
          {
            "code": "476",
            "name": "Розничная торговля товарами культурно-развлекательного характера в специализированных магазинах",
            "children": [
              {
                "code": "4761",
                "name": "Розничная торговля книгами в специализированных магазинах",
                "children": [
                  {
                    "code": "47611",
                    "name": "Розничная торговля книгами в специализированных магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": [],
                    "path": "G/47/476/4761/47611/"
                  },
                  {
                    "code": "47612",
                    "name": "Розничная торговля книгами в специализированных магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": [],
                    "path": "G/47/476/4761/47612/"
                  }
                ],
                "path": "G/47/476/4761/"
              },
              {
                "code": "4762",
                "name": "Розничная торговля газетами, журналами и канцелярскими товарами в специализированных магазинах",
                "children": [
                  {
                    "code": "47621",
                    "name": "Розничная торговля газетами, журналами и канцелярскими товарами в специализированных магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": [],
                    "path": "G/47/476/4762/47621/"
                  },
                  {
                    "code": "47622",
                    "name": "Розничная торговля газетами, журналами и канцелярскими товарами в специализированных магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": [],
                    "path": "G/47/476/4762/47622/"
                  }
                ],
                "path": "G/47/476/4762/"
              },
              {
                "code": "4763",
                "name": "Розничная торговля аудио и видеозаписями в специализированных магазинах",
                "children": [
                  {
                    "code": "47631",
                    "name": "Розничная торговля аудио и видеозаписями в специализированных магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": [],
                    "path": "G/47/476/4763/47631/"
                  },
                  {
                    "code": "47632",
                    "name": "Розничная торговля аудио и видеозаписями в специализированных магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": [],
                    "path": "G/47/476/4763/47632/"
                  }
                ],
                "path": "G/47/476/4763/"
              },
              {
                "code": "4764",
                "name": "Розничная торговля спортивным оборудованием в специализированных магазинах",
                "children": [
                  {
                    "code": "47641",
                    "name": "Розничная торговля спортивным оборудованием в специализированных магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": [],
                    "path": "G/47/476/4764/47641/"
                  },
                  {
                    "code": "47642",
                    "name": "Розничная торговля спортивным оборудованием в специализированных магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": [],
                    "path": "G/47/476/4764/47642/"
                  }
                ],
                "path": "G/47/476/4764/"
              },
              {
                "code": "4765",
                "name": "Розничная торговля играми и игрушками в специализированных магазинах",
                "children": [
                  {
                    "code": "47651",
                    "name": "Розничная торговля играми и игрушками в специализированных магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": [],
                    "path": "G/47/476/4765/47651/"
                  },
                  {
                    "code": "47652",
                    "name": "Розничная торговля играми и игрушками в специализированных магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": [],
                    "path": "G/47/476/4765/47652/"
                  }
                ],
                "path": "G/47/476/4765/"
              }
            ],
            "path": "G/47/476/"
          },
          {
            "code": "477",
            "name": "Розничная торговля прочими товарами в специализированных магазинах",
            "children": [
              {
                "code": "4771",
                "name": "Розничная торговля одеждой в специализированных магазинах",
                "children": [
                  {
                    "code": "47711",
                    "name": "Розничная торговля трикотажными и чулочно-носочными изделиями в специализированных магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": [],
                    "path": "G/47/477/4771/47711/"
                  },
                  {
                    "code": "47712",
                    "name": "Розничная торговля одеждой, кроме трикотажных и чулочно-носочных изделий, в специализированных магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": [],
                    "path": "G/47/477/4771/47712/"
                  },
                  {
                    "code": "47713",
                    "name": "Розничная торговля трикотажными и чулочно-носочными изделиями в специализированных магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": [],
                    "path": "G/47/477/4771/47713/"
                  },
                  {
                    "code": "47714",
                    "name": "Розничная торговля одеждой, кроме трикотажных и чулочно-носочных изделий, в специализированных магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": [],
                    "path": "G/47/477/4771/47714/"
                  }
                ],
                "path": "G/47/477/4771/"
              },
              {
                "code": "4772",
                "name": "Розничная торговля обувью и кожаными изделиями в специализированных магазинах",
                "children": [
                  {
                    "code": "47721",
                    "name": "Розничная торговля обувью в специализированных магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": [],
                    "path": "G/47/477/4772/47721/"
                  },
                  {
                    "code": "47722",
                    "name": "Розничная торговля кожаными изделиями в специализированных магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": [],
                    "path": "G/47/477/4772/47722/"
                  },
                  {
                    "code": "47723",
                    "name": "Розничная торговля обувью в специализированных магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": [],
                    "path": "G/47/477/4772/47723/"
                  },
                  {
                    "code": "47724",
                    "name": "Розничная торговля кожаными изделиями в специализированных магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": [],
                    "path": "G/47/477/4772/47724/"
                  }
                ],
                "path": "G/47/477/4772/"
              },
              {
                "code": "4773",
                "name": "Розничная торговля фармацевтическими товарами в специализированных магазинах",
                "children": [
                  {
                    "code": "47731",
                    "name": "Розничная торговля фармацевтическими товарами в специализированных магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": [],
                    "path": "G/47/477/4773/47731/"
                  },
                  {
                    "code": "47732",
                    "name": "Розничная торговля фармацевтическими товарами в специализированных магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": [],
                    "path": "G/47/477/4773/47732/"
                  }
                ],
                "path": "G/47/477/4773/"
              },
              {
                "code": "4774",
                "name": "Розничная торговля медицинскими и ортопедическими товарами в специализированных магазинах",
                "children": [
                  {
                    "code": "47741",
                    "name": "Розничная торговля медицинскими и ортопедическими товарами в специализированных магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": [],
                    "path": "G/47/477/4774/47741/"
                  },
                  {
                    "code": "47742",
                    "name": "Розничная торговля медицинскими и ортопедическими товарами в специализированных магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": [],
                    "path": "G/47/477/4774/47742/"
                  }
                ],
                "path": "G/47/477/4774/"
              },
              {
                "code": "4775",
                "name": "Розничная торговля косметическими товарами и туалетными принадлежностями в специализированных магазинах",
                "children": [
                  {
                    "code": "47751",
                    "name": "Розничная торговля косметическими товарами и туалетными принадлежностями в специализированных магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": [],
                    "path": "G/47/477/4775/47751/"
                  },
                  {
                    "code": "47752",
                    "name": "Розничная торговля косметическими товарами и туалетными принадлежностями в специализированных магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": [],
                    "path": "G/47/477/4775/47752/"
                  }
                ],
                "path": "G/47/477/4775/"
              },
              {
                "code": "4776",
                "name": "Розничная торговля цветами, комнатными растениями, семенами, удобрениями, домашними животными и кормами для домашних животных в специализированных магазинах",
                "children": [
                  {
                    "code": "47761",
                    "name": "Розничная торговля цветами, комнатными растениями в специализированных магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": [],
                    "path": "G/47/477/4776/47761/"
                  },
                  {
                    "code": "47762",
                    "name": "Розничная торговля семенами и удобрениями в специализированных магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": [],
                    "path": "G/47/477/4776/47762/"
                  },
                  {
                    "code": "47763",
                    "name": "Розничная торговля домашними животными и кормами для домашних животных в специализированных магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": [],
                    "path": "G/47/477/4776/47763/"
                  },
                  {
                    "code": "47764",
                    "name": "Розничная торговля цветами, комнатными растениями в специализированных магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": [],
                    "path": "G/47/477/4776/47764/"
                  },
                  {
                    "code": "47765",
                    "name": "Розничная торговля семенами и удобрениями в специализированных магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": [],
                    "path": "G/47/477/4776/47765/"
                  },
                  {
                    "code": "47766",
                    "name": "Розничная торговля домашними животными и кормами для домашних животных в специализированных магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": [],
                    "path": "G/47/477/4776/47766/"
                  }
                ],
                "path": "G/47/477/4776/"
              },
              {
                "code": "4777",
                "name": "Розничная торговля часами и ювелирными изделиями в специализированных магазинах",
                "children": [
                  {
                    "code": "47771",
                    "name": "Розничная торговля часами и ювелирными изделиями в специализированных магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": [],
                    "path": "G/47/477/4777/47771/"
                  },
                  {
                    "code": "47772",
                    "name": "Розничная торговля часами и ювелирными изделиями в специализированных магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": [],
                    "path": "G/47/477/4777/47772/"
                  }
                ],
                "path": "G/47/477/4777/"
              },
              {
                "code": "4778",
                "name": "Прочая розничная торговля новыми товарами в специализированных магазинах",
                "children": [
                  {
                    "code": "47781",
                    "name": "Розничная торговля фотографическим, оптическим и точным оборудованием в специализированных магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": [],
                    "path": "G/47/477/4778/47781/"
                  },
                  {
                    "code": "47782",
                    "name": "Розничная торговля велосипедами в специализированных магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": [],
                    "path": "G/47/477/4778/47782/"
                  },
                  {
                    "code": "47783",
                    "name": "Розничная торговля фотографическим, оптическим и точным оборудованием в специализированных магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": [],
                    "path": "G/47/477/4778/47783/"
                  },
                  {
                    "code": "47784",
                    "name": "Розничная торговля велосипедами в специализированных магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": [],
                    "path": "G/47/477/4778/47784/"
                  },
                  {
                    "code": "47785",
                    "name": "Прочая розничная торговля в специализированных магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": [],
                    "path": "G/47/477/4778/47785/"
                  },
                  {
                    "code": "47789",
                    "name": "Прочая розничная торговля в специализированных магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": [],
                    "path": "G/47/477/4778/47789/"
                  }
                ],
                "path": "G/47/477/4778/"
              },
              {
                "code": "4779",
                "name": "Розничная торговля подержанными товарами в магазинах",
                "children": [
                  {
                    "code": "47791",
                    "name": "Розничная торговля подержанными товарами в магазинах, являющихся торговыми объектами, с торговой площадью менее 2000 кв.м",
                    "children": [],
                    "path": "G/47/477/4779/47791/"
                  },
                  {
                    "code": "47792",
                    "name": "Розничная торговля подержанными товарами в магазинах, являющихся торговыми объектами, с торговой площадью более 2000 кв.м (2000 кв.м и выше)",
                    "children": [],
                    "path": "G/47/477/4779/47792/"
                  }
                ],
                "path": "G/47/477/4779/"
              }
            ],
            "path": "G/47/477/"
          },
          {
            "code": "478",
            "name": "Розничная торговля в палатках, киосках и на рынках",
            "children": [
              {
                "code": "4781",
                "name": "Розничная торговля продуктами питания, напитками и табачными изделиями в торговых палатках, киосках и на рынках",
                "children": [
                  {
                    "code": "47811",
                    "name": "Розничная торговля продуктами питания, напитками и табачными изделиями в торговых палатках, ларьках и киосках",
                    "children": [],
                    "path": "G/47/478/4781/47811/"
                  },
                  {
                    "code": "47812",
                    "name": "Розничная торговля продуктами питания, напитками и табачными изделиями на рынках",
                    "children": [],
                    "path": "G/47/478/4781/47812/"
                  }
                ],
                "path": "G/47/478/4781/"
              },
              {
                "code": "4782",
                "name": "Розничная торговля одеждой, обувью и текстильными изделиями в торговых палатках, киосках и на рынках",
                "children": [
                  {
                    "code": "47821",
                    "name": "Розничная торговля одеждой, обувью и текстильными изделиями в торговых палатках, ларьках и киосках",
                    "children": [],
                    "path": "G/47/478/4782/47821/"
                  },
                  {
                    "code": "47822",
                    "name": "Розничная торговля одеждой, обувью и текстильными изделиями на рынках",
                    "children": [],
                    "path": "G/47/478/4782/47822/"
                  }
                ],
                "path": "G/47/478/4782/"
              },
              {
                "code": "4789",
                "name": "Розничная торговля прочими товарами в палатках, киосках и на рынках",
                "children": [
                  {
                    "code": "47891",
                    "name": "Розничная торговля прочими товарами в торговых палатках, ларьках и киосках",
                    "children": [],
                    "path": "G/47/478/4789/47891/"
                  },
                  {
                    "code": "47892",
                    "name": "Розничная торговля прочими товарами на рынках",
                    "children": [],
                    "path": "G/47/478/4789/47892/"
                  }
                ],
                "path": "G/47/478/4789/"
              }
            ],
            "path": "G/47/478/"
          },
          {
            "code": "479",
            "name": "Розничная торговля вне магазинов, палаток, киосков или рынков",
            "children": [
              {
                "code": "4791",
                "name": "Розничная торговля путем заказа товаров по почте или через сеть Интернет",
                "children": [],
                "path": "G/47/479/4791/"
              },
              {
                "code": "47910",
                "name": "Розничная торговля путем заказа товаров по почте или через сеть Интернет",
                "children": [],
                "path": "G/47/479/47910/"
              },
              {
                "code": "4799",
                "name": "Прочая розничная торговля вне магазинов, палаток, киосков или рынков",
                "children": [
                  {
                    "code": "47991",
                    "name": "Развозная и разносная розничная торговля",
                    "children": [],
                    "path": "G/47/479/4799/47991/"
                  },
                  {
                    "code": "47992",
                    "name": "Розничная торговля через сетевой маркетинг",
                    "children": [],
                    "path": "G/47/479/4799/47992/"
                  },
                  {
                    "code": "47999",
                    "name": "Прочая розничная торговля вне магазинов",
                    "children": [],
                    "path": "G/47/479/4799/47999/"
                  }
                ],
                "path": "G/47/479/4799/"
              }
            ],
            "path": "G/47/479/"
          }
        ],
        "path": "G/47/"
      }
    ],
    "path": "G/"
  },
  {
    "code": "H",
    "name": "Транспорт и складирование",
    "children": [
      {
        "code": "49",
        "name": "Деятельность сухопутного и трубопроводного транспорта",
        "children": [
          {
            "code": "491",
            "name": "Деятельность пассажирского железнодорожного транспорта в междугородном сообщении",
            "children": [],
            "path": "H/49/491/"
          },
          {
            "code": "4910",
            "name": "Деятельность пассажирского железнодорожного транспорта в междугородном сообщении",
            "children": [],
            "path": "H/49/4910/"
          },
          {
            "code": "49100",
            "name": "Деятельность пассажирского железнодорожного транспорта в междугородном сообщении",
            "children": [],
            "path": "H/49/49100/"
          },
          {
            "code": "492",
            "name": "Деятельность грузового железнодорожного транспорта",
            "children": [],
            "path": "H/49/492/"
          },
          {
            "code": "4920",
            "name": "Деятельность грузового железнодорожного транспорта",
            "children": [],
            "path": "H/49/4920/"
          },
          {
            "code": "49200",
            "name": "Деятельность грузового железнодорожного транспорта",
            "children": [],
            "path": "H/49/49200/"
          },
          {
            "code": "493",
            "name": "Деятельность прочего пассажирского сухопутного транспорта",
            "children": [
              {
                "code": "4931",
                "name": "Деятельность сухопутного транспорта по городским и пригородным пассажирским перевозкам",
                "children": [
                  {
                    "code": "49311",
                    "name": "Перевозки автобусами",
                    "children": [],
                    "path": "H/49/493/4931/49311/"
                  },
                  {
                    "code": "49312",
                    "name": "Перевозки трамваями",
                    "children": [],
                    "path": "H/49/493/4931/49312/"
                  },
                  {
                    "code": "49313",
                    "name": "Перевозки троллейбусами",
                    "children": [],
                    "path": "H/49/493/4931/49313/"
                  },
                  {
                    "code": "49314",
                    "name": "Перевозки метрополитеном",
                    "children": [],
                    "path": "H/49/493/4931/49314/"
                  },
                  {
                    "code": "49315",
                    "name": "Перевозки легкорельсовым транспортом",
                    "children": [],
                    "path": "H/49/493/4931/49315/"
                  },
                  {
                    "code": "49319",
                    "name": "Перевозки прочими видами транспорта, подчиняющегося расписанию",
                    "children": [],
                    "path": "H/49/493/4931/49319/"
                  }
                ],
                "path": "H/49/493/4931/"
              },
              {
                "code": "4932",
                "name": "Деятельность такси",
                "children": [],
                "path": "H/49/493/4932/"
              },
              {
                "code": "49320",
                "name": "Деятельность такси",
                "children": [],
                "path": "H/49/493/49320/"
              },
              {
                "code": "4939",
                "name": "Деятельность прочего пассажирского сухопутного транспорта, не включенного в другие группировки",
                "children": [],
                "path": "H/49/493/4939/"
              },
              {
                "code": "49390",
                "name": "Деятельность прочего пассажирского сухопутного транспорта, не включенного в другие группировки",
                "children": [],
                "path": "H/49/493/49390/"
              }
            ],
            "path": "H/49/493/"
          },
          {
            "code": "494",
            "name": "Деятельность грузового автомобильного транспорта и предоставление услуг по переезду",
            "children": [
              {
                "code": "4941",
                "name": "Деятельность грузового автомобильного транспорта",
                "children": [],
                "path": "H/49/494/4941/"
              },
              {
                "code": "49410",
                "name": "Деятельность грузового автомобильного транспорта",
                "children": [],
                "path": "H/49/494/49410/"
              },
              {
                "code": "4942",
                "name": "Предоставление услуг по переезду",
                "children": [],
                "path": "H/49/494/4942/"
              },
              {
                "code": "49420",
                "name": "Предоставление услуг по переезду",
                "children": [],
                "path": "H/49/494/49420/"
              }
            ],
            "path": "H/49/494/"
          },
          {
            "code": "495",
            "name": "Деятельность трубопроводного транспорта",
            "children": [],
            "path": "H/49/495/"
          },
          {
            "code": "4950",
            "name": "Деятельность трубопроводного транспорта",
            "children": [],
            "path": "H/49/4950/"
          },
          {
            "code": "49500",
            "name": "Деятельность трубопроводного транспорта",
            "children": [],
            "path": "H/49/49500/"
          }
        ],
        "path": "H/49/"
      },
      {
        "code": "50",
        "name": "Деятельность водного транспорта",
        "children": [
          {
            "code": "501",
            "name": "Деятельность морского и прибрежного пассажирского транспорта",
            "children": [],
            "path": "H/50/501/"
          },
          {
            "code": "5010",
            "name": "Деятельность морского и прибрежного пассажирского транспорта",
            "children": [],
            "path": "H/50/5010/"
          },
          {
            "code": "50100",
            "name": "Деятельность морского и прибрежного пассажирского транспорта",
            "children": [],
            "path": "H/50/50100/"
          },
          {
            "code": "502",
            "name": "Деятельность морского и прибрежного грузового транспорта",
            "children": [],
            "path": "H/50/502/"
          },
          {
            "code": "5020",
            "name": "Деятельность морского и прибрежного грузового транспорта",
            "children": [],
            "path": "H/50/5020/"
          },
          {
            "code": "50200",
            "name": "Деятельность морского и прибрежного грузового транспорта",
            "children": [],
            "path": "H/50/50200/"
          },
          {
            "code": "503",
            "name": "Деятельность речного пассажирского транспорта",
            "children": [],
            "path": "H/50/503/"
          },
          {
            "code": "5030",
            "name": "Деятельность речного пассажирского транспорта",
            "children": [],
            "path": "H/50/5030/"
          },
          {
            "code": "50300",
            "name": "Деятельность речного пассажирского транспорта",
            "children": [],
            "path": "H/50/50300/"
          },
          {
            "code": "504",
            "name": "Деятельность речного грузового транспорта",
            "children": [],
            "path": "H/50/504/"
          },
          {
            "code": "5040",
            "name": "Деятельность речного грузового транспорта",
            "children": [
              {
                "code": "50401",
                "name": "Деятельность речного грузового транспорта, кроме лесосплава",
                "children": [],
                "path": "H/50/5040/50401/"
              },
              {
                "code": "50402",
                "name": "Лесосплав",
                "children": [],
                "path": "H/50/5040/50402/"
              }
            ],
            "path": "H/50/5040/"
          },
          {
            "code": "51",
            "name": "Деятельность воздушного транспорта",
            "children": [
              {
                "code": "511",
                "name": "Деятельность воздушного пассажирского транспорта",
                "children": [],
                "path": "H/50/51/511/"
              },
              {
                "code": "5110",
                "name": "Деятельность воздушного пассажирского транспорта",
                "children": [
                  {
                    "code": "51101",
                    "name": "Деятельность воздушного пассажирского транспорта, подчиняющегося расписанию",
                    "children": [],
                    "path": "H/50/51/5110/51101/"
                  },
                  {
                    "code": "51102",
                    "name": "Деятельность воздушного пассажирского транспорта, не подчиняющегося расписанию",
                    "children": [],
                    "path": "H/50/51/5110/51102/"
                  }
                ],
                "path": "H/50/51/5110/"
              },
              {
                "code": "512",
                "name": "Деятельность воздушного грузового транспорта и космического транспорта",
                "children": [
                  {
                    "code": "5121",
                    "name": "Деятельность грузового воздушного транспорта",
                    "children": [
                      {
                        "code": "51211",
                        "name": "Деятельность грузового воздушного транспорта, подчиняющего расписанию",
                        "children": [],
                        "path": "H/50/51/512/5121/51211/"
                      },
                      {
                        "code": "51212",
                        "name": "Деятельность грузового воздушного транспорта, не подчиняющего расписанию",
                        "children": [],
                        "path": "H/50/51/512/5121/51212/"
                      }
                    ],
                    "path": "H/50/51/512/5121/"
                  },
                  {
                    "code": "5122",
                    "name": "Деятельность космического транспорта",
                    "children": [],
                    "path": "H/50/51/512/5122/"
                  },
                  {
                    "code": "51220",
                    "name": "Деятельность космического транспорта",
                    "children": [],
                    "path": "H/50/51/512/51220/"
                  }
                ],
                "path": "H/50/51/512/"
              }
            ],
            "path": "H/50/51/"
          },
          {
            "code": "52",
            "name": "Складирование грузов и вспомогательная транспортная деятельность",
            "children": [
              {
                "code": "521",
                "name": "Складирование и хранение грузов",
                "children": [],
                "path": "H/50/52/521/"
              },
              {
                "code": "5210",
                "name": "Складирование и хранение грузов",
                "children": [
                  {
                    "code": "52101",
                    "name": "Складирование и хранение зерна",
                    "children": [],
                    "path": "H/50/52/5210/52101/"
                  },
                  {
                    "code": "52102",
                    "name": "Складирование и хранение непродовольственных товаров, кроме зерна, масличных культур и нефти",
                    "children": [],
                    "path": "H/50/52/5210/52102/"
                  },
                  {
                    "code": "52103",
                    "name": "Складирование и хранение продовольственных товаров, кроме овощей и фруктов",
                    "children": [],
                    "path": "H/50/52/5210/52103/"
                  },
                  {
                    "code": "52104",
                    "name": "Хранение нефти",
                    "children": [],
                    "path": "H/50/52/5210/52104/"
                  },
                  {
                    "code": "52105",
                    "name": "Складирование и хранение овощей и фруктов",
                    "children": [],
                    "path": "H/50/52/5210/52105/"
                  },
                  {
                    "code": "52106",
                    "name": "Складирование и хранение масличных культур",
                    "children": [],
                    "path": "H/50/52/5210/52106/"
                  }
                ],
                "path": "H/50/52/5210/"
              },
              {
                "code": "522",
                "name": "Вспомогательная транспортная деятельность",
                "children": [
                  {
                    "code": "5221",
                    "name": "Вспомогательная деятельность сухопутного транспорта",
                    "children": [
                      {
                        "code": "52211",
                        "name": "Эксплуатация железных дорог",
                        "children": [],
                        "path": "H/50/52/522/5221/52211/"
                      },
                      {
                        "code": "52212",
                        "name": "Эксплуатация автомобильных дорог",
                        "children": [],
                        "path": "H/50/52/522/5221/52212/"
                      },
                      {
                        "code": "52213",
                        "name": "Деятельность терминалов",
                        "children": [],
                        "path": "H/50/52/522/5221/52213/"
                      },
                      {
                        "code": "52214",
                        "name": "Деятельность автомобильных стоянок",
                        "children": [],
                        "path": "H/50/52/522/5221/52214/"
                      },
                      {
                        "code": "52215",
                        "name": "Эксплуатация магистральных и иных трубопроводов, в том числе водоводов",
                        "children": [],
                        "path": "H/50/52/522/5221/52215/"
                      },
                      {
                        "code": "52216",
                        "name": "Деятельность по подсоединению (подключению) трубопровода к действующим магистральным и иным трубопроводам",
                        "children": [],
                        "path": "H/50/52/522/5221/52216/"
                      },
                      {
                        "code": "52219",
                        "name": "Прочая вспомогательная деятельность сухопутного транспорта",
                        "children": [],
                        "path": "H/50/52/522/5221/52219/"
                      }
                    ],
                    "path": "H/50/52/522/5221/"
                  },
                  {
                    "code": "5222",
                    "name": "Вспомогательная деятельность водного транспорта",
                    "children": [],
                    "path": "H/50/52/522/5222/"
                  },
                  {
                    "code": "52220",
                    "name": "Вспомогательная деятельность водного транспорта",
                    "children": [],
                    "path": "H/50/52/522/52220/"
                  },
                  {
                    "code": "5223",
                    "name": "Вспомогательная деятельность воздушного транспорта",
                    "children": [
                      {
                        "code": "52231",
                        "name": "Регулирование использования воздушного пространства",
                        "children": [],
                        "path": "H/50/52/522/5223/52231/"
                      },
                      {
                        "code": "52232",
                        "name": "Деятельность аэропортов",
                        "children": [],
                        "path": "H/50/52/522/5223/52232/"
                      },
                      {
                        "code": "52239",
                        "name": "Прочая деятельность, относящаяся к пассажирским и грузовым перевозкам воздушным транспортом",
                        "children": [],
                        "path": "H/50/52/522/5223/52239/"
                      }
                    ],
                    "path": "H/50/52/522/5223/"
                  },
                  {
                    "code": "5224",
                    "name": "Транспортная обработка грузов",
                    "children": [],
                    "path": "H/50/52/522/5224/"
                  },
                  {
                    "code": "52240",
                    "name": "Транспортная обработка грузов",
                    "children": [],
                    "path": "H/50/52/522/52240/"
                  },
                  {
                    "code": "5229",
                    "name": "Прочая вспомогательная транспортная деятельность",
                    "children": [
                      {
                        "code": "52291",
                        "name": "Транспортно-экспедиционные услуги",
                        "children": [],
                        "path": "H/50/52/522/5229/52291/"
                      },
                      {
                        "code": "52292",
                        "name": "Технический надзор на транспорте",
                        "children": [],
                        "path": "H/50/52/522/5229/52292/"
                      },
                      {
                        "code": "52299",
                        "name": "Прочая транспортно-экспедиционная деятельность",
                        "children": [],
                        "path": "H/50/52/522/5229/52299/"
                      }
                    ],
                    "path": "H/50/52/522/5229/"
                  }
                ],
                "path": "H/50/52/522/"
              }
            ],
            "path": "H/50/52/"
          },
          {
            "code": "53",
            "name": "Почтовая и курьерская деятельность",
            "children": [
              {
                "code": "531",
                "name": "Почтовая деятельность в рамках предоставления услуг общего пользования",
                "children": [],
                "path": "H/50/53/531/"
              },
              {
                "code": "5310",
                "name": "Почтовая деятельность в рамках предоставления услуг общего пользования",
                "children": [],
                "path": "H/50/53/5310/"
              },
              {
                "code": "53100",
                "name": "Почтовая деятельность в рамках предоставления услуг общего пользования",
                "children": [],
                "path": "H/50/53/53100/"
              },
              {
                "code": "532",
                "name": "Прочая почтовая и курьерская деятельность",
                "children": [],
                "path": "H/50/53/532/"
              },
              {
                "code": "5320",
                "name": "Прочая почтовая и курьерская деятельность",
                "children": [],
                "path": "H/50/53/5320/"
              },
              {
                "code": "53200",
                "name": "Прочая почтовая и курьерская деятельность",
                "children": [],
                "path": "H/50/53/53200/"
              }
            ],
            "path": "H/50/53/"
          }
        ],
        "path": "H/50/"
      }
    ],
    "path": "H/"
  },
  {
    "code": "I",
    "name": "Предоставление услуг по проживанию и питанию",
    "children": [
      {
        "code": "55",
        "name": "Предоставление услуг по временному проживанию",
        "children": [
          {
            "code": "551",
            "name": "Предоставление услуг гостиницами и аналогичными местами для проживания",
            "children": [],
            "path": "I/55/551/"
          },
          {
            "code": "5510",
            "name": "Предоставление услуг гостиницами и аналогичными местами для проживания",
            "children": [
              {
                "code": "55101",
                "name": "Предоставление услуг гостиницами с ресторанами, за исключением гостиниц, находящихся на придорожной полосе",
                "children": [],
                "path": "I/55/5510/55101/"
              },
              {
                "code": "55102",
                "name": "Предоставление услуг гостиницами без ресторанов, за исключением гостиниц, находящихся на придорожной полосе",
                "children": [],
                "path": "I/55/5510/55102/"
              },
              {
                "code": "55103",
                "name": "Предоставление гостиничных услуг с ресторанами для официальных мероприятий",
                "children": [],
                "path": "I/55/5510/55103/"
              },
              {
                "code": "55104",
                "name": "Предоставление услуг гостиницами, находящимися на придорожной полосе",
                "children": [],
                "path": "I/55/5510/55104/"
              }
            ],
            "path": "I/55/5510/"
          },
          {
            "code": "552",
            "name": "Предоставление жилья на выходные дни и прочие периоды краткосрочного проживания",
            "children": [],
            "path": "I/55/552/"
          },
          {
            "code": "5520",
            "name": "Предоставление жилья на выходные дни и прочие периоды краткосрочного проживания",
            "children": [],
            "path": "I/55/5520/"
          },
          {
            "code": "55200",
            "name": "Предоставление жилья на выходные дни и прочие периоды краткосрочного проживания",
            "children": [],
            "path": "I/55/55200/"
          },
          {
            "code": "553",
            "name": "Предоставление услуг кемпингами, стоянками для автофургонов и автоприцепов для жилья",
            "children": [],
            "path": "I/55/553/"
          },
          {
            "code": "5530",
            "name": "Предоставление услуг кемпингами, стоянками для автофургонов и автоприцепов для жилья",
            "children": [
              {
                "code": "55301",
                "name": "Предоставление услуг кемпингами, стоянками для автофургонов и автоприцепов для жилья, за исключением находящихся на придорожной полосе",
                "children": [],
                "path": "I/55/5530/55301/"
              },
              {
                "code": "55302",
                "name": "Предоставление услуг кемпингами, стоянками для автофургонов и автоприцепов для жилья, находящимися на придорожной полосе",
                "children": [],
                "path": "I/55/5530/55302/"
              }
            ],
            "path": "I/55/5530/"
          },
          {
            "code": "559",
            "name": "Предоставление услуг прочими местами для проживания",
            "children": [],
            "path": "I/55/559/"
          },
          {
            "code": "5590",
            "name": "Предоставление услуг прочими местами для проживания",
            "children": [
              {
                "code": "55901",
                "name": "Предоставление услуг общежитиями при школах-интернатах",
                "children": [],
                "path": "I/55/5590/55901/"
              },
              {
                "code": "55902",
                "name": "Предоставление услуг студенческими общежитиями",
                "children": [],
                "path": "I/55/5590/55902/"
              },
              {
                "code": "55909",
                "name": "Предоставление услуг прочими местами для проживания, не включенными в другие категории",
                "children": [],
                "path": "I/55/5590/55909/"
              }
            ],
            "path": "I/55/5590/"
          }
        ],
        "path": "I/55/"
      },
      {
        "code": "56",
        "name": "Предоставление услуг по обеспечению питанием и напитками",
        "children": [
          {
            "code": "561",
            "name": "Деятельность ресторанов и предоставление услуг по доставке продуктов питания",
            "children": [],
            "path": "I/56/561/"
          },
          {
            "code": "5610",
            "name": "Деятельность ресторанов и предоставление услуг по доставке продуктов питания",
            "children": [
              {
                "code": "56101",
                "name": "Деятельность ресторанов и предоставление услуг по доставке продуктов питания, за исключением деятельности объектов, находящихся на придорожной полосе",
                "children": [],
                "path": "I/56/5610/56101/"
              },
              {
                "code": "56102",
                "name": "Деятельность ресторанов и предоставление услуг по доставке продуктов питания объектами, находящимися на придорожной полосе",
                "children": [],
                "path": "I/56/5610/56102/"
              }
            ],
            "path": "I/56/5610/"
          },
          {
            "code": "562",
            "name": "Доставка готовой пищи на заказ и прочая деятельность по обеспечению питанием",
            "children": [
              {
                "code": "5621",
                "name": "Доставка готовой пищи на заказ",
                "children": [],
                "path": "I/56/562/5621/"
              },
              {
                "code": "56210",
                "name": "Доставка готовой пищи на заказ",
                "children": [],
                "path": "I/56/562/56210/"
              },
              {
                "code": "5629",
                "name": "Прочая деятельность по обеспечению питанием",
                "children": [
                  {
                    "code": "56291",
                    "name": "Прочие виды организации питания вне населенных пунктов",
                    "children": [],
                    "path": "I/56/562/5629/56291/"
                  },
                  {
                    "code": "56292",
                    "name": "Прочие виды организации питания в пассажирских поездах",
                    "children": [],
                    "path": "I/56/562/5629/56292/"
                  },
                  {
                    "code": "56299",
                    "name": "Прочая деятельность по обеспечению питанием, не включенная в другие группировки",
                    "children": [],
                    "path": "I/56/562/5629/56299/"
                  }
                ],
                "path": "I/56/562/5629/"
              }
            ],
            "path": "I/56/562/"
          },
          {
            "code": "563",
            "name": "Подача напитков",
            "children": [],
            "path": "I/56/563/"
          },
          {
            "code": "5630",
            "name": "Подача напитков",
            "children": [],
            "path": "I/56/5630/"
          },
          {
            "code": "56300",
            "name": "Подача напитков",
            "children": [],
            "path": "I/56/56300/"
          }
        ],
        "path": "I/56/"
      }
    ],
    "path": "I/"
  },
  {
    "code": "J",
    "name": "Информация и связь",
    "children": [
      {
        "code": "58",
        "name": "Издательская деятельность",
        "children": [
          {
            "code": "581",
            "name": "Издание книг, периодических публикаций и другие виды издательской деятельности",
            "children": [
              {
                "code": "5811",
                "name": "Издание книг",
                "children": [],
                "path": "J/58/581/5811/"
              },
              {
                "code": "58110",
                "name": "Издание книг",
                "children": [],
                "path": "J/58/581/58110/"
              },
              {
                "code": "5812",
                "name": "Издание справочников и списков рассылок",
                "children": [],
                "path": "J/58/581/5812/"
              },
              {
                "code": "58120",
                "name": "Издание справочников и списков рассылок",
                "children": [],
                "path": "J/58/581/58120/"
              },
              {
                "code": "5813",
                "name": "Издание газет",
                "children": [],
                "path": "J/58/581/5813/"
              },
              {
                "code": "58130",
                "name": "Издание газет",
                "children": [],
                "path": "J/58/581/58130/"
              },
              {
                "code": "5814",
                "name": "Издание журналов и периодических публикаций",
                "children": [],
                "path": "J/58/581/5814/"
              },
              {
                "code": "58140",
                "name": "Издание журналов и периодических публикаций",
                "children": [],
                "path": "J/58/581/58140/"
              },
              {
                "code": "5819",
                "name": "Прочие виды издательской деятельности",
                "children": [],
                "path": "J/58/581/5819/"
              },
              {
                "code": "58190",
                "name": "Прочие виды издательской деятельности",
                "children": [],
                "path": "J/58/581/58190/"
              }
            ],
            "path": "J/58/581/"
          },
          {
            "code": "582",
            "name": "Издание программного обеспечения",
            "children": [
              {
                "code": "5821",
                "name": "Издание компьютерных игр",
                "children": [],
                "path": "J/58/582/5821/"
              },
              {
                "code": "58210",
                "name": "Издание компьютерных игр",
                "children": [],
                "path": "J/58/582/58210/"
              },
              {
                "code": "5829",
                "name": "Издание прочего программного обеспечения",
                "children": [],
                "path": "J/58/582/5829/"
              },
              {
                "code": "58290",
                "name": "Издание прочего программного обеспечения",
                "children": [],
                "path": "J/58/582/58290/"
              }
            ],
            "path": "J/58/582/"
          }
        ],
        "path": "J/58/"
      },
      {
        "code": "59",
        "name": "Производство кино-, видеофильмов и телевизионных программ, деятельность в сфере звукозаписи и издания музыкальных произведений",
        "children": [
          {
            "code": "591",
            "name": "Деятельность по производству кино-, видеофильмов и телевизионных программ",
            "children": [
              {
                "code": "5911",
                "name": "Деятельность по производству кино-, видеофильмов и телевизионных программ",
                "children": [],
                "path": "J/59/591/5911/"
              },
              {
                "code": "59110",
                "name": "Деятельность по производству кино-, видеофильмов и телевизионных программ",
                "children": [],
                "path": "J/59/591/59110/"
              },
              {
                "code": "5912",
                "name": "Деятельность по завершению создания кино-, видеофильмов и телевизионных программ",
                "children": [],
                "path": "J/59/591/5912/"
              },
              {
                "code": "59120",
                "name": "Деятельность по завершению создания кино-, видеофильмов и телевизионных программ",
                "children": [],
                "path": "J/59/591/59120/"
              },
              {
                "code": "5913",
                "name": "Деятельность по распространению кино-, видеофильмов и телевизионных программ",
                "children": [],
                "path": "J/59/591/5913/"
              },
              {
                "code": "59130",
                "name": "Деятельность по распространению кино-, видеофильмов и телевизионных программ",
                "children": [],
                "path": "J/59/591/59130/"
              },
              {
                "code": "5914",
                "name": "Деятельность по показу кинофильмов",
                "children": [],
                "path": "J/59/591/5914/"
              },
              {
                "code": "59140",
                "name": "Деятельность по показу кинофильмов",
                "children": [],
                "path": "J/59/591/59140/"
              }
            ],
            "path": "J/59/591/"
          },
          {
            "code": "592",
            "name": "Деятельность в сфере звукозаписи и издания музыкальных произведений",
            "children": [],
            "path": "J/59/592/"
          },
          {
            "code": "5920",
            "name": "Деятельность в сфере звукозаписи и издания музыкальных произведений",
            "children": [],
            "path": "J/59/5920/"
          },
          {
            "code": "59200",
            "name": "Деятельность в сфере звукозаписи и издания музыкальных произведений",
            "children": [],
            "path": "J/59/59200/"
          }
        ],
        "path": "J/59/"
      },
      {
        "code": "60",
        "name": "Деятельность по созданию программ и телерадиовещание",
        "children": [
          {
            "code": "601",
            "name": "Радиовещание",
            "children": [],
            "path": "J/60/601/"
          },
          {
            "code": "6010",
            "name": "Радиовещание",
            "children": [],
            "path": "J/60/6010/"
          },
          {
            "code": "60100",
            "name": "Радиовещание",
            "children": [],
            "path": "J/60/60100/"
          },
          {
            "code": "602",
            "name": "Деятельность по созданию и трансляции телевизионных программ",
            "children": [],
            "path": "J/60/602/"
          },
          {
            "code": "6020",
            "name": "Деятельность по созданию и трансляции телевизионных программ",
            "children": [],
            "path": "J/60/6020/"
          },
          {
            "code": "60200",
            "name": "Деятельность по созданию и трансляции телевизионных программ",
            "children": [],
            "path": "J/60/60200/"
          },
          {
            "code": "61",
            "name": "Телекоммуникации",
            "children": [
              {
                "code": "611",
                "name": "Проводная телекоммуникационная связь",
                "children": [],
                "path": "J/60/61/611/"
              },
              {
                "code": "6110",
                "name": "Проводная телекоммуникационная связь",
                "children": [
                  {
                    "code": "61101",
                    "name": "Проводная телекоммуникационная связь для государственных органов посредством единой транспортной среды",
                    "children": [],
                    "path": "J/60/61/6110/61101/"
                  },
                  {
                    "code": "61109",
                    "name": "Прочая проводная телекоммуникационная связь",
                    "children": [],
                    "path": "J/60/61/6110/61109/"
                  }
                ],
                "path": "J/60/61/6110/"
              },
              {
                "code": "612",
                "name": "Беспроводная телекоммуникационная связь",
                "children": [],
                "path": "J/60/61/612/"
              },
              {
                "code": "6120",
                "name": "Беспроводная телекоммуникационная связь",
                "children": [
                  {
                    "code": "61201",
                    "name": "Беспроводная телекоммуникационная связь посредством единой транспортной среды",
                    "children": [],
                    "path": "J/60/61/6120/61201/"
                  },
                  {
                    "code": "61202",
                    "name": "Организация вещания теле-, радиопрограмм посредством сети национального оператора телерадиовещания",
                    "children": [],
                    "path": "J/60/61/6120/61202/"
                  },
                  {
                    "code": "61209",
                    "name": "Прочая беспроводная телекоммуникационная связь",
                    "children": [],
                    "path": "J/60/61/6120/61209/"
                  }
                ],
                "path": "J/60/61/6120/"
              },
              {
                "code": "613",
                "name": "Деятельность в области спутниковых телекоммуникаций",
                "children": [],
                "path": "J/60/61/613/"
              },
              {
                "code": "6130",
                "name": "Деятельность в области спутниковых телекоммуникаций",
                "children": [
                  {
                    "code": "61301",
                    "name": "Деятельность в области спутниковых телекоммуникаций для государственных органов посредством единой транспортной среды",
                    "children": [],
                    "path": "J/60/61/6130/61301/"
                  },
                  {
                    "code": "61302",
                    "name": "Деятельность в области спутниковых телекоммуникаций для целей телерадиовещания",
                    "children": [],
                    "path": "J/60/61/6130/61302/"
                  },
                  {
                    "code": "61303",
                    "name": "Деятельность в области спутниковых телекоммуникаций для организации связи",
                    "children": [],
                    "path": "J/60/61/6130/61303/"
                  },
                  {
                    "code": "61309",
                    "name": "Прочая деятельность в области спутниковых телекоммуникаций",
                    "children": [],
                    "path": "J/60/61/6130/61309/"
                  }
                ],
                "path": "J/60/61/6130/"
              },
              {
                "code": "619",
                "name": "Прочая деятельность в области телекоммуникаций",
                "children": [],
                "path": "J/60/61/619/"
              },
              {
                "code": "6190",
                "name": "Прочая деятельность в области телекоммуникаций",
                "children": [
                  {
                    "code": "61901",
                    "name": "Деятельность по распространению телерадиопрограмм посредством сети Интернет",
                    "children": [],
                    "path": "J/60/61/6190/61901/"
                  },
                  {
                    "code": "61909",
                    "name": "Прочая деятельность в области телекоммуникаций, не включенная в другие группировки",
                    "children": [],
                    "path": "J/60/61/6190/61909/"
                  }
                ],
                "path": "J/60/61/6190/"
              }
            ],
            "path": "J/60/61/"
          },
          {
            "code": "62",
            "name": "Компьютерное программирование, консультационные и другие сопутствующие услуги",
            "children": [],
            "path": "J/60/62/"
          },
          {
            "code": "63",
            "name": "Деятельность в области информационного обслуживания",
            "children": [
              {
                "code": "631",
                "name": "Обработка данных, размещение приложений (прикладных программ) и связанная с этим деятельность; деятельность веб-порталов",
                "children": [
                  {
                    "code": "6311",
                    "name": "Обработка данных, размещение приложений (прикладных программ) и связанная с этим деятельность",
                    "children": [
                      {
                        "code": "63111",
                        "name": "Деятельность по предоставлению в пользование серверных помещений (центров обработки данных)",
                        "children": [],
                        "path": "J/60/63/631/6311/63111/"
                      },
                      {
                        "code": "63113",
                        "name": "Деятельность по осуществлению цифрового майнинга",
                        "children": [],
                        "path": "J/60/63/631/6311/63113/"
                      },
                      {
                        "code": "63114",
                        "name": "Деятельность в области обработки данных",
                        "children": [],
                        "path": "J/60/63/631/6311/63114/"
                      },
                      {
                        "code": "63115",
                        "name": "Предоставление в пользование программных продуктов, электронных информационных ресурсов, мобильных и иных приложений",
                        "children": [],
                        "path": "J/60/63/631/6311/63115/"
                      }
                    ],
                    "path": "J/60/63/631/6311/"
                  },
                  {
                    "code": "6312",
                    "name": "Деятельность веб-порталов",
                    "children": [],
                    "path": "J/60/63/631/6312/"
                  },
                  {
                    "code": "63120",
                    "name": "Деятельность веб-порталов",
                    "children": [],
                    "path": "J/60/63/631/63120/"
                  }
                ],
                "path": "J/60/63/631/"
              },
              {
                "code": "639",
                "name": "Прочая деятельность в области информационного обслуживания",
                "children": [
                  {
                    "code": "6391",
                    "name": "Деятельность информационных агентств",
                    "children": [],
                    "path": "J/60/63/639/6391/"
                  },
                  {
                    "code": "63910",
                    "name": "Деятельность информационных агентств",
                    "children": [],
                    "path": "J/60/63/639/63910/"
                  },
                  {
                    "code": "6399",
                    "name": "Прочая деятельность в области информационного обслуживания, не включенная в другие группировки",
                    "children": [
                      {
                        "code": "63991",
                        "name": "Прочие виды деятельности, связанные с предоставлением компьютеризированных услуг телефонной связи",
                        "children": [],
                        "path": "J/60/63/639/6399/63991/"
                      },
                      {
                        "code": "63999",
                        "name": "Прочие виды деятельности в области информационного обслуживания",
                        "children": [],
                        "path": "J/60/63/639/6399/63999/"
                      }
                    ],
                    "path": "J/60/63/639/6399/"
                  }
                ],
                "path": "J/60/63/639/"
              }
            ],
            "path": "J/60/63/"
          }
        ],
        "path": "J/60/"
      },
      {
        "code": "620",
        "name": "Компьютерное программирование, консультационные и другие сопутствующие услуги",
        "children": [
          {
            "code": "6201",
            "name": "Деятельность в области компьютерного программирования",
            "children": [
              {
                "code": "62011",
                "name": "Деятельность в области разработки и тестирования программного кода",
                "children": [],
                "path": "J/620/6201/62011/"
              },
              {
                "code": "62012",
                "name": "Сопровождение программного обеспечения, программных продуктов, баз данных, интернет-ресурсов (сайтов), информационных систем",
                "children": [],
                "path": "J/620/6201/62012/"
              },
              {
                "code": "62013",
                "name": "Деятельность по управлению проектом в области информационных технологий",
                "children": [],
                "path": "J/620/6201/62013/"
              },
              {
                "code": "62014",
                "name": "Деятельность в области разработки технической документации и системной архитектуры",
                "children": [],
                "path": "J/620/6201/62014/"
              }
            ],
            "path": "J/620/6201/"
          },
          {
            "code": "6202",
            "name": "Консультационные услуги в области информационных технологий",
            "children": [],
            "path": "J/620/6202/"
          },
          {
            "code": "62020",
            "name": "Консультационные услуги в области информационных технологий",
            "children": [],
            "path": "J/620/62020/"
          },
          {
            "code": "6203",
            "name": "Деятельность по управлению компьютерным оборудованием",
            "children": [
              {
                "code": "62031",
                "name": "Системно-техническое обслуживание аппаратно-программных комплексов",
                "children": [],
                "path": "J/620/6203/62031/"
              },
              {
                "code": "62032",
                "name": "Деятельность в области монтажа и настройки аппаратно-программных комплексов",
                "children": [],
                "path": "J/620/6203/62032/"
              }
            ],
            "path": "J/620/6203/"
          },
          {
            "code": "6209",
            "name": "Другие виды деятельности в области информационных технологий и информационных систем",
            "children": [
              {
                "code": "62092",
                "name": "Деятельность в области кибербезопасности",
                "children": [],
                "path": "J/620/6209/62092/"
              },
              {
                "code": "62099",
                "name": "Другие виды деятельности в области информационных технологий",
                "children": [],
                "path": "J/620/6209/62099/"
              }
            ],
            "path": "J/620/6209/"
          }
        ],
        "path": "J/620/"
      }
    ],
    "path": "J/"
  },
  {
    "code": "K",
    "name": "Финансовая и страховая деятельность",
    "children": [
      {
        "code": "64",
        "name": "Финансовое посредничество, кроме страхования и пенсионного обеспечения",
        "children": [
          {
            "code": "641",
            "name": "Денежное посредничество",
            "children": [
              {
                "code": "6411",
                "name": "Деятельность национального банка",
                "children": [],
                "path": "K/64/641/6411/"
              },
              {
                "code": "64110",
                "name": "Деятельность национального банка",
                "children": [],
                "path": "K/64/641/64110/"
              },
              {
                "code": "6419",
                "name": "Прочее денежное посредничество",
                "children": [
                  {
                    "code": "64191",
                    "name": "Деятельность банков, за исключением, банка, являющегося национальным институтом развития, и его дочерней организации-лизингодателя",
                    "children": [],
                    "path": "K/64/641/6419/64191/"
                  },
                  {
                    "code": "64192",
                    "name": "Деятельность сберегательных банков",
                    "children": [],
                    "path": "K/64/641/6419/64192/"
                  },
                  {
                    "code": "64193",
                    "name": "Деятельность банка, являющегося национальным институтом развития, и его дочерней организации-лизингодателя",
                    "children": [],
                    "path": "K/64/641/6419/64193/"
                  },
                  {
                    "code": "64199",
                    "name": "Денежное посредничество прочих финансовых учреждений",
                    "children": [],
                    "path": "K/64/641/6419/64199/"
                  }
                ],
                "path": "K/64/641/6419/"
              }
            ],
            "path": "K/64/641/"
          },
          {
            "code": "642",
            "name": "Деятельность холдинговых компаний",
            "children": [],
            "path": "K/64/642/"
          },
          {
            "code": "6420",
            "name": "Деятельность холдинговых компаний",
            "children": [],
            "path": "K/64/6420/"
          },
          {
            "code": "64200",
            "name": "Деятельность холдинговых компаний",
            "children": [],
            "path": "K/64/64200/"
          },
          {
            "code": "643",
            "name": "Деятельность трастовых компаний, инвестиционных фондов и аналогичных финансовых организаций",
            "children": [],
            "path": "K/64/643/"
          },
          {
            "code": "6430",
            "name": "Деятельность трастовых компаний, инвестиционных фондов и аналогичных финансовых организаций",
            "children": [],
            "path": "K/64/6430/"
          },
          {
            "code": "64300",
            "name": "Деятельность трастовых компаний, инвестиционных фондов и аналогичных финансовых организаций",
            "children": [],
            "path": "K/64/64300/"
          },
          {
            "code": "649",
            "name": "Прочее финансовое посредничество, кроме страхования и пенсионного обеспечения",
            "children": [
              {
                "code": "6491",
                "name": "Финансовый лизинг",
                "children": [
                  {
                    "code": "64911",
                    "name": "Финансовый лизинг, кроме финансового лизинга медицинского оборудования и техники",
                    "children": [],
                    "path": "K/64/649/6491/64911/"
                  },
                  {
                    "code": "64912",
                    "name": "Финансовый лизинг медицинского оборудования и техники",
                    "children": [],
                    "path": "K/64/649/6491/64912/"
                  }
                ],
                "path": "K/64/649/6491/"
              },
              {
                "code": "6492",
                "name": "Прочие виды кредитования",
                "children": [
                  {
                    "code": "64921",
                    "name": "Деятельность ломбардов",
                    "children": [],
                    "path": "K/64/649/6492/64921/"
                  },
                  {
                    "code": "64922",
                    "name": "Деятельность специальных фондов финансовой поддержки субъектов частного предпринимательства",
                    "children": [],
                    "path": "K/64/649/6492/64922/"
                  },
                  {
                    "code": "64929",
                    "name": "Прочие виды кредитования, не включенные в другие группировки",
                    "children": [],
                    "path": "K/64/649/6492/64929/"
                  }
                ],
                "path": "K/64/649/6492/"
              },
              {
                "code": "6499",
                "name": "Прочее финансовое посредничество, кроме страхования и пенсионного обеспечения, не включенное в другие группировки",
                "children": [
                  {
                    "code": "64991",
                    "name": "Финансово-экономические услуги, оказываемые субъектам индустриально-инновационной деятельности и агропромышленного комплекса",
                    "children": [],
                    "path": "K/64/649/6499/64991/"
                  },
                  {
                    "code": "64992",
                    "name": "Другие финансовые услуги, финансирование в различных отраслях экономики, инвестиционная деятельность",
                    "children": [],
                    "path": "K/64/649/6499/64992/"
                  },
                  {
                    "code": "64999",
                    "name": "Другие виды финансовых услуг, кроме страхования и пенсионного обеспечения, не включенные в другие группировки",
                    "children": [],
                    "path": "K/64/649/6499/64999/"
                  }
                ],
                "path": "K/64/649/6499/"
              }
            ],
            "path": "K/64/649/"
          }
        ],
        "path": "K/64/"
      },
      {
        "code": "65",
        "name": "Страхование, перестрахование и пенсионное обеспечение, кроме обязательного социального обеспечения",
        "children": [
          {
            "code": "651",
            "name": "Страхование",
            "children": [
              {
                "code": "6511",
                "name": "Страхование жизни",
                "children": [
                  {
                    "code": "65111",
                    "name": "Государственное страхование жизни",
                    "children": [],
                    "path": "K/65/651/6511/65111/"
                  },
                  {
                    "code": "65112",
                    "name": "Негосударственное страхование жизни",
                    "children": [],
                    "path": "K/65/651/6511/65112/"
                  }
                ],
                "path": "K/65/651/6511/"
              },
              {
                "code": "6512",
                "name": "Страхование ущерба",
                "children": [
                  {
                    "code": "65121",
                    "name": "Государственное страхование ущерба",
                    "children": [],
                    "path": "K/65/651/6512/65121/"
                  },
                  {
                    "code": "65122",
                    "name": "Негосударственное страхование ущерба",
                    "children": [],
                    "path": "K/65/651/6512/65122/"
                  }
                ],
                "path": "K/65/651/6512/"
              }
            ],
            "path": "K/65/651/"
          },
          {
            "code": "652",
            "name": "Перестрахование",
            "children": [],
            "path": "K/65/652/"
          },
          {
            "code": "6520",
            "name": "Перестрахование",
            "children": [],
            "path": "K/65/6520/"
          },
          {
            "code": "65200",
            "name": "Перестрахование",
            "children": [],
            "path": "K/65/65200/"
          },
          {
            "code": "653",
            "name": "Пенсионное обеспечение",
            "children": [],
            "path": "K/65/653/"
          },
          {
            "code": "6530",
            "name": "Пенсионное обеспечение",
            "children": [
              {
                "code": "65301",
                "name": "Государственное пенсионное обеспечение",
                "children": [],
                "path": "K/65/6530/65301/"
              },
              {
                "code": "65302",
                "name": "Негосударственное пенсионное обеспечение",
                "children": [],
                "path": "K/65/6530/65302/"
              }
            ],
            "path": "K/65/6530/"
          }
        ],
        "path": "K/65/"
      },
      {
        "code": "66",
        "name": "Вспомогательная деятельность в сфере финансовых услуг и страхования",
        "children": [
          {
            "code": "661",
            "name": "Вспомогательная деятельность в сфере финансовых услуг, кроме страхования и пенсионного обеспечения",
            "children": [
              {
                "code": "6611",
                "name": "Управление финансовыми рынками",
                "children": [
                  {
                    "code": "66111",
                    "name": "Деятельность товарных бирж",
                    "children": [],
                    "path": "K/66/661/6611/66111/"
                  },
                  {
                    "code": "66112",
                    "name": "Деятельность, связанная с управлением финансовыми рынками",
                    "children": [],
                    "path": "K/66/661/6611/66112/"
                  },
                  {
                    "code": "66113",
                    "name": "Деятельность по ведению системы реестров держателей ценных бумаг и участников хозяйственных товариществ",
                    "children": [],
                    "path": "K/66/661/6611/66113/"
                  }
                ],
                "path": "K/66/661/6611/"
              },
              {
                "code": "6612",
                "name": "Брокерская деятельность по сделкам с ценными бумагами и товарами",
                "children": [
                  {
                    "code": "66121",
                    "name": "Брокерская и дилерская деятельность, связанная с управлением активами Национального фонда, золотовалютными активами Национального Банка, пенсионными активами",
                    "children": [],
                    "path": "K/66/661/6612/66121/"
                  },
                  {
                    "code": "66122",
                    "name": "Брокерская деятельность по сделкам с ценными бумагами и товарами, за исключением деятельности, связанной с управлением активами Национального фонда, золотовалютными активами Национального Банка, пенсионными активами",
                    "children": [],
                    "path": "K/66/661/6612/66122/"
                  }
                ],
                "path": "K/66/661/6612/"
              },
              {
                "code": "6619",
                "name": "Прочая вспомогательная деятельность в сфере финансовых услуг, кроме страхования и пенсионного обеспечения",
                "children": [],
                "path": "K/66/661/6619/"
              },
              {
                "code": "66190",
                "name": "Прочая вспомогательная деятельность в сфере финансовых услуг, кроме страхования и пенсионного обеспечения",
                "children": [],
                "path": "K/66/661/66190/"
              }
            ],
            "path": "K/66/661/"
          },
          {
            "code": "662",
            "name": "Вспомогательная деятельность по страхованию и пенсионному обеспечению",
            "children": [
              {
                "code": "6621",
                "name": "Оценка страховых рисков и убытков",
                "children": [],
                "path": "K/66/662/6621/"
              },
              {
                "code": "66210",
                "name": "Оценка страховых рисков и убытков",
                "children": [],
                "path": "K/66/662/66210/"
              },
              {
                "code": "6622",
                "name": "Деятельность страховых агентов и брокеров",
                "children": [],
                "path": "K/66/662/6622/"
              },
              {
                "code": "66220",
                "name": "Деятельность страховых агентов и брокеров",
                "children": [],
                "path": "K/66/662/66220/"
              },
              {
                "code": "6629",
                "name": "Прочая вспомогательная деятельность по страхованию и пенсионному обеспечению",
                "children": [],
                "path": "K/66/662/6629/"
              },
              {
                "code": "66290",
                "name": "Прочая вспомогательная деятельность по страхованию и пенсионному обеспечению",
                "children": [],
                "path": "K/66/662/66290/"
              }
            ],
            "path": "K/66/662/"
          },
          {
            "code": "663",
            "name": "Деятельность по управлению фондами",
            "children": [],
            "path": "K/66/663/"
          },
          {
            "code": "6630",
            "name": "Деятельность по управлению фондами",
            "children": [
              {
                "code": "66301",
                "name": "Деятельность по управлению активами Национального фонда, золотовалютными активами Национального Банка, пенсионными активами",
                "children": [],
                "path": "K/66/6630/66301/"
              },
              {
                "code": "66302",
                "name": "Деятельность по доверительному управлению портфелем активов фондов",
                "children": [],
                "path": "K/66/6630/66302/"
              }
            ],
            "path": "K/66/6630/"
          }
        ],
        "path": "K/66/"
      }
    ],
    "path": "K/"
  },
  {
    "code": "L",
    "name": "Операции с недвижимым имуществом",
    "children": [
      {
        "code": "68",
        "name": "Операции с недвижимым имуществом",
        "children": [
          {
            "code": "681",
            "name": "Покупка и продажа собственного недвижимого имущества",
            "children": [],
            "path": "L/68/681/"
          },
          {
            "code": "6810",
            "name": "Покупка и продажа собственного недвижимого имущества",
            "children": [
              {
                "code": "68101",
                "name": "Покупка и продажа многоквартирных и жилых домов (особняков)",
                "children": [],
                "path": "L/68/6810/68101/"
              },
              {
                "code": "68102",
                "name": "Покупка и продажа прочей недвижимости",
                "children": [],
                "path": "L/68/6810/68102/"
              }
            ],
            "path": "L/68/6810/"
          },
          {
            "code": "682",
            "name": "Аренда и управление собственной или арендуемой недвижимостью",
            "children": [],
            "path": "L/68/682/"
          },
          {
            "code": "6820",
            "name": "Аренда и управление собственной или арендуемой недвижимостью",
            "children": [
              {
                "code": "68201",
                "name": "Аренда (субаренда) и управление собственной или арендованной жилой недвижимостью",
                "children": [],
                "path": "L/68/6820/68201/"
              },
              {
                "code": "68202",
                "name": "Аренда (субаренда) и управление собственными или арендованными бизнес-центром, офисными помещениями, административным зданием",
                "children": [],
                "path": "L/68/6820/68202/"
              },
              {
                "code": "68203",
                "name": "Аренда (субаренда) и управление собственным или арендованным торговым рынком",
                "children": [],
                "path": "L/68/6820/68203/"
              },
              {
                "code": "68204",
                "name": "Аренда и управление собственной торговой недвижимостью и многофункциональными комплексами в торговой деятельности",
                "children": [],
                "path": "L/68/6820/68204/"
              },
              {
                "code": "68205",
                "name": "Аренда (субаренда) и управление арендуемой торговой недвижимостью и арендованными многофункциональными комплексами в торговой деятельности",
                "children": [],
                "path": "L/68/6820/68205/"
              },
              {
                "code": "68206",
                "name": "Аренда (субаренда) и управление собственными или арендованными встроенными, пристроенными нежилыми помещениями в жилых домах",
                "children": [],
                "path": "L/68/6820/68206/"
              },
              {
                "code": "68207",
                "name": "Аренда (субаренда) и управление собственными или арендованными выставочным залом, конференц-залами",
                "children": [],
                "path": "L/68/6820/68207/"
              },
              {
                "code": "68208",
                "name": "Аренда (субаренда) и управление собственными или арендованными складскими помещениями",
                "children": [],
                "path": "L/68/6820/68208/"
              },
              {
                "code": "68209",
                "name": "Аренда (субаренда) и управление собственной или арендованной прочей недвижимостью, не включенной в другие группировки",
                "children": [],
                "path": "L/68/6820/68209/"
              }
            ],
            "path": "L/68/6820/"
          },
          {
            "code": "683",
            "name": "Операции с недвижимым имуществом за вознаграждение или на договорной основе",
            "children": [
              {
                "code": "6831",
                "name": "Деятельность агентств по операциям с недвижимым имуществом",
                "children": [
                  {
                    "code": "68311",
                    "name": "Посреднические услуги при купле-продаже и сдаче внаем недвижимого имущества производственно-технического назначения",
                    "children": [],
                    "path": "L/68/683/6831/68311/"
                  },
                  {
                    "code": "68312",
                    "name": "Посреднические услуги при купле-продаже и сдаче внаем жилья и другого недвижимого имущества непроизводственного назначения",
                    "children": [],
                    "path": "L/68/683/6831/68312/"
                  }
                ],
                "path": "L/68/683/6831/"
              },
              {
                "code": "6832",
                "name": "Управление недвижимым имуществом за вознаграждение или на договорной основе",
                "children": [
                  {
                    "code": "68321",
                    "name": "Управление недвижимостью за вознаграждение или на договорной основе",
                    "children": [],
                    "path": "L/68/683/6832/68321/"
                  },
                  {
                    "code": "68322",
                    "name": "Обеспечение мер при эксплуатаций «Эталонного центра»",
                    "children": [],
                    "path": "L/68/683/6832/68322/"
                  }
                ],
                "path": "L/68/683/6832/"
              }
            ],
            "path": "L/68/683/"
          }
        ],
        "path": "L/68/"
      }
    ],
    "path": "L/"
  },
  {
    "code": "M",
    "name": "Профессиональная, научная и техническая деятельность",
    "children": [
      {
        "code": "69",
        "name": "Деятельность в области права и бухгалтерского учета",
        "children": [
          {
            "code": "691",
            "name": "Деятельность в области права",
            "children": [],
            "path": "M/69/691/"
          },
          {
            "code": "6910",
            "name": "Деятельность в области права",
            "children": [
              {
                "code": "69101",
                "name": "Адвокатская деятельность",
                "children": [],
                "path": "M/69/6910/69101/"
              },
              {
                "code": "69102",
                "name": "Нотариальная деятельность",
                "children": [],
                "path": "M/69/6910/69102/"
              },
              {
                "code": "69109",
                "name": "Прочая деятельность в области права",
                "children": [],
                "path": "M/69/6910/69109/"
              }
            ],
            "path": "M/69/6910/"
          },
          {
            "code": "692",
            "name": "Деятельность в области бухгалтерского учета и аудита; консультирование по налогообложению",
            "children": [],
            "path": "M/69/692/"
          },
          {
            "code": "6920",
            "name": "Деятельность в области бухгалтерского учета и аудита; консультирование по налогообложению",
            "children": [
              {
                "code": "69201",
                "name": "Деятельность по проведению финансовой ревизии (аудита)",
                "children": [],
                "path": "M/69/6920/69201/"
              },
              {
                "code": "69202",
                "name": "Деятельность в области составления счетов и бухгалтерского учета",
                "children": [],
                "path": "M/69/6920/69202/"
              },
              {
                "code": "69203",
                "name": "Консультрование в области налогообложения",
                "children": [],
                "path": "M/69/6920/69203/"
              },
              {
                "code": "69204",
                "name": "Деятельность, связанная с неплатежеспособностью и взысканием задолженности",
                "children": [],
                "path": "M/69/6920/69204/"
              },
              {
                "code": "69205",
                "name": "Деятельность в области бухгалтерского, налогового учета и казначейских операций для национального управляющего холдинга",
                "children": [],
                "path": "M/69/6920/69205/"
              }
            ],
            "path": "M/69/6920/"
          }
        ],
        "path": "M/69/"
      },
      {
        "code": "70",
        "name": "Деятельность головных компаний; консультирование по вопросам управления",
        "children": [
          {
            "code": "701",
            "name": "Деятельность головных компаний",
            "children": [],
            "path": "M/70/701/"
          },
          {
            "code": "7010",
            "name": "Деятельность головных компаний",
            "children": [
              {
                "code": "70101",
                "name": "Деятельность головных компаний, связанная с реализацией государственной политики индустриально-инновационного развития",
                "children": [],
                "path": "M/70/7010/70101/"
              },
              {
                "code": "70109",
                "name": "Деятельность прочих головных компаний",
                "children": [],
                "path": "M/70/7010/70109/"
              }
            ],
            "path": "M/70/7010/"
          },
          {
            "code": "702",
            "name": "Деятельность по консультированию по вопросам управления",
            "children": [
              {
                "code": "7021",
                "name": "Деятельность по взаимоотношениям и связью с общественностью",
                "children": [],
                "path": "M/70/702/7021/"
              },
              {
                "code": "70210",
                "name": "Деятельность по взаимоотношениям и связью с общественностью",
                "children": [],
                "path": "M/70/702/70210/"
              },
              {
                "code": "7022",
                "name": "Консультирование по вопросам коммерческой деятельности и прочее консультирование по вопросам управления",
                "children": [
                  {
                    "code": "70221",
                    "name": "Консультирование по вопросам коммерческой деятельности и управления",
                    "children": [],
                    "path": "M/70/702/7022/70221/"
                  },
                  {
                    "code": "70222",
                    "name": "Консультативное сопровождение концессионных проектов и проектов государственно-частного партнерства",
                    "children": [],
                    "path": "M/70/702/7022/70222/"
                  }
                ],
                "path": "M/70/702/7022/"
              }
            ],
            "path": "M/70/702/"
          },
          {
            "code": "71",
            "name": "Деятельность в области архитектуры, инженерных изысканий, технических испытаний и анализа",
            "children": [
              {
                "code": "711",
                "name": "Деятельность в области архитектуры, инженерных изысканий и предоставление технических консультаций в этих областях",
                "children": [
                  {
                    "code": "7111",
                    "name": "Деятельность в области архитектуры",
                    "children": [
                      {
                        "code": "71111",
                        "name": "Деятельность в области архитектуры для объектов атомной промышленности и атомной энергетики",
                        "children": [],
                        "path": "M/70/71/711/7111/71111/"
                      },
                      {
                        "code": "71112",
                        "name": "Деятельность в области архитектуры, за исключением объектов атомной промышленности и атомной энергетики",
                        "children": [],
                        "path": "M/70/71/711/7111/71112/"
                      }
                    ],
                    "path": "M/70/71/711/7111/"
                  },
                  {
                    "code": "7112",
                    "name": "Деятельность в области инженерных изысканий и предоставление технических консультаций в этой области",
                    "children": [
                      {
                        "code": "71121",
                        "name": "Деятельность в области инженерно-технического проектирования, за исключением объектов атомной промышленности и атомной энергетики",
                        "children": [],
                        "path": "M/70/71/711/7112/71121/"
                      },
                      {
                        "code": "71122",
                        "name": "Деятельность по проведению геологической разведки и изысканий (без научных исследований и разработок)",
                        "children": [],
                        "path": "M/70/71/711/7112/71122/"
                      },
                      {
                        "code": "71123",
                        "name": "Геодезическая деятельность",
                        "children": [],
                        "path": "M/70/71/711/7112/71123/"
                      },
                      {
                        "code": "71124",
                        "name": "Землеустройство",
                        "children": [],
                        "path": "M/70/71/711/7112/71124/"
                      },
                      {
                        "code": "71125",
                        "name": "Деятельность в области картографии",
                        "children": [],
                        "path": "M/70/71/711/7112/71125/"
                      },
                      {
                        "code": "71126",
                        "name": "Деятельность в области инженерных изысканий и предоставление технических консультаций в этой области для объектов атомной промышленности и атомной энергетики",
                        "children": [],
                        "path": "M/70/71/711/7112/71126/"
                      },
                      {
                        "code": "71127",
                        "name": "Деятельность по предоставлению инженерно-технических консультаций",
                        "children": [],
                        "path": "M/70/71/711/7112/71127/"
                      },
                      {
                        "code": "71128",
                        "name": "Деятельность в области технического регулирования, стандартизации, метрологии и оценки соответствия",
                        "children": [],
                        "path": "M/70/71/711/7112/71128/"
                      }
                    ],
                    "path": "M/70/71/711/7112/"
                  }
                ],
                "path": "M/70/71/711/"
              },
              {
                "code": "712",
                "name": "Технические испытания и анализы",
                "children": [],
                "path": "M/70/71/712/"
              },
              {
                "code": "7120",
                "name": "Технические испытания и анализы",
                "children": [
                  {
                    "code": "71201",
                    "name": "Деятельность санитарно-эпидемиологических организаций",
                    "children": [],
                    "path": "M/70/71/7120/71201/"
                  },
                  {
                    "code": "71202",
                    "name": "Деятельность организаций санитарного просвещения",
                    "children": [],
                    "path": "M/70/71/7120/71202/"
                  },
                  {
                    "code": "71203",
                    "name": "Деятельность нефтеперерабатывающих заводов по осуществлению лабораторных испытаний и анализов",
                    "children": [],
                    "path": "M/70/71/7120/71203/"
                  },
                  {
                    "code": "71204",
                    "name": "Лабораторно-аналитические исследования в геологической отрасли",
                    "children": [],
                    "path": "M/70/71/7120/71204/"
                  },
                  {
                    "code": "71205",
                    "name": "Деятельность по производству судебных экспертиз и исследований, кроме медицинских",
                    "children": [],
                    "path": "M/70/71/7120/71205/"
                  },
                  {
                    "code": "71209",
                    "name": "Деятельность прочих учреждений, осуществляющих технические испытания и анализы",
                    "children": [],
                    "path": "M/70/71/7120/71209/"
                  }
                ],
                "path": "M/70/71/7120/"
              }
            ],
            "path": "M/70/71/"
          },
          {
            "code": "72",
            "name": "Научные исследования и разработки",
            "children": [
              {
                "code": "721",
                "name": "Научные исследования и экспериментальные разработки в области естественных и технических наук",
                "children": [
                  {
                    "code": "7211",
                    "name": "Научные исследования и экспериментальные разработки в области биотехнологий",
                    "children": [],
                    "path": "M/70/72/721/7211/"
                  },
                  {
                    "code": "72110",
                    "name": "Научные исследования и экспериментальные разработки в области биотехнологий",
                    "children": [],
                    "path": "M/70/72/721/72110/"
                  },
                  {
                    "code": "7219",
                    "name": "Прочие научные исследования и экспериментальные разработки в области естественных и технических наук",
                    "children": [
                      {
                        "code": "72191",
                        "name": "Научные исследования и экспериментальные разработки в области проектирования, строительства, ремонта, содержания и диагностики автомобильных дорог и мостовых сооружений",
                        "children": [],
                        "path": "M/70/72/721/7219/72191/"
                      },
                      {
                        "code": "72192",
                        "name": "Научно-исследовательские, опытно-методические и опытно-конструкторские работы в геологической отрасли",
                        "children": [],
                        "path": "M/70/72/721/7219/72192/"
                      },
                      {
                        "code": "72193",
                        "name": "Научные исследования и разработки в области космической деятельности",
                        "children": [],
                        "path": "M/70/72/721/7219/72193/"
                      },
                      {
                        "code": "72194",
                        "name": "Исследования и экспериментальные разработки в области мирного использования атомной энергии",
                        "children": [],
                        "path": "M/70/72/721/7219/72194/"
                      },
                      {
                        "code": "72195",
                        "name": "Исследования и разработки в области противоинфекционных препаратов",
                        "children": [],
                        "path": "M/70/72/721/7219/72195/"
                      },
                      {
                        "code": "72199",
                        "name": "Прочие исследования и разработки в области естественных и технических наук",
                        "children": [],
                        "path": "M/70/72/721/7219/72199/"
                      }
                    ],
                    "path": "M/70/72/721/7219/"
                  }
                ],
                "path": "M/70/72/721/"
              },
              {
                "code": "722",
                "name": "Исследования и экспериментальные разработки в области общественных и гуманитарных наук",
                "children": [],
                "path": "M/70/72/722/"
              },
              {
                "code": "7220",
                "name": "Исследования и экспериментальные разработки в области общественных и гуманитарных наук",
                "children": [
                  {
                    "code": "72201",
                    "name": "Прикладные исследования в области общественных и гуманитарных наук, направленные на содействие развитию отечественных производств",
                    "children": [],
                    "path": "M/70/72/7220/72201/"
                  },
                  {
                    "code": "72202",
                    "name": "Прикладные исследования в области общественных и гуманитарных наук, направленных на развитие индустрии",
                    "children": [],
                    "path": "M/70/72/7220/72202/"
                  },
                  {
                    "code": "72203",
                    "name": "Исследования и экспериментальные разработки в области обороны и национальной безопасности",
                    "children": [],
                    "path": "M/70/72/7220/72203/"
                  },
                  {
                    "code": "72204",
                    "name": "Междисциплинарные исследования и разработки в области экономического, бюджетного и стратегического планирования",
                    "children": [],
                    "path": "M/70/72/7220/72204/"
                  },
                  {
                    "code": "72209",
                    "name": "Исследования и экспериментальные разработки в области общественных и гуманитарных наук, не включенные в другие группировки",
                    "children": [],
                    "path": "M/70/72/7220/72209/"
                  }
                ],
                "path": "M/70/72/7220/"
              }
            ],
            "path": "M/70/72/"
          },
          {
            "code": "73",
            "name": "Рекламная деятельность и исследование конъюнктуры рынка",
            "children": [
              {
                "code": "731",
                "name": "Рекламная деятельность",
                "children": [
                  {
                    "code": "7311",
                    "name": "Деятельность рекламных агентств",
                    "children": [],
                    "path": "M/70/73/731/7311/"
                  },
                  {
                    "code": "73110",
                    "name": "Деятельность рекламных агентств",
                    "children": [],
                    "path": "M/70/73/731/73110/"
                  },
                  {
                    "code": "7312",
                    "name": "Размещение рекламы в средствах массовой информации",
                    "children": [],
                    "path": "M/70/73/731/7312/"
                  },
                  {
                    "code": "73120",
                    "name": "Размещение рекламы в средствах массовой информации",
                    "children": [],
                    "path": "M/70/73/731/73120/"
                  }
                ],
                "path": "M/70/73/731/"
              },
              {
                "code": "732",
                "name": "Исследование конъюнктуры рынка и изучение общественного мнения",
                "children": [],
                "path": "M/70/73/732/"
              },
              {
                "code": "7320",
                "name": "Исследование конъюнктуры рынка и изучение общественного мнения",
                "children": [],
                "path": "M/70/73/7320/"
              },
              {
                "code": "73200",
                "name": "Исследование конъюнктуры рынка и изучение общественного мнения",
                "children": [],
                "path": "M/70/73/73200/"
              }
            ],
            "path": "M/70/73/"
          },
          {
            "code": "74",
            "name": "Прочая профессиональная, научная и техническая деятельность",
            "children": [
              {
                "code": "741",
                "name": "Специализированная дизайнерская деятельность",
                "children": [],
                "path": "M/70/74/741/"
              },
              {
                "code": "7410",
                "name": "Специализированная дизайнерская деятельность",
                "children": [],
                "path": "M/70/74/7410/"
              },
              {
                "code": "74100",
                "name": "Специализированная дизайнерская деятельность",
                "children": [],
                "path": "M/70/74/74100/"
              },
              {
                "code": "742",
                "name": "Деятельность в области фотографии",
                "children": [],
                "path": "M/70/74/742/"
              },
              {
                "code": "7420",
                "name": "Деятельность в области фотографии",
                "children": [],
                "path": "M/70/74/7420/"
              },
              {
                "code": "74200",
                "name": "Деятельность в области фотографии",
                "children": [],
                "path": "M/70/74/74200/"
              },
              {
                "code": "743",
                "name": "Деятельность по устному и письменному переводу",
                "children": [],
                "path": "M/70/74/743/"
              },
              {
                "code": "7430",
                "name": "Деятельность по устному и письменному переводу",
                "children": [],
                "path": "M/70/74/7430/"
              },
              {
                "code": "74300",
                "name": "Деятельность по устному и письменному переводу",
                "children": [],
                "path": "M/70/74/74300/"
              },
              {
                "code": "749",
                "name": "Прочая профессиональная, научная и техническая деятельность, не включенная в другие группировки",
                "children": [],
                "path": "M/70/74/749/"
              },
              {
                "code": "7490",
                "name": "Прочая профессиональная, научная и техническая деятельность, не включенная в другие группировки",
                "children": [
                  {
                    "code": "74901",
                    "name": "Деятельность гидрометеорологической службы",
                    "children": [],
                    "path": "M/70/74/7490/74901/"
                  },
                  {
                    "code": "74902",
                    "name": "Аккредитация в области оценки соответствия",
                    "children": [],
                    "path": "M/70/74/7490/74902/"
                  },
                  {
                    "code": "74903",
                    "name": "Деятельность ведомственных служб, занимающихся инновационными технологиями (медицинские, образовательные, консультационные и др.)",
                    "children": [],
                    "path": "M/70/74/7490/74903/"
                  },
                  {
                    "code": "74909",
                    "name": "Иная профессиональная, научная и техническая деятельность, не включенная в другие группировки",
                    "children": [],
                    "path": "M/70/74/7490/74909/"
                  }
                ],
                "path": "M/70/74/7490/"
              }
            ],
            "path": "M/70/74/"
          },
          {
            "code": "75",
            "name": "Ветеринарная деятельность",
            "children": [],
            "path": "M/70/75/"
          }
        ],
        "path": "M/70/"
      },
      {
        "code": "750",
        "name": "Ветеринарная деятельность",
        "children": [],
        "path": "M/750/"
      },
      {
        "code": "7500",
        "name": "Ветеринарная деятельность",
        "children": [],
        "path": "M/7500/"
      },
      {
        "code": "75000",
        "name": "Ветеринарная деятельность",
        "children": [],
        "path": "M/75000/"
      }
    ],
    "path": "M/"
  },
  {
    "code": "N",
    "name": "Деятельность в области административного и вспомогательного обслуживания",
    "children": [
      {
        "code": "77",
        "name": "Аренда, прокат и лизинг",
        "children": [
          {
            "code": "771",
            "name": "Аренда и лизинг автомобилей",
            "children": [
              {
                "code": "7711",
                "name": "Аренда и лизинг легковых автомобилей и легких автотранспортных средств",
                "children": [
                  {
                    "code": "77111",
                    "name": "Аренда легковых автомобилей и легких автотранспортных средств",
                    "children": [],
                    "path": "N/77/771/7711/77111/"
                  },
                  {
                    "code": "77112",
                    "name": "Лизинг легковых автомобилей и легких автотранспортных средств",
                    "children": [],
                    "path": "N/77/771/7711/77112/"
                  }
                ],
                "path": "N/77/771/7711/"
              },
              {
                "code": "7712",
                "name": "Аренда и лизинг грузовых автомобилей",
                "children": [
                  {
                    "code": "77121",
                    "name": "Аренда грузовых автомобилей",
                    "children": [],
                    "path": "N/77/771/7712/77121/"
                  },
                  {
                    "code": "77122",
                    "name": "Лизинг грузовых автомобилей",
                    "children": [],
                    "path": "N/77/771/7712/77122/"
                  }
                ],
                "path": "N/77/771/7712/"
              }
            ],
            "path": "N/77/771/"
          },
          {
            "code": "772",
            "name": "Аренда и лизинг предметов личного потребления и бытовых товаров",
            "children": [
              {
                "code": "7721",
                "name": "Аренда и лизинг развлекательного и спортивного оборудования",
                "children": [],
                "path": "N/77/772/7721/"
              },
              {
                "code": "77210",
                "name": "Аренда и лизинг развлекательного и спортивного оборудования",
                "children": [],
                "path": "N/77/772/77210/"
              },
              {
                "code": "7722",
                "name": "Прокат видеокассет и дисков",
                "children": [],
                "path": "N/77/772/7722/"
              },
              {
                "code": "77220",
                "name": "Прокат видеокассет и дисков",
                "children": [],
                "path": "N/77/772/77220/"
              },
              {
                "code": "7729",
                "name": "Аренда и лизинг прочих предметов личного потребления и бытовых товаров",
                "children": [],
                "path": "N/77/772/7729/"
              },
              {
                "code": "77290",
                "name": "Аренда и лизинг прочих предметов личного потребления и бытовых товаров",
                "children": [],
                "path": "N/77/772/77290/"
              }
            ],
            "path": "N/77/772/"
          },
          {
            "code": "773",
            "name": "Аренда и лизинг прочих машин, оборудования и материальных активов",
            "children": [
              {
                "code": "7731",
                "name": "Аренда и лизинг сельскохозяйственных машин и оборудования",
                "children": [
                  {
                    "code": "77311",
                    "name": "Аренда сельскохозяйственных машин и оборудования",
                    "children": [],
                    "path": "N/77/773/7731/77311/"
                  },
                  {
                    "code": "77312",
                    "name": "Лизинг сельскохозяйственных машин и оборудования",
                    "children": [],
                    "path": "N/77/773/7731/77312/"
                  }
                ],
                "path": "N/77/773/7731/"
              },
              {
                "code": "7732",
                "name": "Аренда и лизинг строительных машин и оборудования",
                "children": [
                  {
                    "code": "77321",
                    "name": "Аренда строительных машин и оборудования",
                    "children": [],
                    "path": "N/77/773/7732/77321/"
                  },
                  {
                    "code": "77322",
                    "name": "Лизинг строительных машин и оборудования",
                    "children": [],
                    "path": "N/77/773/7732/77322/"
                  }
                ],
                "path": "N/77/773/7732/"
              },
              {
                "code": "7733",
                "name": "Аренда и лизинг офисных машин и оборудования, включая вычислительную технику",
                "children": [
                  {
                    "code": "77331",
                    "name": "Аренда компьютерного и периферийного оборудования для инфотелекоммуникационной системы",
                    "children": [],
                    "path": "N/77/773/7733/77331/"
                  },
                  {
                    "code": "77332",
                    "name": "Лизинг компьютерного и периферийного оборудования для инфотелекоммуникационной системы",
                    "children": [],
                    "path": "N/77/773/7733/77332/"
                  },
                  {
                    "code": "77338",
                    "name": "Аренда прочих офисных машин и оборудования",
                    "children": [],
                    "path": "N/77/773/7733/77338/"
                  },
                  {
                    "code": "77339",
                    "name": "Лизинг прочих офисных машин и оборудования",
                    "children": [],
                    "path": "N/77/773/7733/77339/"
                  }
                ],
                "path": "N/77/773/7733/"
              },
              {
                "code": "7734",
                "name": "Аренда и лизинг водных транспортных средств и оборудования",
                "children": [
                  {
                    "code": "77341",
                    "name": "Аренда водных транспортных средств и оборудования",
                    "children": [],
                    "path": "N/77/773/7734/77341/"
                  },
                  {
                    "code": "77342",
                    "name": "Лизинг водных транспортных средств и оборудования",
                    "children": [],
                    "path": "N/77/773/7734/77342/"
                  }
                ],
                "path": "N/77/773/7734/"
              },
              {
                "code": "7735",
                "name": "Аренда и лизинг воздушных транспортных средств и оборудования",
                "children": [
                  {
                    "code": "77351",
                    "name": "Аренда воздушных транспортных средств и оборудования",
                    "children": [],
                    "path": "N/77/773/7735/77351/"
                  },
                  {
                    "code": "77352",
                    "name": "Лизинг воздушных транспортных средств и оборудования",
                    "children": [],
                    "path": "N/77/773/7735/77352/"
                  }
                ],
                "path": "N/77/773/7735/"
              },
              {
                "code": "7739",
                "name": "Аренда и лизинг прочих машин, оборудования и материальных активов, не включенных в другие группировки",
                "children": [
                  {
                    "code": "77391",
                    "name": "Аренда прочих машин, оборудования и материальных активов, не включенных в другие группировки",
                    "children": [],
                    "path": "N/77/773/7739/77391/"
                  },
                  {
                    "code": "77392",
                    "name": "Лизинг прочих машин, оборудования и материальных активов, не включенных в другие группировки",
                    "children": [],
                    "path": "N/77/773/7739/77392/"
                  }
                ],
                "path": "N/77/773/7739/"
              }
            ],
            "path": "N/77/773/"
          },
          {
            "code": "774",
            "name": "Лизинг продуктов интеллектуальной собственности и аналогичных продуктов, кроме работ, защищенным авторским правом",
            "children": [],
            "path": "N/77/774/"
          },
          {
            "code": "7740",
            "name": "Лизинг продуктов интеллектуальной собственности и аналогичных продуктов, кроме работ, защищенным авторским правом",
            "children": [],
            "path": "N/77/7740/"
          },
          {
            "code": "77400",
            "name": "Лизинг продуктов интеллектуальной собственности и аналогичных продуктов, кроме работ, защищенным авторским правом",
            "children": [],
            "path": "N/77/77400/"
          }
        ],
        "path": "N/77/"
      },
      {
        "code": "78",
        "name": "Деятельность в области трудоустройства",
        "children": [
          {
            "code": "781",
            "name": "Деятельность агентств по трудоустройству",
            "children": [],
            "path": "N/78/781/"
          },
          {
            "code": "7810",
            "name": "Деятельность агентств по трудоустройству",
            "children": [],
            "path": "N/78/7810/"
          },
          {
            "code": "78100",
            "name": "Деятельность агентств по трудоустройству",
            "children": [],
            "path": "N/78/78100/"
          },
          {
            "code": "782",
            "name": "Деятельность агентств по временному трудоустройству",
            "children": [],
            "path": "N/78/782/"
          },
          {
            "code": "7820",
            "name": "Деятельность агентств по временному трудоустройству",
            "children": [],
            "path": "N/78/7820/"
          },
          {
            "code": "78200",
            "name": "Деятельность агентств по временному трудоустройству",
            "children": [],
            "path": "N/78/78200/"
          },
          {
            "code": "783",
            "name": "Прочая деятельность по обеспечению трудовыми ресурсами (персоналом)",
            "children": [],
            "path": "N/78/783/"
          },
          {
            "code": "7830",
            "name": "Прочая деятельность по обеспечению трудовыми ресурсами (персоналом)",
            "children": [
              {
                "code": "78301",
                "name": "Прочая деятельность по обеспечению трудовыми ресурсами (персоналом), кроме деятельности организаций, учрежденных национальными компаниями",
                "children": [],
                "path": "N/78/7830/78301/"
              },
              {
                "code": "78302",
                "name": "Деятельность организаций, учрежденных национальными компаниями, по предоставлению технического и вспомогательного персонала для обслуживания стратегических объектов",
                "children": [],
                "path": "N/78/7830/78302/"
              },
              {
                "code": "78303",
                "name": "Деятельность по кадровому делопроизводству для национального управляющего холдинга",
                "children": [],
                "path": "N/78/7830/78303/"
              }
            ],
            "path": "N/78/7830/"
          }
        ],
        "path": "N/78/"
      },
      {
        "code": "79",
        "name": "Деятельность туристских агентств и операторов, бронирование и сопутствующая деятельность",
        "children": [
          {
            "code": "791",
            "name": "Деятельность туристских агентств и операторов",
            "children": [
              {
                "code": "7911",
                "name": "Деятельность туристских агентств",
                "children": [],
                "path": "N/79/791/7911/"
              },
              {
                "code": "79110",
                "name": "Деятельность туристских агентств",
                "children": [],
                "path": "N/79/791/79110/"
              },
              {
                "code": "7912",
                "name": "Деятельность туристских операторов",
                "children": [],
                "path": "N/79/791/7912/"
              },
              {
                "code": "79120",
                "name": "Деятельность туристских операторов",
                "children": [],
                "path": "N/79/791/79120/"
              }
            ],
            "path": "N/79/791/"
          },
          {
            "code": "799",
            "name": "Прочие услуги по бронированию и сопутствующая деятельность",
            "children": [],
            "path": "N/79/799/"
          },
          {
            "code": "7990",
            "name": "Прочие услуги по бронированию и сопутствующая деятельность",
            "children": [],
            "path": "N/79/7990/"
          },
          {
            "code": "79900",
            "name": "Прочие услуги по бронированию и сопутствующая деятельность",
            "children": [],
            "path": "N/79/79900/"
          }
        ],
        "path": "N/79/"
      },
      {
        "code": "80",
        "name": "Деятельность по обеспечению безопасности и проведению расследований",
        "children": [
          {
            "code": "801",
            "name": "Деятельность по обеспечению безопасности частных лиц и имущества",
            "children": [],
            "path": "N/80/801/"
          },
          {
            "code": "8010",
            "name": "Деятельность по обеспечению безопасности частных лиц и имущества",
            "children": [
              {
                "code": "80101",
                "name": "Деятельность частных охранных служб",
                "children": [],
                "path": "N/80/8010/80101/"
              },
              {
                "code": "80102",
                "name": "Деятельность охранных организаций, учрежденных национальными компаниями",
                "children": [],
                "path": "N/80/8010/80102/"
              }
            ],
            "path": "N/80/8010/"
          },
          {
            "code": "802",
            "name": "Деятельность в области систем обеспечения безопасности",
            "children": [],
            "path": "N/80/802/"
          },
          {
            "code": "8020",
            "name": "Деятельность в области систем обеспечения безопасности",
            "children": [],
            "path": "N/80/8020/"
          },
          {
            "code": "80200",
            "name": "Деятельность в области систем обеспечения безопасности",
            "children": [],
            "path": "N/80/80200/"
          },
          {
            "code": "803",
            "name": "Деятельность по проведению расследований",
            "children": [],
            "path": "N/80/803/"
          },
          {
            "code": "8030",
            "name": "Деятельность по проведению расследований",
            "children": [],
            "path": "N/80/8030/"
          },
          {
            "code": "80300",
            "name": "Деятельность по проведению расследований",
            "children": [],
            "path": "N/80/80300/"
          },
          {
            "code": "81",
            "name": "Деятельность по обслуживанию зданий и благоустройству территорий",
            "children": [
              {
                "code": "811",
                "name": "Комплексное обслуживание объектов",
                "children": [],
                "path": "N/80/81/811/"
              },
              {
                "code": "8110",
                "name": "Комплексное обслуживание объектов",
                "children": [
                  {
                    "code": "81101",
                    "name": "Комплексное обслуживание жилых объектов",
                    "children": [],
                    "path": "N/80/81/8110/81101/"
                  },
                  {
                    "code": "81102",
                    "name": "Комплексное обслуживание коммерческих объектов",
                    "children": [],
                    "path": "N/80/81/8110/81102/"
                  }
                ],
                "path": "N/80/81/8110/"
              },
              {
                "code": "812",
                "name": "Деятельность по уборке",
                "children": [
                  {
                    "code": "8121",
                    "name": "Общая уборка зданий",
                    "children": [
                      {
                        "code": "81211",
                        "name": "Общая уборка жилых домов",
                        "children": [],
                        "path": "N/80/81/812/8121/81211/"
                      },
                      {
                        "code": "81212",
                        "name": "Общая уборка коммерческих зданий",
                        "children": [],
                        "path": "N/80/81/812/8121/81212/"
                      }
                    ],
                    "path": "N/80/81/812/8121/"
                  },
                  {
                    "code": "8122",
                    "name": "Прочая деятельность (специализированная) по уборке зданий, чистке промышленных машин и оборудования",
                    "children": [],
                    "path": "N/80/81/812/8122/"
                  },
                  {
                    "code": "81220",
                    "name": "Прочая деятельность (специализированная) по уборке зданий, чистке промышленных машин и оборудования",
                    "children": [],
                    "path": "N/80/81/812/81220/"
                  },
                  {
                    "code": "8129",
                    "name": "Прочая деятельность по уборке",
                    "children": [],
                    "path": "N/80/81/812/8129/"
                  },
                  {
                    "code": "81290",
                    "name": "Прочая деятельность по уборке",
                    "children": [],
                    "path": "N/80/81/812/81290/"
                  }
                ],
                "path": "N/80/81/812/"
              },
              {
                "code": "813",
                "name": "Деятельность по благоустройству территорий",
                "children": [],
                "path": "N/80/81/813/"
              },
              {
                "code": "8130",
                "name": "Деятельность по благоустройству территорий",
                "children": [],
                "path": "N/80/81/8130/"
              },
              {
                "code": "81300",
                "name": "Деятельность по благоустройству территорий",
                "children": [],
                "path": "N/80/81/81300/"
              }
            ],
            "path": "N/80/81/"
          },
          {
            "code": "82",
            "name": "Деятельность в области офисного административного и вспомогательного обслуживания, направленная на поддержание коммерческой деятельности",
            "children": [
              {
                "code": "821",
                "name": "Деятельность в области офисного административного и вспомогательного обслуживания",
                "children": [
                  {
                    "code": "8211",
                    "name": "Деятельность по предоставлению комплексных офисных административных услуг",
                    "children": [],
                    "path": "N/80/82/821/8211/"
                  },
                  {
                    "code": "82110",
                    "name": "Деятельность по предоставлению комплексных офисных административных услуг",
                    "children": [],
                    "path": "N/80/82/821/82110/"
                  },
                  {
                    "code": "8219",
                    "name": "Деятельность по копированию, подготовке документов и прочая специализированная офисная вспомогательная деятельность",
                    "children": [],
                    "path": "N/80/82/821/8219/"
                  },
                  {
                    "code": "82190",
                    "name": "Деятельность по копированию, подготовке документов и прочая специализированная офисная вспомогательная деятельность",
                    "children": [],
                    "path": "N/80/82/821/82190/"
                  }
                ],
                "path": "N/80/82/821/"
              },
              {
                "code": "822",
                "name": "Деятельность телефонных справочно-информационных служб",
                "children": [],
                "path": "N/80/82/822/"
              },
              {
                "code": "8220",
                "name": "Деятельность телефонных справочно-информационных служб",
                "children": [],
                "path": "N/80/82/8220/"
              },
              {
                "code": "82200",
                "name": "Деятельность телефонных справочно-информационных служб",
                "children": [],
                "path": "N/80/82/82200/"
              },
              {
                "code": "823",
                "name": "Организация конференций и торговых выставок",
                "children": [],
                "path": "N/80/82/823/"
              },
              {
                "code": "8230",
                "name": "Организация конференций и торговых выставок",
                "children": [],
                "path": "N/80/82/8230/"
              },
              {
                "code": "82300",
                "name": "Организация конференций и торговых выставок",
                "children": [],
                "path": "N/80/82/82300/"
              },
              {
                "code": "829",
                "name": "Деятельность по предоставлению вспомогательных коммерческих услуг, не включенная в другие группировки",
                "children": [
                  {
                    "code": "8291",
                    "name": "Деятельность агентств по сбору платежей и кредитных бюро",
                    "children": [
                      {
                        "code": "82911",
                        "name": "Деятельность государственного кредитного бюро",
                        "children": [],
                        "path": "N/80/82/829/8291/82911/"
                      },
                      {
                        "code": "82912",
                        "name": "Деятельность агентств по сбору платежей и кредитных бюро, за исключением государственного",
                        "children": [],
                        "path": "N/80/82/829/8291/82912/"
                      }
                    ],
                    "path": "N/80/82/829/8291/"
                  },
                  {
                    "code": "8292",
                    "name": "Упаковывание",
                    "children": [],
                    "path": "N/80/82/829/8292/"
                  },
                  {
                    "code": "82920",
                    "name": "Упаковывание",
                    "children": [],
                    "path": "N/80/82/829/82920/"
                  },
                  {
                    "code": "8299",
                    "name": "Прочая деятельность по предоставлению вспомогательных коммерческих услуг, не включенная в другие группировки",
                    "children": [],
                    "path": "N/80/82/829/8299/"
                  },
                  {
                    "code": "82990",
                    "name": "Прочая деятельность по предоставлению вспомогательных коммерческих услуг, не включенная в другие группировки",
                    "children": [],
                    "path": "N/80/82/829/82990/"
                  }
                ],
                "path": "N/80/82/829/"
              }
            ],
            "path": "N/80/82/"
          }
        ],
        "path": "N/80/"
      }
    ],
    "path": "N/"
  },
  {
    "code": "O",
    "name": "Государственное управление и оборона; обязательное социальное обеспечение",
    "children": [
      {
        "code": "84",
        "name": "Государственное управление и оборона; обязательное социальное обеспечение",
        "children": [
          {
            "code": "841",
            "name": "Государственное управление общего характера и управление социально-экономической политикой общества",
            "children": [
              {
                "code": "8411",
                "name": "Государственное управление общего характера",
                "children": [
                  {
                    "code": "84111",
                    "name": "Деятельность республиканских органов управления",
                    "children": [],
                    "path": "O/84/841/8411/84111/"
                  },
                  {
                    "code": "84112",
                    "name": "Деятельность региональных органов управления",
                    "children": [],
                    "path": "O/84/841/8411/84112/"
                  },
                  {
                    "code": "84113",
                    "name": "Деятельность местных органов управления",
                    "children": [],
                    "path": "O/84/841/8411/84113/"
                  },
                  {
                    "code": "84114",
                    "name": "Деятельность сельских и поселковых органов управления",
                    "children": [],
                    "path": "O/84/841/8411/84114/"
                  },
                  {
                    "code": "84115",
                    "name": "Деятельность, связанная с налогообложением",
                    "children": [],
                    "path": "O/84/841/8411/84115/"
                  },
                  {
                    "code": "84116",
                    "name": "Деятельность таможни",
                    "children": [],
                    "path": "O/84/841/8411/84116/"
                  },
                  {
                    "code": "84117",
                    "name": "Деятельность в области статистики и социологии",
                    "children": [],
                    "path": "O/84/841/8411/84117/"
                  }
                ],
                "path": "O/84/841/8411/"
              },
              {
                "code": "8412",
                "name": "Регулирование деятельности учреждений здравоохранения, образования, культуры и других социальных услуг, кроме социального обеспечения",
                "children": [],
                "path": "O/84/841/8412/"
              },
              {
                "code": "84120",
                "name": "Регулирование деятельности учреждений здравоохранения, образования, культуры и других социальных услуг, кроме социального обеспечения",
                "children": [],
                "path": "O/84/841/84120/"
              },
              {
                "code": "8413",
                "name": "Регулирование и содействие эффективному ведению экономической деятельности",
                "children": [],
                "path": "O/84/841/8413/"
              },
              {
                "code": "84130",
                "name": "Регулирование и содействие эффективному ведению экономической деятельности",
                "children": [],
                "path": "O/84/841/84130/"
              }
            ],
            "path": "O/84/841/"
          },
          {
            "code": "842",
            "name": "Предоставление государством услуг обществу в целом",
            "children": [
              {
                "code": "8421",
                "name": "Международная деятельность",
                "children": [],
                "path": "O/84/842/8421/"
              },
              {
                "code": "84210",
                "name": "Международная деятельность",
                "children": [],
                "path": "O/84/842/84210/"
              },
              {
                "code": "8422",
                "name": "Оборонная деятельность",
                "children": [],
                "path": "O/84/842/8422/"
              },
              {
                "code": "84220",
                "name": "Оборонная деятельность",
                "children": [],
                "path": "O/84/842/84220/"
              },
              {
                "code": "8423",
                "name": "Деятельность в области юстиции и правосудия",
                "children": [],
                "path": "O/84/842/8423/"
              },
              {
                "code": "84230",
                "name": "Деятельность в области юстиции и правосудия",
                "children": [],
                "path": "O/84/842/84230/"
              },
              {
                "code": "8424",
                "name": "Деятельность по обеспечению общественного порядка и безопасности",
                "children": [],
                "path": "O/84/842/8424/"
              },
              {
                "code": "84240",
                "name": "Деятельность по обеспечению общественного порядка и безопасности",
                "children": [],
                "path": "O/84/842/84240/"
              },
              {
                "code": "8425",
                "name": "Деятельность по обеспечению безопасности в чрезвычайных ситуациях",
                "children": [],
                "path": "O/84/842/8425/"
              },
              {
                "code": "84250",
                "name": "Деятельность по обеспечению безопасности в чрезвычайных ситуациях",
                "children": [],
                "path": "O/84/842/84250/"
              }
            ],
            "path": "O/84/842/"
          },
          {
            "code": "843",
            "name": "Деятельность в области обязательного социального страхования",
            "children": [],
            "path": "O/84/843/"
          },
          {
            "code": "8430",
            "name": "Деятельность в области обязательного социального страхования",
            "children": [],
            "path": "O/84/8430/"
          },
          {
            "code": "84300",
            "name": "Деятельность в области обязательного социального страхования",
            "children": [],
            "path": "O/84/84300/"
          }
        ],
        "path": "O/84/"
      }
    ],
    "path": "O/"
  },
  {
    "code": "P",
    "name": "Образование",
    "children": [
      {
        "code": "85",
        "name": "Образование",
        "children": [
          {
            "code": "851",
            "name": "Дошкольное образование",
            "children": [],
            "path": "P/85/851/"
          },
          {
            "code": "8510",
            "name": "Дошкольное образование",
            "children": [],
            "path": "P/85/8510/"
          },
          {
            "code": "85100",
            "name": "Дошкольное образование",
            "children": [],
            "path": "P/85/85100/"
          },
          {
            "code": "852",
            "name": "Начальное образование (1-й уровень)",
            "children": [],
            "path": "P/85/852/"
          },
          {
            "code": "8520",
            "name": "Начальное образование (1-й уровень)",
            "children": [],
            "path": "P/85/8520/"
          },
          {
            "code": "85200",
            "name": "Начальное образование (1-й уровень)",
            "children": [],
            "path": "P/85/85200/"
          },
          {
            "code": "853",
            "name": "Среднее образование (2-й и 3-й уровни)",
            "children": [
              {
                "code": "8531",
                "name": "Основное и общее среднее образование",
                "children": [],
                "path": "P/85/853/8531/"
              },
              {
                "code": "85310",
                "name": "Основное и общее среднее образование",
                "children": [],
                "path": "P/85/853/85310/"
              },
              {
                "code": "8532",
                "name": "Техническое и профессиональное среднее образование",
                "children": [
                  {
                    "code": "85321",
                    "name": "Профессионально-техническое образование",
                    "children": [],
                    "path": "P/85/853/8532/85321/"
                  },
                  {
                    "code": "85322",
                    "name": "Среднее специальное образование",
                    "children": [],
                    "path": "P/85/853/8532/85322/"
                  }
                ],
                "path": "P/85/853/8532/"
              }
            ],
            "path": "P/85/853/"
          },
          {
            "code": "854",
            "name": "Высшее образование (5-й, 6-й, 7-й, 8-й уровни)",
            "children": [
              {
                "code": "8541",
                "name": "Послесреднее образование",
                "children": [],
                "path": "P/85/854/8541/"
              },
              {
                "code": "85410",
                "name": "Послесреднее образование",
                "children": [],
                "path": "P/85/854/85410/"
              },
              {
                "code": "8542",
                "name": "Высшее и послевузовское образование",
                "children": [
                  {
                    "code": "85421",
                    "name": "Высшее образование",
                    "children": [],
                    "path": "P/85/854/8542/85421/"
                  },
                  {
                    "code": "85422",
                    "name": "Послевузовское образование",
                    "children": [],
                    "path": "P/85/854/8542/85422/"
                  }
                ],
                "path": "P/85/854/8542/"
              }
            ],
            "path": "P/85/854/"
          },
          {
            "code": "855",
            "name": "Прочие виды образования",
            "children": [
              {
                "code": "8551",
                "name": "Образование в области спорта и отдыха",
                "children": [],
                "path": "P/85/855/8551/"
              },
              {
                "code": "85510",
                "name": "Образование в области спорта и отдыха",
                "children": [],
                "path": "P/85/855/85510/"
              },
              {
                "code": "8552",
                "name": "Образование в области культуры",
                "children": [],
                "path": "P/85/855/8552/"
              },
              {
                "code": "85520",
                "name": "Образование в области культуры",
                "children": [],
                "path": "P/85/855/85520/"
              },
              {
                "code": "8553",
                "name": "Деятельность школ подготовки водителей транспортных средств",
                "children": [],
                "path": "P/85/855/8553/"
              },
              {
                "code": "85530",
                "name": "Деятельность школ подготовки водителей транспортных средств",
                "children": [],
                "path": "P/85/855/85530/"
              },
              {
                "code": "8559",
                "name": "Прочие виды образования, не включенные в другие группировки",
                "children": [
                  {
                    "code": "85591",
                    "name": "Деятельность вечерних общеобразовательных школ",
                    "children": [],
                    "path": "P/85/855/8559/85591/"
                  },
                  {
                    "code": "85592",
                    "name": "Виды образования, предоставляемые национальными компаниями и их дочерними организациями",
                    "children": [],
                    "path": "P/85/855/8559/85592/"
                  },
                  {
                    "code": "85599",
                    "name": "Прочая деятельность в области образования, не включенная в другие группировки",
                    "children": [],
                    "path": "P/85/855/8559/85599/"
                  }
                ],
                "path": "P/85/855/8559/"
              }
            ],
            "path": "P/85/855/"
          },
          {
            "code": "856",
            "name": "Вспомогательная деятельность в области образования",
            "children": [],
            "path": "P/85/856/"
          },
          {
            "code": "8560",
            "name": "Вспомогательная деятельность в области образования",
            "children": [
              {
                "code": "85601",
                "name": "Вспомогательная деятельность в области образования, предоставляемая национальными компаниями и их дочерними организациями",
                "children": [],
                "path": "P/85/8560/85601/"
              },
              {
                "code": "85609",
                "name": "Прочая вспомогательная деятельность в области образования",
                "children": [],
                "path": "P/85/8560/85609/"
              }
            ],
            "path": "P/85/8560/"
          }
        ],
        "path": "P/85/"
      }
    ],
    "path": "P/"
  },
  {
    "code": "Q",
    "name": "Здравоохранение и социальное обслуживание населения",
    "children": [
      {
        "code": "86",
        "name": "Деятельность в области здравоохранения",
        "children": [
          {
            "code": "861",
            "name": "Деятельность больничных организаций",
            "children": [],
            "path": "Q/86/861/"
          },
          {
            "code": "8610",
            "name": "Деятельность больничных организаций",
            "children": [
              {
                "code": "86101",
                "name": "Деятельность больниц широкого профиля и специализированных больниц",
                "children": [],
                "path": "Q/86/8610/86101/"
              },
              {
                "code": "86102",
                "name": "Деятельность родильных домов",
                "children": [],
                "path": "Q/86/8610/86102/"
              },
              {
                "code": "86103",
                "name": "Деятельность санаторно-курортных организаций",
                "children": [],
                "path": "Q/86/8610/86103/"
              },
              {
                "code": "86104",
                "name": "Деятельность лепрозориев",
                "children": [],
                "path": "Q/86/8610/86104/"
              },
              {
                "code": "86109",
                "name": "Деятельность других лечебных учреждений, имеющих стационары",
                "children": [],
                "path": "Q/86/8610/86109/"
              }
            ],
            "path": "Q/86/8610/"
          },
          {
            "code": "862",
            "name": "Деятельности в области врачебной практики и стоматологии",
            "children": [
              {
                "code": "8621",
                "name": "Общая врачебная практика",
                "children": [],
                "path": "Q/86/862/8621/"
              },
              {
                "code": "86210",
                "name": "Общая врачебная практика",
                "children": [],
                "path": "Q/86/862/86210/"
              },
              {
                "code": "8622",
                "name": "Специальная врачебная практика",
                "children": [],
                "path": "Q/86/862/8622/"
              },
              {
                "code": "86220",
                "name": "Специальная врачебная практика",
                "children": [],
                "path": "Q/86/862/86220/"
              },
              {
                "code": "8623",
                "name": "Стоматологическая деятельность",
                "children": [],
                "path": "Q/86/862/8623/"
              },
              {
                "code": "86230",
                "name": "Стоматологическая деятельность",
                "children": [],
                "path": "Q/86/862/86230/"
              }
            ],
            "path": "Q/86/862/"
          },
          {
            "code": "869",
            "name": "Прочая деятельность в области здравоохранения",
            "children": [],
            "path": "Q/86/869/"
          },
          {
            "code": "8690",
            "name": "Прочая деятельность в области здравоохранения",
            "children": [
              {
                "code": "86901",
                "name": "Деятельность по производству судебно-медицинских экспертиз и исследований",
                "children": [],
                "path": "Q/86/8690/86901/"
              },
              {
                "code": "86909",
                "name": "Прочая деятельность в области здравоохранения, не включенная в другие группировки",
                "children": [],
                "path": "Q/86/8690/86909/"
              }
            ],
            "path": "Q/86/8690/"
          }
        ],
        "path": "Q/86/"
      },
      {
        "code": "87",
        "name": "Деятельность в области социального обслуживания населения с обеспечением проживания",
        "children": [
          {
            "code": "871",
            "name": "Предоставление специальных социальных услуг с обеспечением проживания и ухода за пациентами средним медицинским персоналом",
            "children": [],
            "path": "Q/87/871/"
          },
          {
            "code": "8710",
            "name": "Предоставление специальных социальных услуг с обеспечением проживания и ухода за пациентами средним медицинским персоналом",
            "children": [],
            "path": "Q/87/8710/"
          },
          {
            "code": "87100",
            "name": "Предоставление специальных социальных услуг с обеспечением проживания и ухода за пациентами средним медицинским персоналом",
            "children": [],
            "path": "Q/87/87100/"
          },
          {
            "code": "872",
            "name": "Предоставление специальных социальных услуг с обеспечением проживания лицам, страдающим психическими расстройствами (заболеваниями), задержкой умственного развития и физическими недостатками, алкогольной или наркотической зависимостью",
            "children": [],
            "path": "Q/87/872/"
          },
          {
            "code": "8720",
            "name": "Предоставление специальных социальных услуг с обеспечением проживания лицам, страдающим психическими расстройствами (заболеваниями), задержкой умственного развития и физическими недостатками, алкогольной или наркотической зависимостью",
            "children": [],
            "path": "Q/87/8720/"
          },
          {
            "code": "87200",
            "name": "Предоставление специальных социальных услуг с обеспечением проживания лицам, страдающим психическими расстройствами (заболеваниями), задержкой умственного развития и физическими недостатками, алкогольной или наркотической зависимостью",
            "children": [],
            "path": "Q/87/87200/"
          },
          {
            "code": "873",
            "name": "Предоставление специальных социальных услуг с обеспечением проживания пожилым гражданам и лицам с инвалидностью",
            "children": [],
            "path": "Q/87/873/"
          },
          {
            "code": "8730",
            "name": "Предоставление специальных социальных услуг с обеспечением проживания пожилым гражданам и лицам с инвалидностью",
            "children": [],
            "path": "Q/87/8730/"
          },
          {
            "code": "87300",
            "name": "Предоставление специальных социальных услуг с обеспечением проживания пожилым гражданам и лицам с инвалидностью",
            "children": [],
            "path": "Q/87/87300/"
          },
          {
            "code": "879",
            "name": "Ппредоставление прочих социальных услуг с обеспечением проживания",
            "children": [],
            "path": "Q/87/879/"
          },
          {
            "code": "8790",
            "name": "Ппредоставление прочих социальных услуг с обеспечением проживания",
            "children": [],
            "path": "Q/87/8790/"
          },
          {
            "code": "87900",
            "name": "Ппредоставление прочих социальных услуг с обеспечением проживания",
            "children": [],
            "path": "Q/87/87900/"
          }
        ],
        "path": "Q/87/"
      },
      {
        "code": "88",
        "name": "Деятельность в области социального обслуживания населения без обеспечения проживания",
        "children": [
          {
            "code": "881",
            "name": "Предоставление специальных социальных услуг без обеспечения проживания пожилым гражданам и лицам с инвалидностью",
            "children": [],
            "path": "Q/88/881/"
          },
          {
            "code": "8810",
            "name": "Предоставление специальных социальных услуг без обеспечения проживания пожилым гражданам и лицам с инвалидностью",
            "children": [],
            "path": "Q/88/8810/"
          },
          {
            "code": "88100",
            "name": "Предоставление специальных социальных услуг без обеспечения проживания пожилым гражданам и лицам с инвалидностью",
            "children": [],
            "path": "Q/88/88100/"
          },
          {
            "code": "889",
            "name": "Предоставление прочих социальных услуг без обеспечения проживания",
            "children": [
              {
                "code": "8891",
                "name": "Дневной уход за детьми",
                "children": [],
                "path": "Q/88/889/8891/"
              },
              {
                "code": "88910",
                "name": "Дневной уход за детьми",
                "children": [],
                "path": "Q/88/889/88910/"
              },
              {
                "code": "8899",
                "name": "Предоставление прочих социальных услуг без обеспечения проживания, не включенные в другие группировки",
                "children": [],
                "path": "Q/88/889/8899/"
              },
              {
                "code": "88990",
                "name": "Предоставление прочих социальных услуг без обеспечения проживания, не включенные в другие группировки",
                "children": [],
                "path": "Q/88/889/88990/"
              }
            ],
            "path": "Q/88/889/"
          }
        ],
        "path": "Q/88/"
      }
    ],
    "path": "Q/"
  },
  {
    "code": "R",
    "name": "Искусство, развлечения и отдых",
    "children": [
      {
        "code": "90",
        "name": "Деятельность в области творчества, искусства и развлечений",
        "children": [
          {
            "code": "91",
            "name": "Деятельность библиотек, архивов, музеев и прочая деятельность в области культуры",
            "children": [],
            "path": "R/90/91/"
          },
          {
            "code": "92",
            "name": "Деятельность по организации азартных игр и заключению пари",
            "children": [],
            "path": "R/90/92/"
          },
          {
            "code": "93",
            "name": "Деятельность в области спорта, организации отдыха и развлечений",
            "children": [],
            "path": "R/90/93/"
          }
        ],
        "path": "R/90/"
      },
      {
        "code": "900",
        "name": "Деятельность в области творчества, искусства и развлечений",
        "children": [
          {
            "code": "9001",
            "name": "Артистическая деятельность",
            "children": [
              {
                "code": "90011",
                "name": "Театральная деятельность",
                "children": [],
                "path": "R/900/9001/90011/"
              },
              {
                "code": "90012",
                "name": "Концертная деятельность",
                "children": [],
                "path": "R/900/9001/90012/"
              },
              {
                "code": "90013",
                "name": "Деятельность цирков",
                "children": [],
                "path": "R/900/9001/90013/"
              }
            ],
            "path": "R/900/9001/"
          },
          {
            "code": "9002",
            "name": "Деятельность, способствующая проведению культурно-зрелищных мероприятий",
            "children": [],
            "path": "R/900/9002/"
          },
          {
            "code": "90020",
            "name": "Деятельность, способствующая проведению культурно-зрелищных мероприятий",
            "children": [],
            "path": "R/900/90020/"
          },
          {
            "code": "9003",
            "name": "Художественное и литературное творчество",
            "children": [],
            "path": "R/900/9003/"
          },
          {
            "code": "90030",
            "name": "Художественное и литературное творчество",
            "children": [],
            "path": "R/900/90030/"
          },
          {
            "code": "9004",
            "name": "Деятельность концертных и театральных залов",
            "children": [],
            "path": "R/900/9004/"
          },
          {
            "code": "90040",
            "name": "Деятельность концертных и театральных залов",
            "children": [],
            "path": "R/900/90040/"
          },
          {
            "code": "910",
            "name": "Деятельность библиотек, архивов, музеев и прочая деятельность в области культуры",
            "children": [
              {
                "code": "9101",
                "name": "Деятельность библиотек и архивов",
                "children": [
                  {
                    "code": "91011",
                    "name": "Деятельность фильмо- и фонотек",
                    "children": [],
                    "path": "R/900/910/9101/91011/"
                  },
                  {
                    "code": "91012",
                    "name": "Библиотечная деятельность, включая деятельность читальных залов, лекториев, демонстрационных залов",
                    "children": [],
                    "path": "R/900/910/9101/91012/"
                  },
                  {
                    "code": "91013",
                    "name": "Деятельность архивов",
                    "children": [],
                    "path": "R/900/910/9101/91013/"
                  },
                  {
                    "code": "91014",
                    "name": "Деятельность книжных палат",
                    "children": [],
                    "path": "R/900/910/9101/91014/"
                  }
                ],
                "path": "R/900/910/9101/"
              },
              {
                "code": "9102",
                "name": "Деятельность музеев",
                "children": [],
                "path": "R/900/910/9102/"
              },
              {
                "code": "91020",
                "name": "Деятельность музеев",
                "children": [],
                "path": "R/900/910/91020/"
              },
              {
                "code": "9103",
                "name": "Деятельность исторических мест и зданий и аналогичных туристических достопримечательностей",
                "children": [],
                "path": "R/900/910/9103/"
              },
              {
                "code": "91030",
                "name": "Деятельность исторических мест и зданий и аналогичных туристических достопримечательностей",
                "children": [],
                "path": "R/900/910/91030/"
              },
              {
                "code": "9104",
                "name": "Деятельность ботанических садов, зоопарков и природных заповедников",
                "children": [
                  {
                    "code": "91041",
                    "name": "Деятельность ботанических садов и зоопарков",
                    "children": [],
                    "path": "R/900/910/9104/91041/"
                  },
                  {
                    "code": "91042",
                    "name": "Деятельность природных заповедников, охрана дикой природы",
                    "children": [],
                    "path": "R/900/910/9104/91042/"
                  }
                ],
                "path": "R/900/910/9104/"
              }
            ],
            "path": "R/900/910/"
          },
          {
            "code": "920",
            "name": "Деятельность по организации азартных игр и заключению пари",
            "children": [],
            "path": "R/900/920/"
          },
          {
            "code": "931",
            "name": "Деятельность в области спорта",
            "children": [
              {
                "code": "9311",
                "name": "Эксплуатация спортивных сооружений",
                "children": [],
                "path": "R/900/931/9311/"
              },
              {
                "code": "93110",
                "name": "Эксплуатация спортивных сооружений",
                "children": [],
                "path": "R/900/931/93110/"
              },
              {
                "code": "9312",
                "name": "Деятельность спортивных клубов",
                "children": [],
                "path": "R/900/931/9312/"
              },
              {
                "code": "93120",
                "name": "Деятельность спортивных клубов",
                "children": [],
                "path": "R/900/931/93120/"
              },
              {
                "code": "9313",
                "name": "Деятельность фитнес-клубов",
                "children": [],
                "path": "R/900/931/9313/"
              },
              {
                "code": "93130",
                "name": "Деятельность фитнес-клубов",
                "children": [],
                "path": "R/900/931/93130/"
              },
              {
                "code": "9319",
                "name": "Прочая деятельность в области спорта",
                "children": [],
                "path": "R/900/931/9319/"
              },
              {
                "code": "93190",
                "name": "Прочая деятельность в области спорта",
                "children": [],
                "path": "R/900/931/93190/"
              }
            ],
            "path": "R/900/931/"
          },
          {
            "code": "932",
            "name": "Деятельность по организации отдыха и развлечений",
            "children": [
              {
                "code": "9321",
                "name": "Деятельность развлекательных и тематических парков",
                "children": [],
                "path": "R/900/932/9321/"
              },
              {
                "code": "93210",
                "name": "Деятельность развлекательных и тематических парков",
                "children": [],
                "path": "R/900/932/93210/"
              },
              {
                "code": "9329",
                "name": "Прочая деятельность по организации отдыха и развлечений",
                "children": [
                  {
                    "code": "93291",
                    "name": "Деятельность танцевальных залов, дискотек",
                    "children": [],
                    "path": "R/900/932/9329/93291/"
                  },
                  {
                    "code": "93292",
                    "name": "Деятельность родео, тиров",
                    "children": [],
                    "path": "R/900/932/9329/93292/"
                  },
                  {
                    "code": "93293",
                    "name": "Деятельность кукольных театров",
                    "children": [],
                    "path": "R/900/932/9329/93293/"
                  },
                  {
                    "code": "93299",
                    "name": "Прочие виды деятельности по организации отдыха и развлечений",
                    "children": [],
                    "path": "R/900/932/9329/93299/"
                  }
                ],
                "path": "R/900/932/9329/"
              }
            ],
            "path": "R/900/932/"
          }
        ],
        "path": "R/900/"
      },
      {
        "code": "9200",
        "name": "Деятельность по организации азартных игр и заключению пари",
        "children": [],
        "path": "R/9200/"
      },
      {
        "code": "92000",
        "name": "Деятельность по организации азартных игр и заключению пари",
        "children": [],
        "path": "R/92000/"
      }
    ],
    "path": "R/"
  },
  {
    "code": "S",
    "name": "Предоставление прочих видов услуг",
    "children": [
      {
        "code": "94",
        "name": "Деятельность общественных объединений (организаций)",
        "children": [
          {
            "code": "941",
            "name": "Деятельность коммерческих, предпринимательских и профессиональных общественных организаций",
            "children": [
              {
                "code": "9411",
                "name": "Деятельность коммерческих и предпринимательских общественных организаций",
                "children": [],
                "path": "S/94/941/9411/"
              },
              {
                "code": "94110",
                "name": "Деятельность коммерческих и предпринимательских общественных организаций",
                "children": [],
                "path": "S/94/941/94110/"
              },
              {
                "code": "9412",
                "name": "Деятельность профессиональных общественных организаций",
                "children": [],
                "path": "S/94/941/9412/"
              },
              {
                "code": "94120",
                "name": "Деятельность профессиональных общественных организаций",
                "children": [],
                "path": "S/94/941/94120/"
              }
            ],
            "path": "S/94/941/"
          },
          {
            "code": "942",
            "name": "Деятельность профессиональных союзов",
            "children": [],
            "path": "S/94/942/"
          },
          {
            "code": "9420",
            "name": "Деятельность профессиональных союзов",
            "children": [],
            "path": "S/94/9420/"
          },
          {
            "code": "94200",
            "name": "Деятельность профессиональных союзов",
            "children": [],
            "path": "S/94/94200/"
          },
          {
            "code": "949",
            "name": "Деятельность прочих общественных объединений",
            "children": [
              {
                "code": "9491",
                "name": "Деятельность религиозных организаций",
                "children": [],
                "path": "S/94/949/9491/"
              },
              {
                "code": "94910",
                "name": "Деятельность религиозных организаций",
                "children": [],
                "path": "S/94/949/94910/"
              },
              {
                "code": "9492",
                "name": "Деятельность политических организаций",
                "children": [],
                "path": "S/94/949/9492/"
              },
              {
                "code": "94920",
                "name": "Деятельность политических организаций",
                "children": [],
                "path": "S/94/949/94920/"
              },
              {
                "code": "9499",
                "name": "Деятельность прочих общественных организаций, не включенных в другие группировки",
                "children": [],
                "path": "S/94/949/9499/"
              },
              {
                "code": "94990",
                "name": "Деятельность прочих общественных организаций, не включенных в другие группировки",
                "children": [],
                "path": "S/94/949/94990/"
              }
            ],
            "path": "S/94/949/"
          }
        ],
        "path": "S/94/"
      },
      {
        "code": "95",
        "name": "Ремонт компьютеров, предметов личного потребления и бытовых товаров",
        "children": [
          {
            "code": "951",
            "name": "Ремонт компьютеров и коммуникационного оборудования",
            "children": [
              {
                "code": "9511",
                "name": "Ремонт компьютеров и периферийного оборудования",
                "children": [],
                "path": "S/95/951/9511/"
              },
              {
                "code": "95110",
                "name": "Ремонт компьютеров и периферийного оборудования",
                "children": [],
                "path": "S/95/951/95110/"
              },
              {
                "code": "9512",
                "name": "Ремонт коммуникационного оборудования",
                "children": [],
                "path": "S/95/951/9512/"
              },
              {
                "code": "95120",
                "name": "Ремонт коммуникационного оборудования",
                "children": [],
                "path": "S/95/951/95120/"
              }
            ],
            "path": "S/95/951/"
          },
          {
            "code": "952",
            "name": "Ремонт предметов личного потребления и бытовых товаров",
            "children": [
              {
                "code": "9521",
                "name": "Ремонт электронной бытовой техники",
                "children": [],
                "path": "S/95/952/9521/"
              },
              {
                "code": "95210",
                "name": "Ремонт электронной бытовой техники",
                "children": [],
                "path": "S/95/952/95210/"
              },
              {
                "code": "9522",
                "name": "Ремонт бытовых приборов, домашнего и садового оборудования",
                "children": [],
                "path": "S/95/952/9522/"
              },
              {
                "code": "95220",
                "name": "Ремонт бытовых приборов, домашнего и садового оборудования",
                "children": [],
                "path": "S/95/952/95220/"
              },
              {
                "code": "9523",
                "name": "Ремонт обуви и изделий из кожи",
                "children": [
                  {
                    "code": "95231",
                    "name": "Ремонт обуви",
                    "children": [],
                    "path": "S/95/952/9523/95231/"
                  },
                  {
                    "code": "95232",
                    "name": "Ремонт дорожных и галантерейных изделий из натуральной и искусственной кожи",
                    "children": [],
                    "path": "S/95/952/9523/95232/"
                  }
                ],
                "path": "S/95/952/9523/"
              },
              {
                "code": "9524",
                "name": "Ремонт мебели и предметов интерьера",
                "children": [],
                "path": "S/95/952/9524/"
              },
              {
                "code": "95240",
                "name": "Ремонт мебели и предметов интерьера",
                "children": [],
                "path": "S/95/952/95240/"
              },
              {
                "code": "9525",
                "name": "Ремонт часов и ювелирных изделий",
                "children": [
                  {
                    "code": "95251",
                    "name": "Ремонт наручных и прочих часов",
                    "children": [],
                    "path": "S/95/952/9525/95251/"
                  },
                  {
                    "code": "95252",
                    "name": "Ремонт ювелирных изделий",
                    "children": [],
                    "path": "S/95/952/9525/95252/"
                  }
                ],
                "path": "S/95/952/9525/"
              },
              {
                "code": "9529",
                "name": "Ремонт прочих предметов личного потребления и бытовых товаров",
                "children": [
                  {
                    "code": "95291",
                    "name": "Ремонт трикотажных и вязаных изделий",
                    "children": [],
                    "path": "S/95/952/9529/95291/"
                  },
                  {
                    "code": "95292",
                    "name": "Ремонт швейных изделий, головных уборов и изделий текстильной галантереи",
                    "children": [],
                    "path": "S/95/952/9529/95292/"
                  },
                  {
                    "code": "95293",
                    "name": "Ремонт меховых и кожаных изделий и головных уборов",
                    "children": [],
                    "path": "S/95/952/9529/95293/"
                  },
                  {
                    "code": "95294",
                    "name": "Ремонт музыкальных инструментов",
                    "children": [],
                    "path": "S/95/952/9529/95294/"
                  },
                  {
                    "code": "95295",
                    "name": "Ремонт ковров и ковровых изделий",
                    "children": [],
                    "path": "S/95/952/9529/95295/"
                  },
                  {
                    "code": "95296",
                    "name": "Ремонт велосипедов",
                    "children": [],
                    "path": "S/95/952/9529/95296/"
                  },
                  {
                    "code": "95299",
                    "name": "Ремонт прочих предметов личного потребления и бытовых товаров, не включенных в другие группировки",
                    "children": [],
                    "path": "S/95/952/9529/95299/"
                  }
                ],
                "path": "S/95/952/9529/"
              }
            ],
            "path": "S/95/952/"
          }
        ],
        "path": "S/95/"
      },
      {
        "code": "96",
        "name": "Предоставление прочих индивидуальных услуг",
        "children": [],
        "path": "S/96/"
      },
      {
        "code": "960",
        "name": "Предоставление прочих индивидуальных услуг",
        "children": [
          {
            "code": "9601",
            "name": "Стирка и (химическая) чистка текстильных и меховых изделий",
            "children": [
              {
                "code": "96011",
                "name": "Стирка и обработка белья",
                "children": [],
                "path": "S/960/9601/96011/"
              },
              {
                "code": "96012",
                "name": "Химическая чистка и крашение",
                "children": [],
                "path": "S/960/9601/96012/"
              }
            ],
            "path": "S/960/9601/"
          },
          {
            "code": "9602",
            "name": "Предоставление услуг парикмахерскими и салонами красоты",
            "children": [],
            "path": "S/960/9602/"
          },
          {
            "code": "96020",
            "name": "Предоставление услуг парикмахерскими и салонами красоты",
            "children": [],
            "path": "S/960/96020/"
          },
          {
            "code": "9603",
            "name": "Организация похорон и связанная с этим деятельность",
            "children": [],
            "path": "S/960/9603/"
          },
          {
            "code": "96030",
            "name": "Организация похорон и связанная с этим деятельность",
            "children": [],
            "path": "S/960/96030/"
          },
          {
            "code": "9604",
            "name": "Деятельность по обеспечению физического комфорта",
            "children": [],
            "path": "S/960/9604/"
          },
          {
            "code": "96040",
            "name": "Деятельность по обеспечению физического комфорта",
            "children": [],
            "path": "S/960/96040/"
          },
          {
            "code": "9609",
            "name": "Предоставление прочих индивидуальных услуг, не включенных в другие группировки",
            "children": [],
            "path": "S/960/9609/"
          },
          {
            "code": "96090",
            "name": "Предоставление прочих индивидуальных услуг, не включенных в другие группировки",
            "children": [],
            "path": "S/960/96090/"
          }
        ],
        "path": "S/960/"
      }
    ],
    "path": "S/"
  },
  {
    "code": "T",
    "name": "Деятельность домашних хозяйств, нанимающих домашнюю прислугу; деятельность домашних хозяйств по производству товаров и услуг для собственного потребления",
    "children": [
      {
        "code": "97",
        "name": "Деятельность домашних хозяйств, нанимающих домашнюю прислугу",
        "children": [],
        "path": "T/97/"
      },
      {
        "code": "970",
        "name": "Деятельность домашних хозяйств, нанимающих домашнюю прислугу",
        "children": [],
        "path": "T/970/"
      },
      {
        "code": "9700",
        "name": "Деятельность домашних хозяйств, нанимающих домашнюю прислугу",
        "children": [],
        "path": "T/9700/"
      },
      {
        "code": "97000",
        "name": "Деятельность домашних хозяйств, нанимающих домашнюю прислугу",
        "children": [],
        "path": "T/97000/"
      },
      {
        "code": "98",
        "name": "Деятельность домашних хозяйств по производству товаров и услуг для собственного потребления",
        "children": [
          {
            "code": "981",
            "name": "Деятельность домашних хозяйств по производству товаров для собственного потребления",
            "children": [],
            "path": "T/98/981/"
          },
          {
            "code": "9810",
            "name": "Деятельность домашних хозяйств по производству товаров для собственного потребления",
            "children": [],
            "path": "T/98/9810/"
          },
          {
            "code": "98100",
            "name": "Деятельность домашних хозяйств по производству товаров для собственного потребления",
            "children": [],
            "path": "T/98/98100/"
          },
          {
            "code": "982",
            "name": "Деятельность домашних хозяйств по предоставлению услуг для собственного потребления",
            "children": [],
            "path": "T/98/982/"
          },
          {
            "code": "9820",
            "name": "Деятельность домашних хозяйств по предоставлению услуг для собственного потребления",
            "children": [],
            "path": "T/98/9820/"
          },
          {
            "code": "98200",
            "name": "Деятельность домашних хозяйств по предоставлению услуг для собственного потребления",
            "children": [],
            "path": "T/98/98200/"
          }
        ],
        "path": "T/98/"
      }
    ],
    "path": "T/"
  },
  {
    "code": "U",
    "name": "Деятельность экстерриториальных организаций и органов",
    "children": [
      {
        "code": "99",
        "name": "Деятельность экстерриториальных организаций и органов",
        "children": [],
        "path": "U/99/"
      },
      {
        "code": "990",
        "name": "Деятельность экстерриториальных организаций и органов",
        "children": [],
        "path": "U/990/"
      },
      {
        "code": "9900",
        "name": "Деятельность экстерриториальных организаций и органов",
        "children": [],
        "path": "U/9900/"
      },
      {
        "code": "99000",
        "name": "Деятельность экстерриториальных организаций и органов",
        "children": [],
        "path": "U/99000/"
      }
    ],
    "path": "U/"
  }
]