product_dict = [
  {
    "name": "Продукты питания",
    "children": [
      {"name": "Готовые пищевые продукты", "children": [], "path": "Продукты питания/Готовые пищевые продукты/"},
      {"name": "Напитки", "children": [], "path": "Продукты питания/Напитки/"},
      {"name": "Кондитерские изделия", "children": [], "path": "Продукты питания/Кондитерские изделия/"},
      {"name": "Переработанное мясо и рыба", "children": [], "path": "Продукты питания/Переработанное мясо и рыба/"},
      {"name": "Готовые блюда", "children": [], "path": "Продукты питания/Готовые блюда/"},
      {"name": "Детское питание", "children": [], "path": "Продукты питания/Детское питание/"}
    ],
    "path": "Продукты питания/"
  },

  {
    "name": "Корма и кормовые продукты",
    "children": [
      {"name": "Комбикорма", "children": [], "path": "Корма и кормовые продукты/Комбикорма/"},
      {"name": "Кормовые добавки", "children": [], "path": "Корма и кормовые продукты/Кормовые добавки/"},
      {"name": "Премиксы", "children": [], "path": "Корма и кормовые продукты/Премиксы/"},
      {"name": "Готовые корма для животных", "children": [], "path": "Корма и кормовые продукты/Готовые корма для животных/"}
    ],
    "path": "Корма и кормовые продукты/"
  },

  {
    "name": "Текстильные изделия",
    "children": [
      {"name": "Ткани", "children": [], "path": "Текстильные изделия/Ткани/"},
      {"name": "Нетканые материалы", "children": [], "path": "Текстильные изделия/Нетканые материалы/"},
      {"name": "Технический текстиль", "children": [], "path": "Текстильные изделия/Технический текстиль/"},
      {"name": "Текстильные изделия бытового и промышленного назначения", "children": [], "path": "Текстильные изделия/Текстильные изделия бытового и промышленного назначения/"}
    ],
    "path": "Текстильные изделия/"
  },

  {
    "name": "Одежда и обувь",
    "children": [
      {"name": "Готовая одежда", "children": [], "path": "Одежда и обувь/Готовая одежда/"},
      {"name": "Трикотаж", "children": [], "path": "Одежда и обувь/Трикотаж/"},
      {"name": "Обувь", "children": [], "path": "Одежда и обувь/Обувь/"},
      {"name": "Аксессуары", "children": [], "path": "Одежда и обувь/Аксессуары/"}
    ],
    "path": "Одежда и обувь/"
  },

  {
    "name": "Химические товары",
    "children": [
      {"name": "Моющие средства", "children": [], "path": "Химические товары/Моющие средства/"},
      {"name": "Бытовая химия", "children": [], "path": "Химические товары/Бытовая химия/"},
      {"name": "Краски и лаки", "children": [], "path": "Химические товары/Краски и лаки/"},
      {"name": "Удобрения в товарной форме", "children": [], "path": "Химические товары/Удобрения в товарной форме/"},
      {"name": "Косметика и парфюмерия", "children": [], "path": "Химические товары/Косметика и парфюмерия/"}
    ],
    "path": "Химические товары/"
  },

  {
    "name": "Изделия из пластмасс и резины",
    "children": [
      {"name": "Упаковка и тара", "children": [], "path": "Изделия из пластмасс и резины/Упаковка и тара/"},
      {"name": "Плёнки", "children": [], "path": "Изделия из пластмасс и резины/Плёнки/"},
      {"name": "Полимерные изделия", "children": [], "path": "Изделия из пластмасс и резины/Полимерные изделия/"},
      {"name": "Резинотехнические изделия", "children": [], "path": "Изделия из пластмасс и резины/Резинотехнические изделия/"},
      {"name": "Пластиковые изделия бытового и промышленного назначения", "children": [], "path": "Изделия из пластмасс и резины/Пластиковые изделия бытового и промышленного назначения/"}
    ],
    "path": "Изделия из пластмасс и резины/"
  },

  {
    "name": "Металлоизделия",
    "children": [
      {"name": "Готовые изделия из металла", "children": [], "path": "Металлоизделия/Готовые изделия из металла/"},
      {"name": "Крепёж", "children": [], "path": "Металлоизделия/Крепёж/"},
      {"name": "Металлические конструкции", "children": [], "path": "Металлоизделия/Металлические конструкции/"},
      {"name": "Бытовые и хозяйственные металлические изделия", "children": [], "path": "Металлоизделия/Бытовые и хозяйственные металлические изделия/"}
    ],
    "path": "Металлоизделия/"
  },

  {
    "name": "Машины и оборудование",
    "children": [
      {"name": "Промышленное оборудование", "children": [], "path": "Машины и оборудование/Промышленное оборудование/"},
      {"name": "Машины и техника", "children": [], "path": "Машины и оборудование/Машины и техника/"},
      {"name": "Механизмы и агрегаты", "children": [], "path": "Машины и оборудование/Механизмы и агрегаты/"},
      {"name": "Комплектующие и запчасти", "children": [], "path": "Машины и оборудование/Комплектующие и запчасти/"}
    ],
    "path": "Машины и оборудование/"
  },

  {
    "name": "Электроника и электротовары",
    "children": [
      {"name": "Электронные устройства", "children": [], "path": "Электроника и электротовары/Электронные устройства/"},
      {"name": "Бытовая техника", "children": [], "path": "Электроника и электротовары/Бытовая техника/"},
      {"name": "Электрическое оборудование", "children": [], "path": "Электроника и электротовары/Электрическое оборудование/"},
      {"name": "Кабельно-проводниковая продукция", "children": [], "path": "Электроника и электротовары/Кабельно-проводниковая продукция/"}
    ],
    "path": "Электроника и электротовары/"
  },

  {
    "name": "Строительные и отделочные материалы",
    "children": [
      {"name": "Материалы для строительства и ремонта", "children": [], "path": "Строительные и отделочные материалы/Материалы для строительства и ремонта/"},
      {"name": "Отделочные материалы", "children": [], "path": "Строительные и отделочные материалы/Отделочные материалы/"},
      {"name": "Стекло и керамика", "children": [], "path": "Строительные и отделочные материалы/Стекло и керамика/"},
      {"name": "Сантехнические изделия", "children": [], "path": "Строительные и отделочные материалы/Сантехнические изделия/"}
    ],
    "path": "Строительные и отделочные материалы/"
  },

  {
    "name": "Деревянные изделия и бумажная продукция",
    "children": [
      {"name": "Мебель", "children": [], "path": "Деревянные изделия и бумажная продукция/Мебель/"},
      {"name": "Изделия из дерева", "children": [], "path": "Деревянные изделия и бумажная продукция/Изделия из дерева/"},
      {"name": "Бумага и картон", "children": [], "path": "Деревянные изделия и бумажная продукция/Бумага и картон/"},
      {"name": "Упаковка и санитарно-гигиенические бумажные изделия", "children": [], "path": "Деревянные изделия и бумажная продукция/Упаковка и санитарно-гигиенические бумажные изделия/"}
    ],
    "path": "Деревянные изделия и бумажная продукция/"
  },

  {
    "name": "Медицинские и фармацевтические товары",
    "children": [
      {"name": "Лекарственные средства", "children": [], "path": "Медицинские и фармацевтические товары/Лекарственные средства/"},
      {"name": "Медицинские изделия", "children": [], "path": "Медицинские и фармацевтические товары/Медицинские изделия/"},
      {"name": "Расходные материалы", "children": [], "path": "Медицинские и фармацевтические товары/Расходные материалы/"}
    ],
    "path": "Медицинские и фармацевтические товары/"
  },

  {
    "name": "Товары бытового назначения",
    "children": [
      {"name": "Посуда", "children": [], "path": "Товары бытового назначения/Посуда/"},
      {"name": "Хозяйственные товары", "children": [], "path": "Товары бытового назначения/Хозяйственные товары/"},
      {"name": "Товары для дома и офиса", "children": [], "path": "Товары бытового назначения/Товары для дома и офиса/"},
      {"name": "Бытовые принадлежности и инвентарь", "children": [], "path": "Товары бытового назначения/Бытовые принадлежности и инвентарь/"}
    ],
    "path": "Товары бытового назначения/"
  },

  {
    "name": "Прочие готовые товары",
    "children": [
      {"name": "Спортивные товары", "children": [], "path": "Прочие готовые товары/Спортивные товары/"},
      {"name": "Игрушки", "children": [], "path": "Прочие готовые товары/Игрушки/"},
      {"name": "Товары для отдыха", "children": [], "path": "Прочие готовые товары/Товары для отдыха/"},
      {"name": "Специализированные изделия", "children": [], "path": "Прочие готовые товары/Специализированные изделия/"}
    ],
    "path": "Прочие готовые товары/"
  },
  {
    "name": "Сельскохозяйственное сырьё",
    "children": [
      {"name": "Зерновые культуры", "children": [], "path": "Сельскохозяйственное сырьё/Зерновые культуры/"},
      {"name": "Масличные культуры", "children": [], "path": "Сельскохозяйственное сырьё/Масличные культуры/"},
      {"name": "Бобовые культуры", "children": [], "path": "Сельскохозяйственное сырьё/Бобовые культуры/"},
      {"name": "Сырьё животного происхождения", "children": [], "path": "Сельскохозяйственное сырьё/Сырьё животного происхождения/"},
      {"name": "Сельскохозяйственное сырьё растительного происхождения", "children": [], "path": "Сельскохозяйственное сырьё/Сельскохозяйственное сырьё растительного происхождения/"}
    ],
    "path": "Сельскохозяйственное сырьё/"
  }

]
